{"title":"Michael Cobley - The Orphaned Worlds (Humanity's Fire #2)","uid":13687637,"size":522139313,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:03967a886c8cab986589f5d1fbb61e0a2adaf99e&amp;dn=Michael+Cobley+-+The+Orphaned+Worlds+%28Humanity%27s+Fire+%232%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Cybotage","files":40,"time":1456572946,"description":"Darien is no longer a lost outpost of humanity, but the prize in an intergalactic power struggle. Hegemony forces have a stranglehold over the planet and crack troops patrol its hotspots while Earth watches, passive, rendered impotent by galactic politics. But its Darien ambassador will soon become a player in a greater conflict. There is more at stake than a turf war on a newly discovered world. An ancient Uvovo temple hide's access to a hyperspace prison, housing the greatest threat sentient life has ever known. Millennia ago, malignant intelligences were caged there following an apocalyptic war. And their servants work on their release.\r\n\r\nHowever, Darien's guardians have not been idle, gathering resistance on the planet's forest moon. Knowledge has been lost since great races battled in eons past, and now time is short. The galaxy will depend on the Uvovo reclaiming their past - and humanity must look to its future. For a new war is coming.\r\n\r\nFrom the author: &quot;Audible did a great job with the audiobooks of Seeds Of Earth and The Orphaned Worlds - and David Thorpe is one versatile guy, able to lend his vocal talents to every strange character I was able to think up. Just excellent!&quot;\r\n\r\n\r\n\r\nRead by David Thorpe\r\nFormat: MP3\r\nBitrate: 64 Kbps\r\nUnabridged","torrent":{"xt":"urn:btih:03967a886c8cab986589f5d1fbb61e0a2adaf99e","amp;dn":"Michael+Cobley+-+The+Orphaned+Worlds+%28Humanity%27s+Fire+%232%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03967a886c8cab986589f5d1fbb61e0a2adaf99e","infoHashBuffer":{"type":"Buffer","data":[3,150,122,136,108,140,171,152,101,137,245,209,251,182,30,10,42,218,249,158]},"announce":[],"urlList":[]}}