{"title":"Stargate SG-1 - Season 04 - Episodes 1 thru 11","uid":14114120,"size":6812233500,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:045d19406ae10b414a4bfd005521241709213373&amp;dn=Stargate+SG-1+-+Season+04+-+Episodes+1+thru+11&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":39,"time":1459393731,"description":"\n\r\nStargate SG-1 Season Four Episode Guides\r\n4.01 &quot;Small Victories Part 2&quot;\r\nSG-1 is called upon to help a race of gentle, highly intelligent aliens struggling against a swarm of ravenous, deadly mechanical spiders called replicators. But the situation becomes much more complicated when a lone replicator is discovered in the most unlikely of places…back home on Planet Earth!\r\n\r\nGuide | Transcript\r\n401eg.jpg\r\n4.02 &quot;The Other Side&quot;\r\nSG-1 responds to a cry for help from a doomed civilization, which promises to give Earthlings access to highly advanced technology in exchange for supplies that would help them defeat their enemies. But the team soon discovers a shocking secret that may prove that SG-1 is doing a lot more harm than good!\r\n\r\nGuide | Transcript\r\n402eg.jpg\r\n4.03 &quot;Upgrades&quot;\r\nSG-1 is selected to test the effects of alien tech military wristbands on human wearers, and soon find themselves blessed with spectacular strength and speed. But when they are sent on a mission utilizing these new abilities, they learn a shocking lesson about the downside of power.\r\n\r\nGuide | Transcript\r\n403eg.jpg\r\n4.04 &quot;Crossroads&quot;\r\nWhen a beautiful high priestess from the planet Chulak claims to have a plan that would seriously cripple the Goa'uld, everyone is understandably skeptical. SG-1 must join forces with the Tok'ra in order to put her plan into effect, but a deadly, hidden secret could jeopardize the entire operation!\r\n\r\nGuide | Transcript\r\n404eg.jpg\r\n4.05 &quot;Divide And Conquer&quot;\r\nWhen an SGC soldier under the influence of a Goa'uld mind control device attempts to assassinate a High Council member, SG-1 must uncover other potential assassins—even amongst themselves—before the president arrives for a crucial summit meeting.\r\n\r\nGuide | Transcript\r\n405eg.jpg\r\n4.06 &quot;Window Of Opportunity&quot;\r\nAfter SG-1 visits a strange planet in the middle of a geomagnetic storm, they find themselves repeating the same day over and over again. The team must utilize their accumulated knowledge to stop the time loop before there are disastrous consequences across the universe.\r\n\r\nGuide | Transcript\r\n406eg.jpg\r\n4.07 &quot;Watergate&quot;\r\nSG-1 joins forces with a beautiful Russian scientist to investigate a rogue Stargate in Siberia, linked to a mysterious water planet. The team must venture via submarine to the water planet, where they encounter an unexpectedly terrifying alien precense that just might destroy them all.\r\n\r\nGuide | Transcript\r\n407eg.jpg\r\n4.08 &quot;The First Ones&quot;\r\nDuring an archaeological survey of fossils on a Goa'uld planet, Daniel Jackson is abducted by a fearsome humanoid creature, prompting SG-1 to embark on a mission to free him from his alien captor. But Daniel soon learns that the creature's intentions are not at all what he thought.\r\n\r\nGuide | Transcript\r\n408eg.jpg\r\n4.09 &quot;Scorched Earth&quot;\r\nAfter relocating an endangered civilization to a &quot;safe&quot; new planet, the team realizes that another race of aliens is planning to incinerate the planet's surface to make it inhabitable for their own race. Will SG-1 be able to reason with the marauding aliens, or will their plans for interplanetary diplomacy go up in flames?\r\n\r\nGuide | Transcript\r\n409eg.jpg\r\n4.10 &quot;Beneath The Surface&quot;\r\nWith their memories erased and their identities changed, SG-1 find themselves trapped below a domed city on a planet of ice, toiling as slave laborers. Can they come to their senses and make a break for the surface, or will they remain enslaved underground for the rest of their lives?\r\n\r\nGuide | Transcript\r\n410eg.jpg\r\n4.11 &quot;Point Of No Return&quot;\r\nWhen a quirky conspiracy theorist contacts SG-1 claiming to know classified information about the Stargate, at first they think he's bluffing. But when they investigate his wild claims, they realize he's a lot closer to the truth than they thought…and has a few more shocking surprises up his sleeve","torrent":{"xt":"urn:btih:045d19406ae10b414a4bfd005521241709213373","amp;dn":"Stargate+SG-1+-+Season+04+-+Episodes+1+thru+11","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"045d19406ae10b414a4bfd005521241709213373","infoHashBuffer":{"type":"Buffer","data":[4,93,25,64,106,225,11,65,74,75,253,0,85,33,36,23,9,33,51,115]},"announce":[],"urlList":[]}}