{"title":"Freedom Fighter Times - Dawn of Human 2.0 Nanobot implants could","uid":13648023,"size":78140742,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:07384e6c2a8777e6f7b0ca0712897bd48f8b7016&amp;dn=Freedom+Fighter+Times+-+Dawn+of+Human+2.0+Nanobot+implants+could&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"roflcopter2110","files":1,"time":1456179127,"description":"Freedom Fighter Times - Dawn of Human 2.0 Nanobot implants could soon connect our brains to the internet\r\n\r\nHuman 2.0? The emergence of biotechnology in this modern world is very much welcomed. However, the consequences are always forsaken. Recent history has proven time and time again that mankind cannot genetically alter itself without drastic effects. Such effects have drastic consequences on children, which seem to be the primary target of modern science. The claim that technology helps advance children, is a flat out lie. Science created the problems that they are now attempting to fix through modern medicine. The dawn of humans 2.0, is mankind’s attempt at becoming a god-like beings; by connecting his or her brain to the world wide web. Information is valuable but it can also be private. Connecting a brain to the internet would both destroy the brain because of information overload, and it would rid that individual of all personal privacy. It all can be traced back to the fact that the governments of the world, want to govern our most private moments, our thoughts.\r\n\r\nBrain-computer interfaces are the craze right now for science, psychology, and technology. Companies and organizations, DARPA for example, are looking to bridge the divide between man and machine. This new craze bares the weight of the world, for it will not just change the in-depth scope of how we, humans, communicate with machines; but it will facilitate the rise of the mark of the beast through technology","torrent":{"xt":"urn:btih:07384e6c2a8777e6f7b0ca0712897bd48f8b7016","amp;dn":"Freedom+Fighter+Times+-+Dawn+of+Human+2.0+Nanobot+implants+could","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07384e6c2a8777e6f7b0ca0712897bd48f8b7016","infoHashBuffer":{"type":"Buffer","data":[7,56,78,108,42,135,119,230,247,176,202,7,18,137,123,212,143,139,112,22]},"announce":[],"urlList":[]}}