{"title":"The.Last.Seabird.Summer--BBC-2016-w.subs-720p","uid":13814097,"size":2126843230,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:082cc204deb18bb151561e86efe010e530ce9184&amp;dn=The.Last.Seabird.Summer--BBC-2016-w.subs-720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"uggauga","files":4,"time":1457639537,"description":"The Last Seabird Summer?\r\n\r\nSeries following Adam Nicolson and the seabirds of the Shiants, a small cluster of Scottish islands. With crisis threatening their future, Adam traces the history of our relationship with seabirds.\r\n\r\nBBC (2016) - 2 Episodes\r\n \nhttp://www.bbc.co.uk/programmes/b072rnjc\r\n_______________________________________\r\n\r\n1280x720 resolution\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - enjoy !!\r\n_______________________________________\r\n\r\nLiving with the Birds - Episode 1 of 2\r\nIn episode one, Adam Nicolson follows the story of the seabirds on the Shiant Isles in the Outer Hebrides off the west coast of Scotland, one of the most important bird places of Europe. As the puffins, guillemots and razorbills arrive from far out in the North Atlantic, Adam traces our long history of dependence on seabirds - thousands of years of collecting eggs and hunting the birds for meat, oil and feathers.\r\nBut there's crisis in our seabird population - in the last fifteen years in Scotland alone, 40 per cent have been lost. And although in Britain our relationship is now one of conservation, there are countries who still hunt the seabird. To understand how this tradition continues today, Adam travels to Iceland, home to over half the world's puffins, and meets those for whom the puffin hunt is still part of everyday life.\r\n\r\nTrouble at Sea - Episode 2 of 2\r\nPicking up the birds' progress in July, Adam finds the Shiants colonies to be healthy and the puffins, guillemots and razorbill bringing in great bill-fulls of gleaming silver fish for their chicks. But elsewhere the sea is failing to provide the birds with the food they need to survive.\r\nIn Scotland alone, 40 per cent of the birds have been lost and, further afield in Iceland, Adam sees colonies where nearly all the birds have been wiped out. He discovers how puffin hunters respond to the crisis and talks to both local people and experts about what could lie behind the catastrophic seabird declines. With the help of leading ornithologists and marine scientists, he begins to reveal an unexpected picture of the global forces driving the crisis, and the possible future for our seabird world","torrent":{"xt":"urn:btih:082cc204deb18bb151561e86efe010e530ce9184","amp;dn":"The.Last.Seabird.Summer--BBC-2016-w.subs-720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"082cc204deb18bb151561e86efe010e530ce9184","infoHashBuffer":{"type":"Buffer","data":[8,44,194,4,222,177,139,177,81,86,30,134,239,224,16,229,48,206,145,132]},"announce":[],"urlList":[]}}