{"title":"Kade","uid":13581858,"size":13040,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:0c0b9e6ca5b36b33c88fa0d9580f30d35d2cec97&amp;dn=Kade&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rrrr14","files":1,"time":1455752709,"description":"pple CEO Tim Cook speaks in Milan, Italy, on Nov. 15. Cook has vowed to fight a court order compelling the tech company to help the FBI defeat security measures on a phone belonging to the San Bernardino shooters. (Luca Bruno / Associated Press)\r\nTracey Lien, James Queally, Brian Bennett, Paresh Dave and Richard WintonContact Reporters\r\n \r\nCybersecurity experts warned Wednesday that the battle over a court order requiring Apple to help the FBI access encrypted data on a cellphone belonging to the couple who killed 14 people in San Bernardino will have far-reaching consequences for the tech industry.\r\n\r\nThe dispute, the latest chapter in a long-brewing battle between Silicon Valley and Washington, D.C., over the tech industry's role in combating terror plots, will now shift from a philosophical disagreement to a very real courthouse fight after Apple said it would not comply with the order.\r\n\r\nIn an open letter published early Wednesday morning, Apple Inc. CEO Tim Cook vowed to fight the directive issued earlier this week and said the FBI's call for the company to help defeat security measures on a phone belonging to Syed Rizwan Farook would be a major blow to customer privacy.\r\n\r\nSee more of our top stories on&gt;&gt;\r\n\r\n&quot;Building a version of iOS that bypasses security in this way would undeniably create a backdoor,&quot; Cook wrote. &quot;And while the government may argue that its use would be limited to this case, there is no way to guarantee such control.&quot;\r\n\r\nApple plans to file an opposition to the magistrate's ruling within the next four days, according to an executive familiar with the matter who spoke on condition of anonymity.\r\n\r\nThe court order marks the first time Apple has been asked to modify its software to access data sought by the government, the executive said. \r\n\r\nOn Tuesday, U.S. Magistrate Judge Sheri Pym in Riverside directed Apple to help the FBI get around the phone's passcode protection and the device's auto-erase function, which would permanently destroy any encrypted data on the phone after 10 unsuccessful login attempts. \r\n\r\nIn a motion filed earlier Tuesday, the FBI argued that Farook intentionally disabled the phone's iCloud backup function six weeks before the Dec. 2 terror attack at the Inland Regional Center. Any communications linked to the shooting, as well as location data that might help the FBI map the movements of Farook and his wife, Tashfeen Malik, after the attack are accessible only through the phone itself, the government argued.\r\n\r\nApple CEO Tim Cook explains why helping the FBI in terror phone probe is 'threat to data security'\r\nInvestigators want to unlock the phone by using a computer program to automatically guess numeric passcodes until one works, according to a court filing. But they say they require special access from Apple to attempt that on the phone without erasing data or getting bogged down in a long process.\r\n\r\nInvestigators recovered the phone after executing a search warrant on one of the couple’s vehicles. Farook and Malik died in a firefight with police hours after the attack.\r\n\r\nNEWSLETTER: Get essential California headlines delivered daily &gt;&gt; \r\n\r\nIn September 2014, Apple modified its encryption system in a move that made it more difficult for law enforcement to access data on its cellphones. Previously, forensic investigators could tap into a device's hardware port and gain access to a phone's data &quot;independent of needing to try passcodes,&quot; according to Clifford Neuman, director of USC's Center for Computer System Security.\r\n\r\n&quot;That path into the device is no longer possible,&quot; he said","torrent":{"xt":"urn:btih:0c0b9e6ca5b36b33c88fa0d9580f30d35d2cec97","amp;dn":"Kade","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c0b9e6ca5b36b33c88fa0d9580f30d35d2cec97","infoHashBuffer":{"type":"Buffer","data":[12,11,158,108,165,179,107,51,200,143,160,217,88,15,48,211,93,44,236,151]},"announce":[],"urlList":[]}}