{"title":"[FantasyMassage] - TrickySpa - Alexis Adams - (Leggy Stepdaughte","uid":13603984,"size":787144510,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:11040001b1244bf9f8551ad1319434b74ad460d4&amp;dn=%5BFantasyMassage%5D+-+TrickySpa+-+Alexis+Adams+-+%28Leggy+Stepdaughte&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ImgSnaps","files":1,"time":1455880265,"description":"[FantasyMassage] - TrickySpa - Alexis Adams - (Leggy Stepdaughter) [NEW February 18, 2016]\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/image/kI3\r\n \nhttp://imgsnaps.com/image/kI6\r\n \nhttp://imgsnaps.com/image/kIB\r\n\r\nItâ™s time for Alexis Adams to wake up and begin her physical therapy with her stepdad, Tommy Gunn. Tommy pulls the covers off of his stepdaughter, and to his surprise, reveals a fully naked body. Alexis is completely wigged out to be bare naked in front of her stepdad, but Tommy is the one who helped her out with physical therapy after her car accident, and is adamant she prepares for her next lesson… Alexis lays on her back, and Tommy begins her massage with some stretching techniques to work out her legs and glutes, Tommy applies just enough pressure around her ass with his hands to warrant some suspicious looks. Another important technique has him pushing her two legs all the way towards her face, to see how far she can go, yet sheâ™s unaware that her stepfatherâ™s face is so close to her sweet teen pussy. Tommy decides Alexis deserves a little massage, rubbing her thighs and lower back, and informs his poor daughter that he has to remove her yoga pants in order to get all her knots out. Alexis is reluctant at first, but Tommy maneuvers his way towards her soft and shaved pussy, changing her mind entirely, when she feels his breath on her beckoning crotch hungry to taste Tommyâ™s erect cock. Alexis asks her father permission to suck on his hard cock impatiently, stunned by how big it is. Alexis, hungry for daddyâ™s dong deep throats him, making it nice and wet. But Tommy cannot wait any longer for a taste of his daughterâ™s shaved pussy, and leaves a trail of juices over her thighs, slippery enough for his cock to enter her tight pussy hole","torrent":{"xt":"urn:btih:11040001b1244bf9f8551ad1319434b74ad460d4","amp;dn":"%5BFantasyMassage%5D+-+TrickySpa+-+Alexis+Adams+-+%28Leggy+Stepdaughte","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11040001b1244bf9f8551ad1319434b74ad460d4","infoHashBuffer":{"type":"Buffer","data":[17,4,0,1,177,36,75,249,248,85,26,209,49,148,52,183,74,212,96,212]},"announce":[],"urlList":[]}}