{"title":"Hidden Secrets - Part 120 - D E M O N  M A G I C - The Dark Arts","uid":13829831,"size":8120065768,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:13e15264b02b6bb2e29b21f92eb24467d4730bed&amp;dn=Hidden+Secrets+-+Part+120+-+D+E+M+O+N++M+A+G+I+C+-+The+Dark+Arts&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":52,"time":1457734267,"description":"Hidden Secrets - Part 120 - D E M O N . M A G I C - The Dark Arts\r\n\r\nWith everything we’re hearing lately about zombies and mind control, you had better believe demons are at the center of it all! Satan and his minions are ever on the loose today, as God has given them more power for this final hour in history.\r\n\r\nThe thing is, Satan loves to boast and show off what he can do. In so doing, he overplays his cards and shows people exactly who and what is at the core of the game.\r\n\r\nHere, you can literally see the devils in some of their eyes! It’s insane! Watch and see for yourself! Magicians are in the Bible as well, and they were known for using Satanic powers, so this should not be that big of surprise for those who follow Yashua.\r\n\r\nSatan will sink his claws in deeply to whomever allows him in. Are you allowing him in your temple? What are your open doors? Addiction? Lust? Hatred? Deception? Adultery? If things are not going right in your life, look around. You might have let the enemy inside of your house.. \r\n\r\nAgain we will see a relationship to serpents and the ability of these sorcerers (because that is what they really are) to charm serpents and turn inanimate objects into a serpent. We are now seeing a new age of street musicians who will be the next Las Vegas acts of tomorrow. I am sure Chris Angel and David Blaine will soon sacrifice a baby so they too can command the spirits. I can’t help but to notice the weak stature and nature of these magicians. By this I mean they do not look like they would last 15 seconds in a bar fight but with the dark arts they could probably turn your testicles into oysters — unless you are protected by the blood of Christ!","torrent":{"xt":"urn:btih:13e15264b02b6bb2e29b21f92eb24467d4730bed","amp;dn":"Hidden+Secrets+-+Part+120+-+D+E+M+O+N++M+A+G+I+C+-+The+Dark+Arts","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13e15264b02b6bb2e29b21f92eb24467d4730bed","infoHashBuffer":{"type":"Buffer","data":[19,225,82,100,176,43,107,178,226,155,33,249,46,178,68,103,212,115,11,237]},"announce":[],"urlList":[]}}