{"title":"Hidden Secrets - Part 112 - Spiritual Warfare - Witches - Demons","uid":13699310,"size":6918101044,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:16579f12069a999fd55c07a270bc5b4918e2a3a6&amp;dn=Hidden+Secrets+-+Part+112+-+Spiritual+Warfare+-+Witches+-+Demons&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":58,"time":1456755130,"description":"Hidden Secrets - Part 112 - Spiritual Warfare - Witches and Demons\r\n\r\n\r\nDescription\r\nNational Geographic's Salem Witch Trial Conspiracy:\r\nIn Salem Witch Trial Conspiracy, join author Katherine Howe as she embarks on a historical journey to bring you the truth behind the world's most famous witch-hunt.\r\n\r\nOf the over one hundred people charged with witchcraft, five died in jail, 19 died on the gallows and one was crushed to death. Each of these deaths was the result of an overwhelming religious hysteria, and even to this date historians are uncovering more about what really occurred.\r\n\r\nOne of the first victims was a British born ancestor of Katherine, who revisits the site of the trials to examine fascinating new research and delve into Salem's horrific past. By studying the sermons of the village's Puritan minister Samuel Parris, historians have deduced that a chilling plot could have been the cause of the frenzy that followed.\r\n\r\nParris was at the very heart of Salem's terror, and it was the supposed possession of his own niece and daughter that led to the first arrest. From studying his hand-written notes, which have been preserved to this day, it seems he believed his ministry was under attack. But was his true enemy the devil, or his own employers? Find out in the Salem Witch Trial Conspiracy.\r\n\r\n\r\nThe Ancient world of Demons Reptilians Gods and the Djinn:\r\nThe Ancient world of Demons, Reptilians, Gods and the Djinn includes Reptilians, Demons and the Djinn in ancient mythology Full Documentary reptilian demon ghost 2011 Documentaries ars goetia mayan eygptian sumerian greek indian gods and demon list WOLVOMAN80 king solomon gargoyle sinbad chinese dragon all seeing eye of horus ancient aliens and ufo ufos jesus saves sinners the holy bible adam and eve lilith snake people angels and demons 300 spatans jinn aztec gods evil demons sprits real witch witches illuminati alien mark beast conspiracy angels world armageddon secret ufo new demons mind control prophecy fallen goddess pagan ancient mythology genie aladdin wizards black magic magick slidehow and commentary sources include holy bible the quran sumerian writings and many more illuminati gods new world order demonic scene from movie scary music 2011.\r\n\r\n\r\nEvidences for a Spiritual View of UFOs Why Christians Think Aliens Are Really Demons Guy Malone:\r\nGuy Malone - &quot;Evidences for a Spiritual View of the UFO Phenomenon&quot; aka &quot;Why Christian Fundamentalists Think Aliens Are Really Demons&quot; Malone asks, &quot;Do certain Christians say 'aliens are really demons' based simply on an uninformed knee-jerk reaction to the unknown?&quot; No. In fact many theologians have historically argued that God could have easily created life on other planets, if He so chose. But what does an examination of 20th century sighting and abduction reports reveal? This lecture provides an overview of the messages, actions and abilities demonstrated by modern &quot;aliens&quot; with insight into the scriptural and theological arguments that logically support the fallen angel interpretation of the phenomena. While you may not be convinced of this view yourself, you will walk away better understanding WHY many with a Biblical worldview conclude that &quot;alien&quot; activity is a fallen angel deception, and ultimately consider the reasoning behind the &quot;demonic hypothesis&quot; much more convincing than you thought possible. Also, Malone ends the presentation with a revealing look at &quot;What The Bible Says About Life on Other Planets.&quot;\r\n\r\n\r\nDefeating Demons Devils and Evil Spirits:\r\nInformative sermon done by pastor Doug Batchelor of Amazing Facts. Speaking from the word of God. I don't own the copyrights to this video and it was uploaded strictly for educational purposes. Enjoy &amp; God bless!\r\n\r\n\r\nJohn Todd Q &amp; A Session - Testimony on the Occult Practices:\r\nJohn Wayne Todd (c. 1950 -- November 10, 2007), also known as &quot;John Todd Collins&quot;, &quot;Lance Collins&quot;, and &quot;Christopher Kollyns&quot;, was a speaker, occultist, and conspiracy theorist who claimed to have been born into a 'witchcraft family' before converting to Christianity (in 1972, by some accounts). He was a primary source for many Chick Publications works against Dungeons &amp; Dragons, Catholicism, Neopaganism, and Christian rock. Although most of his activity was during the 1970s, his claims continue to be spread in some fundamentalist Christian circles","torrent":{"xt":"urn:btih:16579f12069a999fd55c07a270bc5b4918e2a3a6","amp;dn":"Hidden+Secrets+-+Part+112+-+Spiritual+Warfare+-+Witches+-+Demons","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16579f12069a999fd55c07a270bc5b4918e2a3a6","infoHashBuffer":{"type":"Buffer","data":[22,87,159,18,6,154,153,159,213,92,7,162,112,188,91,73,24,226,163,166]},"announce":[],"urlList":[]}}