{"title":"Sexually Broken--Tiny blonde Odette Delacroix bound inside a box","uid":13913150,"size":1020107219,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:16eacf7599a4a8caf4d15802eb75ad6d95fb05b0&amp;dn=Sexually+Broken--Tiny+blonde+Odette+Delacroix+bound+inside+a+box&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":1,"time":1458322069,"description":"Tiny blonde Odette Delacroix bound inside a box and roughly fucked from both ends by cock! | Odette Delacroix | Matt Williams | Jack Hammer \r\n\r\nMarch 18, 2016\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nTiny fucktoy suspended in a box and taken from both side by big dick \r\n\r\nNow here is something you do not see every day. Odette Delacroix clocks in at only 5 feet high and weighs less than 85 pounds. This tiny little thing looks like a strong wind would blow her away. But potent things can come in small packages. Odette is honestly one of the best deepthroaters that we have ever met. She just hangs out on the dick balls deep, not even blinking. We just happen to have a wooden box that only tiny things fit in. Odette fits.\r\n\r\nOnce our tiny pixie is bound in the box, we string it up from the ceiling. Both ends of her holes are deliciously exposed. On one side that talented mouth is ripe for the plucking. On the other end her small pale butt peeks out. It is tag team time. We step up and stuff out those holes as Odette moans in her restraints. She isn’t going anywhere. All she can do is take the dick we dish out.\r\n\r\nThe box spins in its chains, rotating back and forth and giving us free access to whichever hole we so desire. 10 full inches of big black cock take every inch of the 5 foot high Odette. it is like a magic trick to see it all disappear. We are certainly impressed. This is box bondage and throat training at its best. Those holes know what they were designed to do.\r\n\r\nOur tiny blonde fuck toy is trained out to our satisfaction, spinning like a top the whole time. We leave her suspended and gently swaying from the ceiling. She will wait until we feel like coming back for another round on those tight little holes. \r\n \r\nScreens \nhttp://www.sexuallybroken.com/sexual/bondage/trailer.php?y=2016&amp;p=03_18odelacroix8&amp;u=SexuallyBroken-Odette-Delacroix-Matt-Williams-Jack-Hammer-Tiny-blonde-Odette-Delacroix-bound-inside-a-box-and-roughly-fucked-from-both-ends-by-cock\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n20 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:16eacf7599a4a8caf4d15802eb75ad6d95fb05b0","amp;dn":"Sexually+Broken--Tiny+blonde+Odette+Delacroix+bound+inside+a+box","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16eacf7599a4a8caf4d15802eb75ad6d95fb05b0","infoHashBuffer":{"type":"Buffer","data":[22,234,207,117,153,164,168,202,244,209,88,2,235,117,173,109,149,251,5,176]},"announce":[],"urlList":[]}}