{"title":"The Voodoo hoodoo magic spell ebook","uid":13871885,"size":4422283,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c6c982b4b3b283e7ff803bd5959eabdbdd2cba8&amp;dn=The+Voodoo+hoodoo+magic+spell+ebook&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":null,"files":1,"time":1458106395,"description":"The Voodoo Hoodoo Spellbook\r\n\r\nby Denise Alvarado\r\n\r\n&quot;Voodoo Hoodoo&quot; is the unique variety of Creole Voodoo found in New Orleans. The Voodoo Hoodoo Spellbook is a rich compendium of more than 300 authentic Voodoo and Hoodoo recipes, rituals, and spells for love, justice, gambling luck, prosperity, health, and success.\r\n\r\nCultural psychologist and root worker Denise Alvarado, who grew up in New Orleans, draws from a lifetime of recipes and spells learned from family, friends, and local practitioners. She traces the history of the African-based folk magic brought by slaves to New Orleans, and shows how it evolved over time to include influences from Native American spirituality, Catholicism, and Pentecostalism. She shares her research into folklore collections and 19th- and 20th- century formularies along with her own magical arts.\r\n\r\nThe Voodoo Hoodoo Spellbook includes more than 100 spells for Banishing, Binding, Fertility, Luck, Protection, Money, and more. Alvarado introduces readers to the Pantheon of Voodoo Spirits, the Seven African Powers, and other important Loas, Prayers, Novenas, and Psalms, and much, much more, including:\r\n* Oils and Potions: Attraction Love Oil, Dream Potion, Gambler's Luck Oil, Blessing Oil\r\n* Hoodoo Powders and Gris Gris: Algier's Fast Luck Powder, Controlling Powder, Money Drawing Powder\r\n* Talismans and Candle Magic\r\n* Curses and Hexes","torrent":{"xt":"urn:btih:1c6c982b4b3b283e7ff803bd5959eabdbdd2cba8","amp;dn":"The+Voodoo+hoodoo+magic+spell+ebook","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c6c982b4b3b283e7ff803bd5959eabdbdd2cba8","infoHashBuffer":{"type":"Buffer","data":[28,108,152,43,75,59,40,62,127,248,3,189,89,89,234,189,189,210,203,168]},"announce":[],"urlList":[]}}