{"title":"Abelssoft GoogleClean 2016.130 Retail","uid":13731795,"size":10466020,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1f8702c3a5bcdd602502ca7c01eceabbc7677818&amp;dn=Abelssoft+GoogleClean+2016.130+Retail&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rubberboy37","files":1,"time":1457018100,"description":"Abelssoft GoogleClean 2016.130 Retail\r\n\r\nTake control about what Google knows about you!!! Today Google &quot;sees&quot; everything. Most Google products like Google Desktop, Google Chrome, Google Chrome Canary, Google Picasa, Google Earth, Google Toolbar, Google+ and YouTube collect data about the usage, generate a unique ID and transfer them back to Google. GoogleClean can prevent this and switches off those data transfers. It allows you to use all Google products without any headaches and without having to worry about the consequences. GoogleClean does not influence the functionality of Google products. It takes away the bad things and leaves you the good things.\r\n\r\n\r\nGoogleClean 2016.130:\r\n\r\nPrevents Espionage\r\nTurns off the espionage features of various Google applications\r\n\r\nDelete Traces\r\nDeletes traces of Google applications on your computer\r\n\r\nAutomatic Trace Watcher\r\nAutomatic check for Google application traces and automatic cleanup\r\n\r\n\r\nFeatures:\r\n\r\nSwitch off Google functionality\r\nMany Google applications collect information about their users and send data back home. Google knows wich websites you visit and wahat contents you are lookingh for in the internet. It is almost impossible to deactivate some of these spy features manually. With GoogleClean you can switch off those data transfers easily.\r\n\r\nRemove unwanted content from Google Search\r\nDid you ever searched for yourself on Google and found results that you did not like, that harm your privacy or put you in a bad light? you can change that now! With the new GoogleClean Tool.\r\n\r\nDelete Google-Traces\r\nFind and delete Flash Cookies (also known as Super-Cookies), from data, surfing traces and data garbage of Google applications.\r\n\r\nProtect your computer automatically\r\nNo need to delete surfing traces manually, the Google Radar is a small application that wil permanently look out for Google traces and data garbage on your computer. The Google Radar starts up with Windows and will keep your system clean automatically.\r\n\r\nWindows Index.dat files\r\nThe Windows Index.dat files contain data about every website you visited. Because these files are write protected they can only be deleted on the Windows startup.\r\n\r\n\r\nRelease date: 2015-10-27\r\nOS: Windows XP/Vista/7/8/8.1/10\r\nLanguage: English/German/Portuguese (Brasil)\r\n\r\n\r\n\r\nThis torrent contains:\r\n\r\n- Abelssoft GoogleClean 2016.130 Retail\r\n- Google Analytics Opt-Out Browser Add-On\r\n- Advertising Cookie Optout Setup","torrent":{"xt":"urn:btih:1f8702c3a5bcdd602502ca7c01eceabbc7677818","amp;dn":"Abelssoft+GoogleClean+2016.130+Retail","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f8702c3a5bcdd602502ca7c01eceabbc7677818","infoHashBuffer":{"type":"Buffer","data":[31,135,2,195,165,188,221,96,37,2,202,124,1,236,234,187,199,103,120,24]},"announce":[],"urlList":[]}}