{"title":"Star Trek - The Next Generation - Season 2","uid":13848806,"size":9464913629,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:219d91545456fcb324107bb7cbbfe3aa4288d5eb&amp;dn=Star+Trek+-+The+Next+Generation+-+Season+2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":41,"time":1457906099,"description":"Star Trek - The Next Generation - Season 2\r\n\r\n\r\nStar Trek: The Next Generation (season 2)\r\n\r\nThe series underwent significant changes during its second season. Beverly Crusher was replaced as Chief Medical Officer by Katherine Pulaski, played by Diana Muldaur, who had been a guest star in &quot;Return to Tomorrow&quot; and &quot;Is There in Truth No Beauty?&quot;, two episodes from the original Star Trek. The ship's recreational area, Ten-Forward, and its mysterious bartender/advisor, Guinan, played by Whoopi Goldberg, appeared for the first time. Another change was in the opening theme, wherein at the end is a short fanfare. Owing to the 1988 Writers Guild of America strike, the number of episodes produced was cut from 26 to 22, and the start of the season was delayed. Because of the strike, the opening episode, &quot;The Child&quot;, was based on a script originally written for Star Trek: Phase II, while the season finale, &quot;Shades of Gray&quot;, was a clip show.\r\n\r\nNevertheless, season two as a whole was widely regarded as significantly better than season one.[27] Benefiting from Paramount's commitment to a multiyear run and free from network interference due to syndication, Roddenberry found writers who could work within his guidelines and create drama from the cast's interaction with the rest of the universe.[5] The plots became more sophisticated and began to mix drama with comic relief. Its focus on character development received special praise.[27] Co-executive producer Maurice Hurley has stated that his primary goal for the season was to plan and execute season-long story arcs and character arcs.[28] Hurley wrote the acclaimed episode &quot;Q Who&quot;, which featured the first on-screen appearance of TNG's most popular villain, the Borg. Season two focused on developing the character Data, and two highly regarded episodes from the season, &quot;Elementary, Dear Data&quot; and &quot;The Measure of a Man&quot;, featured him prominently.[29] Miles O'Brien also became a more prominent character during the second season, while Geordi La Forge took the position of Chief Engineer. Klingon issues continued to be explored in well-regarded episodes such as &quot;A Matter of Honor&quot; and &quot;The Emissary&quot;, which introduced Worf's former lover K'Ehleyr.[30] Five second-season episodes were nominated for six Emmys, and &quot;Q Who&quot; won for Outstanding Sound Editing for a Series and Outstanding Sound Mixing for a Drama Series.[1]\r\n\r\nThe Child \t                2x01 \t\r\nWhere Silence Has Lease \t2x02 \t\r\nElementary, Dear Data \t        2x03 \t\r\nThe Outrageous Okona \t        2x04 \t\r\nLoud As A Whisper \t        2x05 \t\r\nThe Schizoid Man \t        2x06 \t\r\nUnnatural Selection \t        2x07 \t\r\nA Matter Of Honor \t        2x08 \t\r\nThe Measure Of A Man \t        2x09 \t\r\nThe Dauphin \t                2x10 \t\r\nContagion \t                2x11 \t\r\nThe Royale \t                2x12 \t\r\nTime Squared \t                2x13 \t\r\nThe Icarus Factor \t        2x14 \t\r\nPen Pals \t                2x15 \t\r\nQ Who \t                        2x16 \t\r\nSamaritan Snare \t        2x17\r\nUp The Long Ladder \t        2x18\r\nManhunt \t                2x19 \t\r\nThe Emissary \t                2x20 \t\r\nPeak Performance \t        2x21 \t\r\nShades of Gray \t                2x22","torrent":{"xt":"urn:btih:219d91545456fcb324107bb7cbbfe3aa4288d5eb","amp;dn":"Star+Trek+-+The+Next+Generation+-+Season+2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"219d91545456fcb324107bb7cbbfe3aa4288d5eb","infoHashBuffer":{"type":"Buffer","data":[33,157,145,84,84,86,252,179,36,16,123,183,203,191,227,170,66,136,213,235]},"announce":[],"urlList":[]}}