{"title":"FTVGirls - Aveline - Supercute First Timer HD 1080p","uid":13959800,"size":4502090345,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:21c7848e3dccb6fb9647811d5f3ca872631d999a&amp;dn=FTVGirls+-+Aveline+-+Supercute+First+Timer+HD+1080p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"ElitePorn","files":1,"time":1458578096,"description":"FTVGirls - Aveline - Supercute First Timer HD 1080p\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n\r\nThis fresh-faced teenager visits us from Oaklahoma, and its her total first time doing an adult shoot. She's the kind of girl next door that you'd never think would end up in porn, but we're lucky enough to see her first experience here, on FTV. We first meet her at an airport train station, and notice how cute she is -- and how shy she is in front of the camera. But in no time, her perfect full round breasts are out, and she's flashing them in this very risky place! Then she pulls her shorts aside, and we see a pierced clitoris... She continues to flash on the train, even with the security cameras everywhere, then goes home to masturbate with her fingers. She's very juicy wet... Later that evening, she continues to flash her private parts, and even does it at a restaurant with the cops right behind her! Next morning, we see her with her hair braided, visiting a park and golfing area. She's wearing an FTVGirls t-shirt, and skirt, giving us upskirt peaks and flashing on the street, even fingering herself there! She's not that shy any more... Back home, she masturbates with the Eroscillator toy, to a nice, strong orgasm with visible vaginal contractions. She's never used a vibrator before until now! We then get some foot fetish play, and extreme closeups of her very pretty private parts. She learns how to gape wide, so we can see deep... Then she gives her breasts a nice hard massage, and plays with her nipple piercings. Its almost halloween, and she visits a pumpkin patch, wearing a cute white dress and wedges. She flashes us and teases us in this risky public place, then buys a pumpkin and models with it. We then see her visit a resort, where she continues to finger tease and finger herself... and that dress is very see-through! Back home, she uses her fingers to a nice, natural orgasm, with more visible vaginal contractions. Later in the day, she puts on a sexy red dress and heels, and visits a local resort. It gets kinky when she takes a yellow summer squash, and stuffs it deep inside her, then walks around with it! Her strong vaginal muscles allow her to push it out with ease... and the milky juices that come out she tastes and rubs on her nipples. Then she masturbates some more, to another orgasm, before she goes playing with more toys. This time its with the Big Glass Ball toy, and we get to see her get stretched out as she pulls it out of her. Notice how wet she gets the whole time. Then she's down for a ride on a large dildo, riding it on the table going all the way to the base! She ends up penetrating herself on the couch until she is too sore to continue. What a cute girl, and what a weekend of adventure for this first time beauty -- and one of those teens so perfect for FTV :)\r\n\r\nScreenshots:\r\n~~~~~~~~~~~~ \nhttp://picturescream.asia/soft/1Nt\r\n \nhttp://picturescream.asia/soft/1N2\r\n \nhttp://picturescream.asia/soft/1NJ\r\n \nhttp://picturescream.asia/soft/1NK\r\n \nhttp://picturescream.asia/soft/1NW\r\n \nhttp://picturescream.asia/soft/1Nf\r\n\r\n\r\nVideos Info:\r\n~~~~~~~~~~~~\r\nSize: 4.19 GB\r\nDuration: 48:45 min \t\r\nResolution: 1920x1080\r\n\r\n\r\nShow Your Appreciation - BitCoin: 1JxUQqRrvGC6txChvaZEbqSSsq9wtswoto","torrent":{"xt":"urn:btih:21c7848e3dccb6fb9647811d5f3ca872631d999a","amp;dn":"FTVGirls+-+Aveline+-+Supercute+First+Timer+HD+1080p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21c7848e3dccb6fb9647811d5f3ca872631d999a","infoHashBuffer":{"type":"Buffer","data":[33,199,132,142,61,204,182,251,150,71,129,29,95,60,168,114,99,29,153,154]},"announce":[],"urlList":[]}}