{"title":"Cut Up - Forensic Nightmares (2015)","uid":13797753,"size":60978567,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:25d0e1306f35bc83faf97a7306d981513798d7d1&amp;dn=Cut+Up+-+Forensic+Nightmares+%282015%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"FornaTider","files":11,"time":1457430724,"description":"CUT UP was founded by drummer Tobias Gustafsson and vocalist/bassist Erik Rundqvist in early 2014. After disbanding Vomitory by the end of 2013 after 24 years of death metal duty, the two felt it obvious to continue creating death metal together. Very soon, guitarist Anders Bertilsson and guitarist/vocalist Andreas Björnson were recruited and CUT UP was complete. Both Bertilsson – who was previously and most notably in Coldworker (2006-2013) – and Björnson – also known from Fetus Stench – share the same musical ideals as Gustafsson and Rundqvist as well as the passion to play live.\r\n\r\nThe following months were filled with hard work, writing and rehearsing, and in November 2014 they entered Big Balls Studios in Karlstad/Sweden and recorded 11 songs for the debut album, entitled &quot;Forensic Nightmares&quot;. The album was mixed and mastered by Ronnie Björnström at Garageland Studios Umeå/Sweden. The whole band was involved in the songwriting process from the get-go, which makes &quot;Forensic Nightmares&quot; a solid band effort, and it's a clear indication to which direction CUT UP is heading. With the band members' collective resume and reputation in the metal scene, fans can expect nothing but violent, catchy, groovy and grinding death metal. Soon after the recording of the album was finished, CUT UP signed a worldwide multi-album deal with Metal Blade Records","torrent":{"xt":"urn:btih:25d0e1306f35bc83faf97a7306d981513798d7d1","amp;dn":"Cut+Up+-+Forensic+Nightmares+%282015%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25d0e1306f35bc83faf97a7306d981513798d7d1","infoHashBuffer":{"type":"Buffer","data":[37,208,225,48,111,53,188,131,250,249,122,115,6,217,129,81,55,152,215,209]},"announce":[],"urlList":[]}}