{"title":"Sandboxie 5.10 + Patch","uid":13714808,"size":11147557,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2a694ffeb3489aa8ed432e7444c32c59515d2910&amp;dn=Sandboxie+5.10+%2B+Patch&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rubberboy37","files":1,"time":1456897422,"description":"Browsing the web, downloading and running applications that may pose security issues require lots of experience and a powerful protection layer to prevent Malware from spreading onto a computer. There are, nonetheless, some alternatives that can be exploited even by less experienced users, like running such potentiaslly dangerous programs in a virtual environment.\r\n\r\n\r\n\r\nRun application in a controlled environment\r\n\r\nThis means that when running a software Sandboxed, no modifications will me made to your system and all the changes occur virtually, in that quarantined folder. Thus, Sandboxie can help you browse web pages with unsafe content, test Virus behavior and a lot more.\r\n\r\n\r\n\r\nSuiotable for testing purposes\r\n\r\nThis means that when running a software Sandboxed, no modifications will me made to your system and all the chasnges occur virtually, in that quarantined folder. Thus, Sandboxie can help you browse web pages with unsafe content, test Virus behavior and a lot more.\r\n\r\n\r\n\r\nPrevents any changes from affecting your system\r\n\r\nInside the &quot;Sandboxie Control&quot; area you will be ableto view and manage the programs, start the (any) web browser(s), E-mail reader or any other application. Also , you have the possibility to run a utility ftom the &quot;Windows Start Menu&quot; and open the &quot;Windows Explorer&quot;, but remember that while it is inside the Sandbox, no changes will occur to the real files and folders.\r\n\r\n\r\n\r\nA neat feature of Sandboxie is it's ability to integrade seamlessly with the operating system (OS) and it will become available from the right-click (contect) menu, as well as from the &quot;Send to&quot; desktop menu.\r\n\r\n\r\n\r\nVersion 5.10 \r\n\r\nReleased on 1 March 2016. \r\n\r\n\r\n- Sandboxie binaries are now dual-signed (SHA1 &amp; SHA256) to eliminate IE 11 and Windows 10 certificate warnings. \r\n- Fixed Win 10 FR Build 14267 (SBIE1113 Cannot find Nt system service, reason - MASTER TABLE) \r\n- Fixed Win 10 FR Build 14271 (SBIE1113 Cannot find Nt system service, reason MASTER TABLE)","torrent":{"xt":"urn:btih:2a694ffeb3489aa8ed432e7444c32c59515d2910","amp;dn":"Sandboxie+5.10+%2B+Patch","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a694ffeb3489aa8ed432e7444c32c59515d2910","infoHashBuffer":{"type":"Buffer","data":[42,105,79,254,179,72,154,168,237,67,46,116,68,195,44,89,81,93,41,16]},"announce":[],"urlList":[]}}