{"title":"Land.of.Hope.and.Glory-British.Country.Life--BBC-2016-360p","uid":13938599,"size":1067713290,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2d01b06283e289c63ddc836d1f824abceb84a88a&amp;dn=Land.of.Hope.and.Glory-British.Country.Life--BBC-2016-360p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"uggauga","files":6,"time":1458447273,"description":"Land of Hope and Glory - British Country Life\r\n\r\nSeries capturing the glory and eccentricity of the men and women who live the rural life.\r\n\r\nBBC (2016) - 3 Episodes\r\n \nhttp://www.bbc.co.uk/programmes/b072w04k\r\n_______________________________________\r\n\r\n640x360 resolution\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - enjoy !!\r\n_______________________________________\r\n\r\nLand of Hope and Glory - British Country Life Episode 1 of 3\r\nFor almost 120 years, Country Life magazine has been aspiring to capture the elusive soul of the British countryside, from muddy fields to stately homes. Jane Treays spent a year filming with the magazine, exploring the lives of those who have been bred into the land, inherited it or have simply bought into its dreams.\r\nFrom a 'girl in pearls' shoot in Yorkshire to a historic mansion in Dorset, via Lindisfarne castle and a family farm in Somerset, this series captures the glory and eccentricity of the men and women who live the rural life.\r\n\r\nLand of Hope and Glory - British Country Life Episode 2 of 3\r\nFor almost 120 years, Country Life magazine has been the property bible for anyone looking to buy a grand country house. Jane Treays spent a year visiting cottages, manor houses and castles through the eyes of the magazine - and seeing how people live in them - from a crumbling historic mansion in Oxfordshire and a glorious Scottish estate basking in its £13 million refurbishment to the inherited turrets of Picton Castle in Wales, and the noisy environment of the huntsman's 18th-century kennels and cottage.\r\n\r\nLand of Hope and Glory - British Country Life Episode 3 of 3\r\nJane Treays discovers the world of Country Life magazine and the meaning of beauty to people in the countryside - from a romantic manor house in Somerset, steeped in First World War history, to fishing the silvery waters of North Uist, and stamping the grouse moors of Scotland.\r\nMeanwhile, the editorial team still have time to look for the Gentleman of the Year as well as Britain's Naughtiest Dog, which was eventually tracked down in a Wiltshire valley","torrent":{"xt":"urn:btih:2d01b06283e289c63ddc836d1f824abceb84a88a","amp;dn":"Land.of.Hope.and.Glory-British.Country.Life--BBC-2016-360p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d01b06283e289c63ddc836d1f824abceb84a88a","infoHashBuffer":{"type":"Buffer","data":[45,1,176,98,131,226,137,198,61,220,131,109,31,130,74,188,235,132,168,138]},"announce":[],"urlList":[]}}