{"title":"[Evil Angel] Ts playground 6 (2013) [540p]","uid":13831212,"size":2967063320,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:336542b5ca0d6821e4c424adf8140daceadcf31c&amp;dn=%5BEvil+Angel%5D+Ts+playground+6+%282013%29+%5B540p%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"distinc","files":5,"time":1457738394,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=4277132391\r\n \nhttp://imagedisco.net/?g=8332502488\r\n\r\n\r\n\r\nDescription:\r\n\r\nKinky porn pioneer Jay Sin has won ass-obsessed hearts through an amazing career of documenting extreme rectal perversity with the most anally acrobatic ladies in the game. His explosive she-male series has proved just as creative and intense, maintaining the high standards of asshole fetishism Jay is known for. His 'TS Playground 6' is front-loaded with stunning she-creatures performing nasty deeds with boys, girls and, occasionally, one another. Super-cute cover girl Sienna Grace steals the show with her incredibly feminine appearance and fat cock; she loves to suck and get fucked by muscular Christian, who reams her sweet ass until Sienna spills her own she-seed in climax. Latina ladyboys Jhenifer Dalbosco and Sabrina Suzuki take turns invading Alex Victor's tight bunghole with their rude, throbbing girl-pricks, and they shower him with cum. Sexy Brenda Lohan and Tamara Camargo team up on Max Scar for an amazing three-way backdoor fuckfest including a wild anal daisy chain with Max in the middle! Adorable transgender princess Beatricy Velmont enjoys cock docking with a huge, uncut Latin cock before she takes it balls-deep in her tender anus. Finally, athletic blonde female slut Sheena Shaw and her buxom, statuesque trans pal Eva Lin find that fucking a guy's big dick makes their pink assholes gape. Jay brings a light, festive touch to outrageous sexual situations, but for hard-core fans serious about wild anal fun with exquisite she-males, 'TS Playground 6' doesn't play around!","torrent":{"xt":"urn:btih:336542b5ca0d6821e4c424adf8140daceadcf31c","amp;dn":"%5BEvil+Angel%5D+Ts+playground+6+%282013%29+%5B540p%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"336542b5ca0d6821e4c424adf8140daceadcf31c","infoHashBuffer":{"type":"Buffer","data":[51,101,66,181,202,13,104,33,228,196,36,173,248,20,13,172,234,220,243,28]},"announce":[],"urlList":[]}}