{"title":"Straight.Outta.Brazzers","uid":13624283,"size":2414251384,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:337d3c229abc4518e7644ee7c2a06db80ab70c70&amp;dn=Straight.Outta.Brazzers&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ImgSnaps","files":4,"time":1455997976,"description":"Straight.Outta.Brazzers\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/image/kWa\r\n \nhttp://imgsnaps.com/image/kWd\r\n\r\n \nhttp://imgsnaps.com/image/kW4\r\n\r\nDescription:\r\n\r\nOrange Is The New Pussy\r\n\r\nAfter getting strip searched by a horny guard who spread her cheeks before putting on the orange uniform, Natalia was at the mercy of her fellow inmates at the women's prison. They treat her as their person fuck-doll, in a wet-and-wild GGG threesome in the shower for more girl-on-girl pussy-eating action.\r\n\r\nMasters Of Fuck\r\n\r\nDr. Johnny Sins was a leader in the field of sexual studies and his work documenting female sexuality. He started by getting his subject, a busty babe named Ryder Skye warmed up using his patented electric dildo on her tight pussy. Then he rubbed her down with oil until she was practically begging for his cock!\r\n\r\nMasters Of Fuck 2\r\n\r\nDr. Mia Malkova has heard all about Dr. Johnny Sins sex research and she doesn't approve one bit. And that leaves Johnny with only one option to save his life's work; call in sex expert Bonnie Rotten to help! It starts off with a spanking and then Bonnie and Mia eat each other's pussies until Mia is horny and dripping wet.\r\n\r\nThe Doctor Part Four - Escape From Valhalla\r\n\r\nThe doctor flipped a switch and traveled through time to find future Madison being chased through the hallways of a strange pocket dimension that makes your desires come true. Everything got twisted and the only way Danny could save them both was to give Madison tremendous amounts of pleasure.\r\n\r\nDownton Grabby\r\n\r\nHorny maid Loulou catches that busty MILF Rebecca Moore getting her big tits sucked on by the butler Danny D. Loulou gets caught being a voyeur and Ms. Moore calls her in to get in on the action. Danny has the best day in his butling career as he gets to have a threesome with both those busty blonde beauties","torrent":{"xt":"urn:btih:337d3c229abc4518e7644ee7c2a06db80ab70c70","amp;dn":"Straight.Outta.Brazzers","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"337d3c229abc4518e7644ee7c2a06db80ab70c70","infoHashBuffer":{"type":"Buffer","data":[51,125,60,34,154,188,69,24,231,100,78,231,194,160,109,184,10,183,12,112]},"announce":[],"urlList":[]}}