{"title":"Star Trek - The Next Generation - Season 3","uid":13849722,"size":9654840060,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:360a0a375157b9a56e3674e8a3c3d12ad30818be&amp;dn=Star+Trek+-+The+Next+Generation+-+Season+3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":32,"time":1457982604,"description":"Star Trek - The Next Generation - Season 3\r\n\r\nis marked by a string of abductions, with six people being kidnapped, and Captain Picard being abducted no less than three times. Captain Picard is abducted by aliens, takes a vacation which eventually gets him caught up in the search for a weapon from the future, mind melds with the legendary Vulcan Sarek, and is mistaken for a god by a primitive culture. He was again kidnapped with Doctor Crusher by Ansata terrorists. Data was abducted by Kivas Fajo, a collector of rare objects. He also continued to learn about Humanity, and constructed his own daughter, Lal. Worf adopts as his brother a young boy whose mother was killed under his command, and later meets with his real brother as his family is discommended because of the lies of Duras, a storyline which would continue into the next season. Commander Riker, Counselor Troi, and her mother Lwaxana Troi are all abducted by the Ferengi.\r\n\r\nThe USS Enterprise-D encounters the USS Enterprise-C which emerges from a time vortex, causing significant alterations to history. This is eventually resolved and removed from everyone's memories, though it had the side effect of creating a duplicate Lieutenant Natasha Yar in the past, who went on to become the mother of Sela before being killed by Romulans.\r\n\r\nAdditionally, Reginald Barclay comes on board the USS Enterprise-D and slowly begins to learn how to become a better officer, and Wesley Crusher is promoted to the rank of full ensign by Captain Picard after successfully discovering the key to rescuing Commander Riker, Counselor Deanna Troi and her mother Lwaxana, at the expense of his own entry into Starfleet Academy.\r\n\r\nThe season ends with the Borg entering Federation space, assimilating Captain Picard, and proceeding on a course to Earth, leaving Riker with the choice of whether or not to attempt to save Captain Picard","torrent":{"xt":"urn:btih:360a0a375157b9a56e3674e8a3c3d12ad30818be","amp;dn":"Star+Trek+-+The+Next+Generation+-+Season+3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"360a0a375157b9a56e3674e8a3c3d12ad30818be","infoHashBuffer":{"type":"Buffer","data":[54,10,10,55,81,87,185,165,110,54,116,232,163,195,209,42,211,8,24,190]},"announce":[],"urlList":[]}}