{"title":"Geoffrey D. Falk - Stripping the Gurus (v2.0)","uid":13943431,"size":4169131,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:39dd6b0241611ef3b3e143b73272562e1733a1d3&amp;dn=Geoffrey+D.+Falk+-+Stripping+the+Gurus+%28v2.0%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":3,"time":1458485022,"description":"\nGeoffrey D. Falk - Stripping the Gurus: Sex, Violence, Abuse and Enlightenment (mobi, epub)\r\n\r\n\r\n&quot;Armed with wit, insight, and truly astonishing research, Geoffrey Falk utterly demolishes the notion of the enlightened guru who can lead devotees to nirvana. This entertaining and yet deadly serious book should be read by everyone pursuing or thinking of pursuing the path of guru devotion.&quot;\r\n--John Horgan, author of *Rational Mysticism*\r\n\r\n&quot;Stripping the Gurus is superb--one of the best books of its kind I have ever read. The research is meticulous, the writing engaging, and the overall thesis: devastatingly true. A stellar book.&quot;\r\n--Dr. David C. Lane, California State University\r\n\r\n&quot;This gripping and disturbing book should be read by anyone who finds themself revering a spiritual teacher.&quot;\r\n--Susan Blackmore, author of *The Meme Machine*\r\n\r\n&quot;Geoffrey Falk's delightful but disturbing unmasking of religious prophets and preachers who command a vast following is a welcome contribution to the literature on the gurus and god-men of all religions.&quot;\r\n--Dr. Narasingha P. Sil, Western Oregon University\r\n\r\n&quot;No one involved in contemporary spirituality can afford to ignore this book. It exposes the darker side of modern spiritual movements, those embarrassing—sometime vicious or criminal—reports which the leaders of these movements prefer to hide. With wit and humility, and without abandoning the verities of religion, Falk has provided a corrective critique of groups that peddle enlightenment and transcendence. A must!&quot;\r\n--Len Oakes, author of *Prophetic Charisma*\r\n\r\n\r\nRamakrishna was a homoerotic pedophile.\r\n\r\nHis chief disciple, Vivekananda, visited brothels in India.\r\n\r\nKrishnamurti carried on an affair for over twenty years with the wife of a good friend. Chögyam Trungpa drank himself into an early grave. One of Adi Da's nine &quot;wives&quot; was a former Playboy centerfold. Bhagwan Rajneesh sniffed laughing gas to get high. Andrew Cohen, guru and publisher of What Is Enlightenment? magazine, by his own reported admission sometimes feels &quot;like a god.&quot;\r\n\r\nThese are typical of the &quot;wizened sages&quot; to whom otherwise-sensible people give their devotion and unquestioning obedience, surrendering their independence, willpower, and life's savings in the hope of realizing for themselves the same &quot;enlightenment&quot; as they ascribe to the &quot;perfect, God-realized&quot; master.\r\n\r\nWhy?\r\n\r\nIs it for being emotionally vulnerable and &quot;brainwashed,&quot; as the &quot;anti-cultists&quot; assert? Or for being &quot;willingly psychologically seduced,&quot; as the apologists unsympathetically counter, confident that they themselves are &quot;too smart&quot; to ever fall into the same trap? Or have devotees simply walked, with naïvely open hearts and thirsty souls, into inherent dynamics of power and obedience which have showed themselves in classic psychological studies from Milgram to Zimbardo, and to which each one of us is susceptible every day of our lives?\r\n\r\nLike the proud &quot;Rude Boy&quot; Cohen allegedly said, with a laugh, in response to the nervous breakdown of one of his devoted followers: &quot;It could happen to any one of you.&quot;\r\n\r\nDon't let it happen to you. Don't get suckered in. Be prepared. Be informed. Find out what reportedly goes on behind the scenes in even the best of our world's spiritual communities.\r\n\r\nYou can start by reading this book. \r\n\r\n\r\nGeoffrey D. Falk is author of *&quot;Norman Einstein&quot;: The Dis-Integration of Ken Wilber*, *Sam Harris and 'Spirituality Without Religion'*,&quot; and *Christianity and Islam: Two 'Religions of Peace' ... Not!* All are available for free, online.\r\n\r\nFree eBook reader, for all O/S: http://www.calibre-ebook.com","torrent":{"xt":"urn:btih:39dd6b0241611ef3b3e143b73272562e1733a1d3","amp;dn":"Geoffrey+D.+Falk+-+Stripping+the+Gurus+%28v2.0%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39dd6b0241611ef3b3e143b73272562e1733a1d3","infoHashBuffer":{"type":"Buffer","data":[57,221,107,2,65,97,30,243,179,225,67,183,50,114,86,46,23,51,161,211]},"announce":[],"urlList":[]}}