{"title":"[Bang POV] Anal POV with Adriana Chechik [ 03.19.16 ] [.mp4]","uid":13927426,"size":344691967,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:3bc71b5b298be590d2aec935bec664b55532c032&amp;dn=+%5BBang+POV%5D+Anal+POV+with+Adriana+Chechik+%5B+03.19.16+%5D+%5B.mp4%5D+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LucasCar","files":3,"time":1458392892,"description":"So one of my home girls Adriana came over the crib to chill as i was working on something in he house. I come outside and find her chilling by the pool relaxing. Adriana has a real nice look about her and is petite how i like them, so she starts telling me how its hot and i had some water guns on me just to play around with her you know how girls don’t like getting messed up in their make up and such when their all dolled up. So i starts messing with her and to my surprise she does not get upset but starts playing back. I wet her dress and she starts taking it off all playfully and shows her underwear so i wet that too and she starts getting turned on, though i think she was turned on from the start. So she starts teasing me and playing with herself we start getting into it and she starts giving me a blowjob. I tell you she can really give a blow job and a messy one too. She tells me she wants to do anal and I’m not gonna pass that chance so i put it in her ass and we just keep going with the flow. Ass to vag and ass to mouth, man i never thought she was this much of a freak. Adriana has a real tight ass i tell you it was the best it felt so good she squirted on my dick while taking it in the ass. She gives him a blowjob with deepthroat. Then he penetrates her ass in missionary, doggy style, until he cums in her mouth and she swallows the cum.\r\n \nhttp://naughtyimage.com/img-56ed4110316a1.html\r\n \nhttp://naughtyimage.com/img-56ed4116464a2.html","torrent":{"xt":"urn:btih:3bc71b5b298be590d2aec935bec664b55532c032","amp;dn":"+%5BBang+POV%5D+Anal+POV+with+Adriana+Chechik+%5B+03.19.16+%5D+%5B.mp4%5D+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bc71b5b298be590d2aec935bec664b55532c032","infoHashBuffer":{"type":"Buffer","data":[59,199,27,91,41,139,229,144,210,174,201,53,190,198,100,181,85,50,192,50]},"announce":[],"urlList":[]}}