{"title":"Stargate SG-1 - Season 05 - Episodes 1 thru 11","uid":14114256,"size":6859655121,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3ccc57bfe0f9c2509163800bfd9e6d5ecab4caaf&amp;dn=+Stargate+SG-1+-+Season+05+-+Episodes+1+thru+11&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":38,"time":1459394282,"description":"Season Five\r\nStargate SG-1 Season Five Episode Guides\r\n5.01 &quot;Enemies Part 2&quot;\r\nBarely escaping a destructive supernova, SG-1 is surprised to learn that Teal'c also survived and is now under the mind control of the maniacal Apophis. Will SG-1 be able to rescue Teal'c from the clutches of Apophis or will they perish trying?\r\n\r\nGuide | Transcript\r\n501eg.jpg\r\n5.02 &quot;Threshold&quot;\r\nTeal'c may have been rescued from the evil Apophis but his mind remains loyal to his old master. Bra'tac suggests an ancient Jaffa ritual called M'al Sharran, a process which could bring Teal'c back to his senses…or end his life!\r\n\r\nGuide | Transcript\r\n502eg.jpg\r\n5.03 &quot;Ascension&quot;\r\nWhile investigating an alien device, Carter is found unconscious. Resting from suspected exhaustion, she is visited by an invisible being who holds vital secrets to the device and the catastrophe it may cause.\r\n\r\nGuide | Transcript\r\n503eg.jpg\r\n5.04 &quot;The Fifth Man&quot;\r\nO'Neill stays behind on an alien world to tend to the wounded Lt. Tyler, the latest member of SG-1. But when the rest of the team returns to the command center, they discover that Lt. Tyler doesn't exist! Will this latest case of alien mind games close SGC down for good?\r\n\r\nGuide | Transcript\r\n504eg.jpg\r\n5.05 &quot;Red Sky&quot;\r\nSG-1 is welcomed on K'Tau by the planet's religious leader, who takes the reddening sky concurrent with their arrival as a sign from their gods. What he doesn't know is that the reddish color is a reaction caused by the wormhole, signaling the planet's impending doom!\r\n\r\nGuide | Transcript\r\n505eg.jpg\r\n5.06 &quot;Rite Of Passage&quot;\r\nOn the eve of her birthday, Cassandra is showing signs of &quot;mind fire,&quot; a powerful electromagnetic field triggered at puberty. Now SG-1 must find a cure to stop the life-threatening changes before she destroys herself…and the command center!\r\n\r\nGuide | Transcript\r\n506eg.jpg\r\n5.07 &quot;Beast Of Burden&quot;\r\nDaniel's Unas friend, Chaka, is captured by a preindustrial civilization that uses Unas as slaves. While attempting to free Chaka from this cruel regime, Daniel risks the safety of SG-1, and possibly the life of his friend.\r\n\r\nGuide | Transcript\r\n507eg.jpg\r\n5.08 &quot;The Tomb&quot;\r\nOn a rescue mission to recover Russian solders believed missing in action on a previously undisclosed trip, SG-1 gets trapped in a Goa'uld tomb with a number of decomposed bodies…and a deadly alien monster with an appetite for human flesh!\r\n\r\nGuide | Transcript\r\n508eg.jpg\r\n5.09 &quot;Between Two Fires&quot;\r\nThe SG-1 team is surprised to discover that the advanced Tollans have reversed their policy on sharing technology and are now willing to trade advanced weaponry with Earth. But the deal seems too good to be true when SG-1 learns of the Goa'uld's involvement.\r\n\r\nGuide | Transcript\r\n509eg.jpg\r\n5.10 &quot;2001&quot;\r\nSG-1 meets an advanced race who are finally willing to share their technology freely with Earth, but as negotiations continue, the team and Hammond have reason to doubt whether Aschen are all that they seem.\r\n\r\nGuide | Transcript\r\n510eg.jpg\r\n5.11 &quot;Desperate Measures&quot;\r\nCarter is abducted by a reclusive billionaire who wants to perform medical experiments on her using a deadly alien life form, in hopes of finding a cure to his own life-threatening disease","torrent":{"xt":"urn:btih:3ccc57bfe0f9c2509163800bfd9e6d5ecab4caaf","amp;dn":"+Stargate+SG-1+-+Season+05+-+Episodes+1+thru+11","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ccc57bfe0f9c2509163800bfd9e6d5ecab4caaf","infoHashBuffer":{"type":"Buffer","data":[60,204,87,191,224,249,194,80,145,99,128,11,253,158,109,94,202,180,202,175]},"announce":[],"urlList":[]}}