{"title":"Shakespeare: The Animated Tales Complete","uid":13671823,"size":3679546168,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3cdca27557394ef1134158917d6db8790f4ea5ef&amp;dn=Shakespeare%3A+The+Animated+Tales+Complete&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"semontrax","files":12,"time":1456350338,"description":"Shakespeare: The Animated Tales\r\n\r\nShakespeare: The Animated Tales (also known as The Animated Shakespeare) is a series of twelve half-hour animated television adaptations of the plays of William Shakespeare, originally broadcast on BBC 2 between 1992 and 1994.\r\n\r\nThe series was commissioned by the Welsh language channel S4C. Production was co-ordinated by the Dave Edwards Studio in Cardiff, although the shows were animated in Moscow by Soyuzmultfilm, using a variety of animation techniques. The scripts for each episode were written by Leon Garfield, who produced heavily truncated versions of each play. The academic consultant for the series was Professor Stanley Wells. The dialogue was recorded at the facilities of BBC Wales in Cardiff.\r\n\r\nThe show was both a commercial and a critical success. The first series episode &quot;Hamlet&quot; won two awards for &quot;Outstanding Individual Achievement in Animation&quot; (one for the animators and one for the designers and director) at the 1993 Emmys, and a Gold Award at the 1993 New York Festival. The second season episode &quot;The Winter's Tale&quot; also won the &quot;Outstanding Individual Achievement in Animation&quot; at the 1996 Emmys. The episodes continue to be used in schools as teaching aids, especially when introducing children to Shakespeare for the first time.\r\n \nhttps://en.wikipedia.org/wiki/Shakespeare:_The_Animated_Tales\r\n\r\n(Note: This is just a repack of the 4 separate torrents already on here.)","torrent":{"xt":"urn:btih:3cdca27557394ef1134158917d6db8790f4ea5ef","amp;dn":"Shakespeare%3A+The+Animated+Tales+Complete","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cdca27557394ef1134158917d6db8790f4ea5ef","infoHashBuffer":{"type":"Buffer","data":[60,220,162,117,87,57,78,241,19,65,88,145,125,109,184,121,15,78,165,239]},"announce":[],"urlList":[]}}