{"title":"Bekenntnisse des Hochstaplers Felix Krull (5_5) DSR.mkv","uid":13620446,"size":1735317355,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3e59020516becc553d748d606fa6b944cdb9631d&amp;dn=Bekenntnisse+des+Hochstaplers+Felix+Krull+%285_5%29+DSR.mkv&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"salsasat","files":1,"time":1455964636,"description":"A German soldier sent to Paris during World War I. He casts aside his uniform and gets a job as an elevator operator. A handsome lug, pursued by virtually every female who enters his little compartment. But the lad is shy, and besides, he'd rather discuss anthropology.\r\n\r\nFolge 5:\r\n\r\nAls Marquis de Venosta fährt Felix im Coupe Erster Klasse der ersten Station seiner Reise entgegen: Lissabon. Im Zug lernt er dann jene reizende Familie kennen, derentwegen er dann sehr viel länger in Portugal bleibt als vorgesehen. Professor Kuckuck, Leiter des Paläon- thologischen Museums in Lissabon vermag Felix durch seine gelehrten Ausführungen zu fesseln, gar nicht zu reden, wenn dann der weibliche Teil der Familie Kuckuck die Szene betritt. Maria Pia und ihre Toch- ter Zouzou. Felix kann sich nicht entscheiden, welches dieser beiden so widersprüchlichen und doch so zusammengehörigen, auf jeden Fall äußerst anziehenden Wesen er mehr bewundern soll. Willenlos folgt er in Lissabon dem Professor ins Museum, Zouzou zum Tennis und Maria Pia zu Tisch. Zouzou ist endlich bereit, sich dem verführerischen Marquis hinzugeben. Doch Maria Pia verhindert, daß der vermeintliche Marquis ihre Tochter verführt. Ungetröstet jedoch soll Felix nicht das Weite suchen müssen. - Bevor Felix sich auf eine längere Inspektionsreise auf diesem Planeten begibt, führt er Zouzou, der er immerhin beige- bracht hat, was Liebe ist, dem ihr zugedachten Verlobten zu. Dann verläßt er das Fest. DarstellerInnen: John Moulder-Brown (Felix), Fernando Rey (Professor Kuckuck), Vera Tschechowa (Maria Pia), Giorgia Slowe (Zouzou), Tony Portacio (Hurtado), Albert Varela Silva (Direktor), Armando Cortez (Portier), Ulrich Beiger (Stewart), Rui Luis de Castro (Botschafter). Stoffvorlage: Thomas Mann.\r\nText: ORF III\r\n\r\nmit John Moulder-Brown (Felix), Fernando Rey (Professor Kuckuck), Vera Tschechowa (Maria Pia), Georgia Slowe (Zouzou), Magali Noël (Mme Houpflé), Hans Heinz Moser (Herr Sturzil), Pierre Doris (Detective), Alain Flick (Monsieur Machatschek), Klaus Schwarzkopf (Father Krull), Daphne Wagner (Mother Krull), Mareike Carrière (Olympia), Franziska Walser (Genoveva), Oliver Wehe (Felix Krull (kid)), Rolf Zacher (Stanko), Rita Tushingham (Mrs. Twentyman), Kurt Raab (Sally Meerschaum), Nikolaus Paryla (Schimmelpreester), Despina Pajanou (Rosza), James Cossins (Lord Kilmarnock), Marie Colbin (Zaza) Musik: Nicos Mamangakis Produktionsfirma :Zweites Deutsches Fernsehen (ZDF), Kamera :Dietrich Lohmann, Produzent :Peter Märthesheimer, Schnitt :Susan Berthel-Ying\r\n\r\nRegie: Bernhard Sinkel","torrent":{"xt":"urn:btih:3e59020516becc553d748d606fa6b944cdb9631d","amp;dn":"Bekenntnisse+des+Hochstaplers+Felix+Krull+%285_5%29+DSR.mkv","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e59020516becc553d748d606fa6b944cdb9631d","infoHashBuffer":{"type":"Buffer","data":[62,89,2,5,22,190,204,85,61,116,141,96,111,166,185,68,205,185,99,29]},"announce":[],"urlList":[]}}