{"title":"Ben Dover - Fresh Cheeks (1996)","uid":13753478,"size":2355702050,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:41d9d817b1598e5c4a5761fdacc301fc5a0fdf8e&amp;dn=Ben+Dover+-+Fresh+Cheeks+%281996%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Rantlercat","files":1,"time":1457179340,"description":"In mp4 format optimised for iTunes and AppleTV, with metadata.\r\n\r\n------\r\n\r\nThis marvelous masterpiece of great British smut kicks off with Rosanna, who takes on Ben and his two well-hung chums. The insatiable black babe welcomes Ben's monster cock in her mouth, another big dick in her pussy, and yet another up her ass in a double-penetration delight! A right royal chocolate sandwhich is followed by a veritable spunkfest as randy Rosanna laps up three hot loads of cum!  \r\n\r\nNext, Lisa, a blonde beauty eagerly entertains Ben and his two buddies. This girl really likes to take it to the limit as Ben forces his hard dick into her greedy mouth, she manages to slide two hard cocks into her wet pussy simultaneously!  \r\n\r\nNext is Melanie, a cut coffee-colored student who will surprise you as well as she did Ben when he finds out she has a penchant for spanking and cock-sucking.\r\n\r\n  And, to conclude this collection of carnal delights, Ben picks up Kelly and Taylor, two Essex girls on a London bus. Back at his place, the teenage temptresses demonstrate their ample abilities for sucking and screwing, and one of the eighteen-year-old cuties decides to sample a hard cock up her ass for the very first time!","torrent":{"xt":"urn:btih:41d9d817b1598e5c4a5761fdacc301fc5a0fdf8e","amp;dn":"Ben+Dover+-+Fresh+Cheeks+%281996%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41d9d817b1598e5c4a5761fdacc301fc5a0fdf8e","infoHashBuffer":{"type":"Buffer","data":[65,217,216,23,177,89,142,92,74,87,97,253,172,195,1,252,90,15,223,142]},"announce":[],"urlList":[]}}