{"title":"Operation: Simoom *1999* [DVDRip][XviD][AC3][PL+English subs]","uid":13978867,"size":1468550192,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:44a708944af349ad4170a4a0d2f7ac129aa5e4ea&amp;dn=Operation%3A+Simoom+%2A1999%2A+%5BDVDRip%5D%5BXviD%5D%5BAC3%5D%5BPL%2BEnglish+subs%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"everdarksoul","files":3,"time":1458672437,"description":"The film is telling a fictional story, however for which true events were a background. Operation Simoom (Polish: Operacja Samum) - was a top secret Polish Intelligence operation conducted in Iraq in 1990.\r\n\r\nTitle: Operacja Samum (Operation: Simoom)\r\nProduction: Poland / year: 1999 / type: Movie\r\nGenres: drama / action / spy / non-fiction\r\nLanguage: Polish / +English subtitles\r\n\r\nall subtitles:\r\nEnglish, Czech\r\n\r\nThe film is a fictional account of Operation Simoom - a top secret Polish Intelligence operation to withdraw CIA agents before the start of the Persian Gulf War. In 1990 the CIA asked European intelligence agencies to assist in the withdrawal of six American operatives (a mix of CIA and DIA officers) investigating Iraqi troops movements in Iraq before the Gulf War. Several countries, such as: Soviet Union, Great Britain and France - refused to help in such a dangerous operation. Only Poland agreed to help.\r\nThe action of movie takes place after the Iraqi invasion of Kuwait in 1990. Retired Major Józef Mayer (Marek Kondrat) is a former agent of the Polish Office for State Protection (UOP) - the main Polish Intelligence Agency. Mayer’s doctor tells him that he may die from an unspecified disease. Meanwhile he finds also about going missing of his son in Iraq... The film then shifts to Baghdad - where Iraqi security forces raid a CIA safehouse maintained by CIA agent Jeff Magnus (Kristof Konrad). Walton and his two other CIA agents manage to escape into hiding as they prepare to leave Iraq before a possible war. Walton is warned by a Polish-American a Shin Bet agent, named Karen Pierce (Anna Korcz) to leave Iraq immediately. Meanwhile, Pierce is having an affair with Mayer’s son Paweł (Radosław Pazura), who is a Polish engineer working in Iraq. Paweł is detained and Pierce escapes after they are stopped by Iraqi Secret Police. While in a military prison, Paweł is tortured for not disclosing Pierce’s location to the Iraqis. The Iraqis suspect that Paweł is a spy... Mayer is deciding to free his son, not realizing that unwittingly is playing an important role in enabling the evacuation of American agents...\r\n\r\nCAST\r\n\r\nMarek Kondrat as Major Józef Mayer (retired agent of UOP)\r\nBogusław Linda as Edward Broński (an active UOP agent)\r\nOlaf Lubaszenko as Stanisław Kosiński (an active UOP agent)\r\nTadeusz Huk as the Colonel (head-chief of the UOP)\r\nAnna Korcz as Karen Pierce (a Polish-American Shin Bet agent)\r\nRadosław Pazura as Paweł Mayer (a Polish engineer working in Iraq, the son of Józef Mayer)\r\nJerzy Skolimowski as Hayes (a high-ranking CIA official)\r\nGustaw Holoubek as Shopsovitz (the head-chief of Shin Bet)\r\nKristof Konrad as Jeff Magnus (an active CIA agent)\r\n\r\n...and others...\r\n\r\nDirected: Władysław Pasikowski / Writed by: Maciej Dutkiewicz, Robert Brutter\r\nCinematography: Paweł Edelman / Music by: Goran Bregović\r\n\r\nDESCRIPTION\r\n\r\nGENERAL\r\nfile size: 1.37 GiB / duration: 1h 28mn / overall bit rate: 2 215 Kbps\r\nFormat: AVI (Audio Video Interleave) / Writing library: XviD 64\r\n\r\nVIDEO\r\nFormat: MPEG-4 Visual / profile: Advanced    / Codec ID: XviD\r\nWidth: 688 pixels / Height: 384 pixels / Bit rate: 1 825 Kbps\r\nFrame rate: 25.000 fps / Display aspect ratio: 16:9\r\n\r\nAUDIO\r\nFormat: AC-3 (Audio Coding 3) / extension: CM / Codec ID: 2000\r\nChannels: 6 channels / Channel positions: Front: L C R, Side: L R, LFE\r\nBit rate: 384 Kbps / Sampling rate: 48.0 KHz / Bit depth: 16 bits","torrent":{"xt":"urn:btih:44a708944af349ad4170a4a0d2f7ac129aa5e4ea","amp;dn":"Operation%3A+Simoom+%2A1999%2A+%5BDVDRip%5D%5BXviD%5D%5BAC3%5D%5BPL%2BEnglish+subs%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44a708944af349ad4170a4a0d2f7ac129aa5e4ea","infoHashBuffer":{"type":"Buffer","data":[68,167,8,148,74,243,73,173,65,112,164,160,210,247,172,18,154,165,228,234]},"announce":[],"urlList":[]}}