{"title":"[Reality Kings] Big Tits Boss Vol. 28 (2016)","uid":14027299,"size":2250729031,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:461faf62c5ba390876212118350505e7f9a3a542&amp;dn=%5BReality+Kings%5D+Big+Tits+Boss+Vol.+28+%282016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"distinc","files":14,"time":1458934346,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=7618840802\r\n \nhttp://imagedisco.net/?g=2009899272\r\n\r\n\r\n\r\nDescription:\r\n\r\nStarring: Dayton Rains, Brannon Rhodes, Eva Notty, Jessica Rayne, Nina Elle, Corinna Blake\r\n\r\nMarco went for a job. The interviewer, Eva, was less than pleased with his sloppy attire and had no intention of finding him employment. As the interview continued, Eva asked why she should hire him. Marco responded by saying he'd do anything. That sparked Eva's interest. Having noticed the bulge in Marco's pants, she decided she'd try to have some fun and maybe find him a job if she was satisfied. As Marco stared at Eva's big tits, he was more than happy to get this special interview treatment. Marco sucked those delicious tatas, and Eva was ready to suck some cock. Marco pounded her juicy pussy and got a firm handle on her plump ass while he showed her that he could put the work in. Eva was satisfied with his performance, and after he covered those luscious melons in cum, she decided to hire him\r\n\r\nCorinna was a young executive. She was smart, demanding, and best of all, sexy. There are few things hotter than a sexy woman who takes charge. A boss, if you will, to boss you around and make sure you are fucking correctly and pleasing her the best possible way. Corinna took some time off work to have a plumber come to her new house and fix her sink. He was very late arriving, and she was really pissed. Corinna not only had him unclog her sink, but she also put him to work cleaning her pipes and properly using his hose the way a Big Tit Boss demands. The best part was, these bossy women still wanted cum all over their faces, and only we can give them that, so they don't have all the power after all.\r\n\r\nMr. Dickenz made an appointment with Miss Rayne's office for some new work. Bruno was Jessica's last appointment before the weekend, and she was more then ready to leave. Her demeanor was less than pleasant when he arrived. Jessica wasn't going to go out of her way to find him a job now, and she told him her clients probably wouldn't hire him. He asked her to pad his resume, but while doing so, he couldn't keep himself from staring at Jessica's huge rack popping out of her shirt. Miss Rayne caught him, totally lost it in the moment, and berated him saying, she couldn't imagine how he even got by. Mr. Dickenz answered confidently saying how he got away with a lot because he was hung. Jessica in turns grabbed his cock and was more than pleased with her findings. She went to town on that dick. Then Bruno showed off his other talents and put in some extra work on Miss Rayne's pussy. We watched it all, as her big tits and juicy ass bounced endlessly until those tits were covered in cum.\r\n\r\nDayton had to try out a new guy to replace her old masseuse. Tyler came in super late and dressed unprofessionally. He had a few strikes already, and he was caught blatantly checking out her massive tits. Lucky for him, Dayton wasn't easily offended. She stripped down and had him start his routine. He oiled her up and went to town on those flesh balloons. Her nipples got nice and perky. Tyler moved down her legs, as she told him to remove her panties and eat her pussy. This is where the last guy failed, and she told him he could be replaced. Tyler dove in and licked away. He wanted this job and did everything thing the bossy tits wanted. Dayton wanted to make sure he was what her clients wanted, so she went all the way. She slobbered on his cock and took it in her wet pussy. Tyler proceeded to maneuver all over her body and in between her tits. He added some of his massage oil to complete her test.\r\n\r\nNina just noticed a major loss in a recent stock acquisition costing her a lot of money. She called Mirko in to discuss this problem. He showed little remorse for his mistake since he knew the company made more then enough money to cover the loss. Nina was furious now and after she asked Mirko if he had anything else to say he responded with, your tits look really good, and she lost it. Nina proceeded to cover his mouth with those big beautiful breast, ensuring he didn't speak anymore. Mirko made sure to please and pounded that pussy proper. Nina's plump tits and long blonde hair bounced about, as Mirko positions her fit sexy body in various positions. Nina made sure Mirko gave her everything he had including a face-full of cum","torrent":{"xt":"urn:btih:461faf62c5ba390876212118350505e7f9a3a542","amp;dn":"%5BReality+Kings%5D+Big+Tits+Boss+Vol.+28+%282016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"461faf62c5ba390876212118350505e7f9a3a542","infoHashBuffer":{"type":"Buffer","data":[70,31,175,98,197,186,57,8,118,33,33,24,53,5,5,231,249,163,165,66]},"announce":[],"urlList":[]}}