{"title":"Stargate SG-1 - Season 04 - Episodes 12 thru 22","uid":14114161,"size":7102059700,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:46e4885e7926eea949953c6885b22f018155b8a4&amp;dn=Stargate+SG-1+-+Season+04+-+Episodes+12+thru+22&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":38,"time":1459393918,"description":"411eg.jpg\r\n4.12 &quot;Tangent&quot;\r\nWhen O'Neill and Teal'c take an SGC-modified Goa'uld glider out for a test flight, they lose control and are sucked deep into outer space by a Goa'uld tracking device. It's up to the rest of the team to figure out a way to rescue them, before they run out of oxygen and life support and are lost in space forever.\r\n\r\nGuide | Transcript\r\n412eg.jpg\r\n4.13 &quot;Serpent's Venom&quot;\r\nSG-1 travels to a remote interplanetary minefield to sabotage a hazardous alliance between two powerful Goa'uld System Lords. But their mission becomes far more dangerous when they realize Teal'c has been captured by one of the Lords, who plans to use him as a pawn in their evil negotiations.\r\n\r\nGuide | Transcript\r\n413eg.jpg\r\n4.14 &quot;The Curse&quot;\r\nWhen Daniel Jackson returns to Chicago to attend the funeral of his mentor, a celebrated archaeologist, he soon realizes that the death is mysteriously connected to the recent discovery of a 10,000-year-old Egyptian artifact that might be cursed by a vengeful pharaoh.\r\n\r\nGuide | Transcript\r\n414eg.jpg\r\n4.15 &quot;Chain Reaction&quot;\r\nWhen SGC commander General Hammond steps down saying he's &quot;too old for the job,&quot; SG-1 immediately suspects foul play. And when a hard-nosed new general steps in to replace him and splits up SG-1, they vow to solve the mystery and get their beloved General Hammond back at the helm.\r\n\r\nGuide | Transcript\r\n415eg.jpg\r\n4.16 &quot;2010&quot;\r\nA decade in the future, Earth's alliance with a highly intelligent race of aliens has rendered SGC obsolete. But when Carter, now married to a human ambassador to the aliens, uncovers a terrifying secret about these &quot;benevolent&quot; beings, she must reassemble SG-1 to send an urgent message to the past.\r\n\r\nGuide | Transcript\r\n416eg.jpg\r\n4.17 &quot;Absolute Power&quot;\r\nWhen a &quot;chosen&quot; boy found on the planet Abydos is brought to SGC, he sends a telepathic message, causing Daniel Jackson's personality to undergo disturbing changes. Will the rest of SG-1 be able to solve the mystery of the boy's origin before Jackson becomes a power-hungry warmonger?\r\n\r\nGuide | Transcript\r\n417eg.jpg\r\n4.18 &quot;The Light&quot;\r\nSG-1 travels to a planet to investigate a machine that induces narcotic pleasure. But when they try to leave the planet, they are overcome with debilitating withdrawal symptoms, forcing them to stay. Can they free themselves from this addiction before it consumes them utterly?\r\n\r\nGuide | Transcript\r\n418eg.jpg\r\n4.19 &quot;Prodigy&quot;\r\nCarter takes a brilliant young cadet under her wing on a mission to a remote planet inhabited by unique electric beings that resemble a swarm of fireflies. But when the creatures suddenly turn aggressive, SG-1 will need the cadet's brainpower to help them escape with their lives.\r\n\r\nGuide | Transcript\r\n419eg.jpg\r\n4.20 &quot;Entity&quot;\r\nWhen SG-1 sends a probe through the Stargate, a powerful electronic impulse comes back through the wormhole and hides inside SGC's computer. But when this electronic entity suddenly jumps inside Carter's mind, SG-1 must choose between saving SGC and saving Carter's life.\r\n\r\nGuide | Transcript\r\n420eg.jpg\r\n4.21 &quot;Double Jeopardy&quot;\r\nSG-1 encounters a tricky situation when they join forces with androids designed to look exactly like them in a battle against an evil Goa'uld System Lord. Can they fight alongside robotic doppelgangers, or will confusion and contradiction blur the line between man and machine?\r\n421eg.jpg\r\n4.22 &quot;Exodus Part 1&quot;\r\nSG-1 joins forces with the Tok'ra in a final attempt to rid the universe of their mutual Goa'uld nemesis, Apophis. But their plan goes awry when a beloved member of their team is captured and they find themselves at the mercy of their most powerful and feared enemy","torrent":{"xt":"urn:btih:46e4885e7926eea949953c6885b22f018155b8a4","amp;dn":"Stargate+SG-1+-+Season+04+-+Episodes+12+thru+22","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46e4885e7926eea949953c6885b22f018155b8a4","infoHashBuffer":{"type":"Buffer","data":[70,228,136,94,121,38,238,169,73,149,60,104,133,178,47,1,129,85,184,164]},"announce":[],"urlList":[]}}