{"title":"Andy Warhol - Prince of Pop (Art Ebook).pdf","uid":13998783,"size":22137028,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4cd7e70cd27c062e4de7371c36cdfbfb5f88ceca&amp;dn=Andy+Warhol+-+Prince+of+Pop+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"STBGD","files":1,"time":1458766461,"description":"Andy Warhol: Prince of Pop\r\nDelacorte Press | 2004 | ISBN 038573056X | English | 248 pages | PDF | 21 MB\r\n\r\nAndy Warhol, the Pittsburgh-bred son of Eastern European immigrants, is well known for his Pop Art masterpieces. But there is more to Warhol than that: he also made films, launched 'Interview' magazine, and forsaw the convergence of art, Hollywood fashion and business as the trend of the future. &quot;In the future everybody will be world famous for 15 minutes.&quot; The Campbell's Soup Cans. The Marilyns. The Electric Chairs. The Flowers. The work created by Andy Warhol elevated everyday images to art, ensuring Warhol a fame that has far outlasted the 15 minutes he predicted for everyone else. His very name is synonymous with the 1960s American art movement known as Pop. But Warhol's oeuvre was the sum of many parts. He not only produced iconic art that blended high and popular culture; he also made controversial films, starring his entourage of the beautiful and outrageous; he launched Interview, a slick magazine that continues to sell today; and he reveled in leading the vanguard of New York's hipster lifestyle. The Factory, Warhol's studio and den of social happenings, was the place to be. Who would have predicted that this eccentric boy, the Pittsburgh-bred son of Eastern European immigrants, would catapult himself into media superstardom? Warhol's rise, from poverty to wealth, from obscurity to status as a Pop icon, is an absorbing tale-one in which the American dream of fame and fortune is played out in all of its success and its excess. No artist of the late 20th century took the pulse of his time-and ours-better than Andy Warhol. Praise for Vincent van Gogh: Portrait of an Artist: &quot;This outstanding, well-researched biography is fascinating reading.&quot;","torrent":{"xt":"urn:btih:4cd7e70cd27c062e4de7371c36cdfbfb5f88ceca","amp;dn":"Andy+Warhol+-+Prince+of+Pop+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cd7e70cd27c062e4de7371c36cdfbfb5f88ceca","infoHashBuffer":{"type":"Buffer","data":[76,215,231,12,210,124,6,46,77,231,55,28,54,205,251,251,95,136,206,202]},"announce":[],"urlList":[]}}