{"title":"ISEKI Food Series [Updated at 2016.03.01]","uid":13705251,"size":26764244,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e81a9aae73dc6513c5e7998597ccaa3edbe79e8&amp;dn=ISEKI+Food+Series+%5BUpdated+at+2016.03.01%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":7,"time":1456819736,"description":"The ISEKI-Food book series is a collection where various aspects of food safety and environmental issues are introduced and reviewed by scientists specializing in the field. In all of the books a special emphasis is placed on including case studies applicable to each specific topic. The books are intended for graduate students and senior level undergraduate students as well as professionals and researchers interested in food safety and environmental issues applicable to food safety.\r\n\r\n&quot;ISEKI-Food&quot; is an acronym for &quot;Integrating Safety and Environmental Knowledge Into Food Studies&quot;. Participants in the ISEKI-Food network, coordinated by Professor Cristina Silva at The Catholic University of Portugal, come from 29 countries in Europe and most of the institutes and universities involved with Food Science education at the university level in Europe are represented. Some international companies and non teaching institutions have also participated in the network. The main objectives of ISEKI-Food are to improve the harmonization of studies in food science and engineering in Europe and to develop and adapt food science curricula emphasizing the inclusion of safety and environmental topics","torrent":{"xt":"urn:btih:4e81a9aae73dc6513c5e7998597ccaa3edbe79e8","amp;dn":"ISEKI+Food+Series+%5BUpdated+at+2016.03.01%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e81a9aae73dc6513c5e7998597ccaa3edbe79e8","infoHashBuffer":{"type":"Buffer","data":[78,129,169,170,231,61,198,81,60,94,121,152,89,124,202,163,237,190,121,232]},"announce":[],"urlList":[]}}