{"title":"PC Auto Shutdown 6.4 + Serial","uid":13798603,"size":849476,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4ee5545aedc45b68c528613ba398402360004e71&amp;dn=PC+Auto+Shutdown+6.4+%2B+Serial&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rubberboy37","files":1,"time":1457437528,"description":"Program your Windows computer to automatically activate one of it's power functions with the help of this lightweigt and easy to use application.\r\n\r\n\r\n\r\nYou can not always wait for your PC to finish a task so that you can shut it down, and there is no other way to automatically do so except with the help of specialized applications. PC Auto Shutdowen offers one of the most important commants for your Windows computer - automatic shutdown. With this handy tool, you can schedule a shutdown, restart, standby mode and other such tasks.\r\n\r\n\r\n\r\nA guided schedule creation process\r\n\r\nThe user interface of the program consists of a wizard, where you can organize several timers. In the first part you set up one or multiple timers - add a timer title, select shutdown actions, time (in hours and minutes) and activate it once, daily, on week days or once a week, but you can also edit or delete these tasks.\r\n\r\n\r\n\r\nManage time settings and keep them secured\r\n\r\nIn the following step, the program requires you to configure the countdown duration time before a shutdown event is activated, enable/disable the display of the system tray icon for easy access, as well as the abort button in countdown window and prevent users from changing the system time.\r\n\r\n\r\n\r\nClever integration of hotkey support\r\n\r\nAdditionally, you can assign hotkeys to shutdown actions (power of, shutdown, reboot, hibernate, suspend, log off), but also enable and select sound to play while the shutdown command is activated (loop sound, adjust volume).\r\n\r\n\r\n\r\nCleans your Windows computer before triggering a command\r\n\r\nFurthermore, you can clean up some items during the shutdown action - Recycle Bin, Windows Temporary Files, Internet Explorer (Temporary Files, Cookies, Browser History, Address Bar History, Favorites) and recent documents list as well as enable password protection and the logging of shutdown events ()view/empty log file)","torrent":{"xt":"urn:btih:4ee5545aedc45b68c528613ba398402360004e71","amp;dn":"PC+Auto+Shutdown+6.4+%2B+Serial","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ee5545aedc45b68c528613ba398402360004e71","infoHashBuffer":{"type":"Buffer","data":[78,229,84,90,237,196,91,104,197,40,97,59,163,152,64,35,96,0,78,113]},"announce":[],"urlList":[]}}