{"title":"Emperor Legend v1.2.2 mod","uid":14108040,"size":96193818,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:4f162621eef78e2e441366c1235c43bfaa3c4a2c&amp;dn=Emperor+Legend+v1.2.2+mod&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":1,"time":1459373658,"description":"Jump into the most stunning 3D hero RPG for mobile! \r\n\r\nBe a kung fu hero! Recruit kings and beauties to fight by your side as your crush evil demons. Explore the dynasties through over 20 gorgeously painted story levels overcome with incredible fantasy creatures. Wield amazing skills in epic 3D battles so beautiful and exciting your jaw will drop and your blood will boil! \r\n\r\nChoosing from dozens of heroes and skills, you’ll create a legendary team that will shock your friends and overwhelm your enemies, and build a glorious dynasty of your very own! \r\n\r\nRECRUIT EPIC HEROES\r\n- Choose your Heroes from the kings and beauties of East Asian legend\r\n- Promote and Ascend them to teach them awesome new skills \r\n- Equip them with full upgradeable gear, soul-shredding ch’i attacks, and rare Relics that unlock their special abilities\r\n\r\nFIGHT STUNNING 3D BATTLES\r\n- Lead your team personally into battle and fight in perfectly rendered 3D!\r\n- Immerse yourself in dynamic, fully-animated battle effects including lightning bolts, earthquakes, light auras, and more!\r\n\r\nTONS OF GAMEPLAY\r\n- Legend: Lead your Heroes through over 20 Chapters of Story Mode\r\n- Guild Wars: Join your friends and fight real players in HUGE 15-on-15 battles\r\n- Dojo: Climb PvP rankings and win rare rewards by pitting your team against other players\r\n- Tower Trial: Ascend the levels of Heaven to reach legendary rewards!\r\n- Journey: Lead a campaign out into the savage lands!\r\n- Savage Wars: Face waves of enemies, including a Demon Army and the mystic Dragon Turtle. The farther you get, the more loot you win!\r\n\r\nWhat’s new:\r\nNew Features\r\n- Fixed some localization bugs.\r\n- New Relic upgrade system! Relics can now absorb your chosen gear or other Relics to Upgrade.\r\n- Relic Refinement system! Refine Relics to get and change new bonus stats.\r\n- Relic Forge can now melt down Relics!\r\n- Relic Forge now has a new Relic Hammer system.\r\n- Legend Chapters 26-29 added, including Elite Legends.\r\n- 80 new Hero Gifts added!\r\n- New, higher difficult levels added to all Savage Wars: Dragon Turtle, Demon Army, and Mystic Ruins!\r\n\r\nMod Info:\r\nDamage Multiplier \r\nUnlimited Mana\r\n\r\nRequired Android O/S : 2.3+","torrent":{"xt":"urn:btih:4f162621eef78e2e441366c1235c43bfaa3c4a2c","amp;dn":"Emperor+Legend+v1.2.2+mod","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f162621eef78e2e441366c1235c43bfaa3c4a2c","infoHashBuffer":{"type":"Buffer","data":[79,22,38,33,238,247,142,46,68,19,102,193,35,92,67,191,170,60,74,44]},"announce":[],"urlList":[]}}