{"title":"New Heart 720p HDTV x264-ChodIng","uid":13766644,"size":35368723933,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4f430eb3cd2f42e015a7ddfa3de9002cb6fd148b&amp;dn=New+Heart+720p+HDTV+x264-ChodIng&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"joshua121595","files":24,"time":1457248984,"description":"The pride and frustration of cardiac surgeons on the job. Lee Eun Sung graduated from a newly established medical school in the southern province and not from an elite one like the Hwang Hee University Hospital where he applied for residency with the hope of becoming a great cardiac specialist. Since he wasn't a graduate of Hwang Hee U., he was looked down upon by almost everyone at the hospital. Nam Hye Suk graduated with top marks and was regarded as a star student. She was an absolute fundamentalist and proud of herself. Dr. Choi Kang Gook became the new head of the Department of Thoracic and Cardiovascular Surgery after being in exile for 5 years for getting into trouble with his former superior. He was a genius but he was also a stubborn surgeon who does not care for hospital politics. It ended up only LES and NHS were the only doctors who applied for residency and they were accepted with great reluctance after being rejected outright by Dr. CKG. Lee Dong Gwon, a famous actor, was admitted to the Hospital for arrhythmia surgery. He knew NHS from elementary school and was infatuated with her. Between him and LES, who would NHS choose?\r\n\r\nTorrent Info.:\r\nQuality: HD\r\nAudio Language: Korean\r\nSubtitles: None\r\n\r\nNote:\r\nIt seems that No one has a full 100% copy of this, idk just yet cuz I too just downloaded this recently from an unknown korean torrent site of I dont know and checked it here if it was uploaded, it turns out its not uploaded, so I just uploaded it here myself. I did not create the rip, but sure at least that the torrent is in good quality. Be back here again if I confirmed that there is someone with 100% copy,sofar only 99% is what Im seeing in the seeds. :). Torrent seeds is in good speeds though because I'm receiving a maximum DL speed I could get from my ISP with this torrent","torrent":{"xt":"urn:btih:4f430eb3cd2f42e015a7ddfa3de9002cb6fd148b","amp;dn":"New+Heart+720p+HDTV+x264-ChodIng","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f430eb3cd2f42e015a7ddfa3de9002cb6fd148b","infoHashBuffer":{"type":"Buffer","data":[79,67,14,179,205,47,66,224,21,167,221,250,61,233,0,44,182,253,20,139]},"announce":[],"urlList":[]}}