{"title":"J.U.L.I.A. Among the Stars (GOG)","uid":14005942,"size":3087649908,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:50917d29c27c7b87625a41625001ccd69284a6f2&amp;dn=J.U.L.I.A.+Among+the+Stars+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mercs215","files":6,"time":1458791566,"description":"Install instructions:\r\n- Run &quot;setup_julia_among_the_stars_2.0.0.5.exe&quot;\r\n- Play\r\nCredits: this release was made possible by Swapware Games Network!\r\nIf you like this game, support the developers and BUY IT!\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\n\r\nTitle: J.U.L.I.A. AMONG THE STARS\r\nGenre: Adventure - Puzzle - Sci-fi\r\nWorks on: Windows (Vista, 7, 8, 10) and Linux (Ubuntu 14.04, Mint 17)\r\nLanguages: Audio and text: Deutsch, English\r\nFeatures: single-player - achievements\r\nReleased: September 12, 2014\r\nSize: 2.8 GB\r\nCompany: CBE Software / CBE Software\r\nStore page: https://www.gog.com/game/julia_among_the_stars\r\n\r\nAbout:\r\nJ.U.L.I.A.: Among the Stars comes with a bonus standalone puzzle game J.U.L.I.A.: Untold.\r\nJ.U.L.I.A.: Among the Stars is an innovative narrative driven adventure game which is being developed due to overwhelming support from a successful crowdfunding campaign.\r\nThe story centers on Rachel Manners, a 35 year old astrobiologist. She is a member of an elite group of scientists, chosen to embark on one of the most critical missions ever conceived on Earth. Now Rachel is alone, orbiting an unknown planet. Her only companions are J.U.L.I.A., the space probe’s artificial intelligence and Mobot, a huge reconnaissance robot. Together, this unlikely trio will explore the mysteries of this solar system. But are they prepared for what they will find?\r\nStory\r\nAfter countless years of careful space observation, the enormous telescope Chandra 17 suddenly locates a solar system quite similar to our own. As all earthly observatories turned their attention towards this new discovery, a signal of artificial origin is detected from deep within the system.\r\nReaction was immediate and a mission plan was conceived. No expense was spared in the construction of a massive space probe. It was designed and equipped to be ideally suited for the ultimate challenge: to meet and study extraterrestrial sentient life-forms. Equal care was taken with the crew. Only the most prominent scientists were selected and trained to ideally represent planet Earth. Everything was perfectly planned and success was certain. Yet somehow, everything has gone terribly wrong…\r\nNow, imagine being jolted awake by an emergency alarm. As your surroundings come into focus, you realize you were deep in cryogenic sleep on a vast space probe. But why you are there is an elusive memory. Disoriented, you rush to the control room searching for answers. Once there you learn from the ship’s AI that not only have you been asleep for decades, but you are also the last surviving member of the probe’s crew.\r\nTo make matters worse, the probe is severely damaged by a disastrous impact with a passing meteoroid swarm. First, you must make repairs. Not only is your own survival at stake, but you need to find out what happened to the crew and why you alone survived.\r\nTravel to six unique planets and uncover their secrets.\r\nUtilize an ingenious MOBOT – a mobile robot designed for planetary exploration to investigate remote solar systems.\r\nSolve puzzles, gather clues, and communicate with the most temperamental artificial intelligence ever designed.\r\n\r\nMinimum system requirements - Windows: Vista / 7 / 8 / 10\r\nProcessor: Dual Core 2 GHz or higher\r\nMemory: 1 GB RAM\r\nGraphics: Minimum resolution: 1280x720 with at least 128 MB VRAM accelerated card\r\nDirectX: Version 10\r\nStorage: 4 GB available space\r\nSound Card: DirectX compatible soundcard\r\nMouse, Keyboard\r\n\r\nRecommended system requirements - Windows: 7 / 8 / 10\r\nProcessor: Intel i5 or equivalent Memory: 2 GB RAM \r\nGraphics: Resolution of 1920x1080 with at least 512 MB VRAM accelerated card DirectX: Version 10 Storage: 4 GB available space \r\nSound Card: DirectX compatible soundcard\r\nMouse, Keyboard","torrent":{"xt":"urn:btih:50917d29c27c7b87625a41625001ccd69284a6f2","amp;dn":"J.U.L.I.A.+Among+the+Stars+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50917d29c27c7b87625a41625001ccd69284a6f2","infoHashBuffer":{"type":"Buffer","data":[80,145,125,41,194,124,123,135,98,90,65,98,80,1,204,214,146,132,166,242]},"announce":[],"urlList":[]}}