{"title":"InnocentHigh ~ Odette Delacroix NEW (Teaching Black History, 12","uid":13607022,"size":280177618,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:54092ac60e1c582dd549ec79d3433c89753cbe4f&amp;dn=InnocentHigh+%7E+Odette+Delacroix+NEW+%28Teaching+Black+History%2C+12+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"ImgSnaps","files":1,"time":1455892595,"description":"InnocentHigh ~ Odette Delacroix NEW (Teaching Black History, 12 Inches At A Time / TeamSkeet / 19 February 2016) 480p NEW\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/image/k5f\r\n \nhttp://imgsnaps.com/image/k5I\r\n \nhttp://imgsnaps.com/image/k55\r\n \nhttp://imgsnaps.com/image/k5A\r\n\r\nOdette is a new student here at Innocent High. She is currently enrolled in Mr. Maxwells class where they are going over the Civil Rights Leaders for Black History Month. She expresses her concern that she doesnt know any of the names and tells that she didnt have any studies of this kind back where she was from. She was shocked when she learned that interracial marriage was so taboo seeing as she finds black men very sexy. She puts her hands all over Mr. Maxwell and even though he was reluctant at first, he pulls out his fat black rod and lets her suck it. He puts her on the desk and starts to eat her tiny teen pussy. He flings everything off the desk and pushes his meat inside her. He picks her up, fucks her on and off of his desk, rattling everything around him from the force. He finally pulls out and sprays her white face with sperm from his ebony pipe.\r\nTags:\r\n18, 18 Year, Adorable, Amateur, Ass Licking, Big Ass, Big Dicks, Bimbo, Black Cock, Blonde, Booty, Bubble Butt, Butt, Caucasian, Classroom, Coed, Cute, Desk, Doggystyle, Easy, Facial, Fingering, Fondling, Girl Next Door, Handjob, Hardcore, Indoor, Interracial, Knee Highs, Long Hair, Missionary, Natural Tits, Nerdy, No Condom, Nympho, Pale, Petite, Pussy Lick, Rough Sex, Schoolgirl, Schoolgirl Outfit, Sexy, Shaved Pussy, Short, Skinny, Skirts, Slim, Slutty, Straight, Student, Teen, Tiny, Uniform, White","torrent":{"xt":"urn:btih:54092ac60e1c582dd549ec79d3433c89753cbe4f","amp;dn":"InnocentHigh+%7E+Odette+Delacroix+NEW+%28Teaching+Black+History%2C+12+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54092ac60e1c582dd549ec79d3433c89753cbe4f","infoHashBuffer":{"type":"Buffer","data":[84,9,42,198,14,28,88,45,213,73,236,121,211,67,60,137,117,60,190,79]},"announce":[],"urlList":[]}}