{"title":"The Upperfloor--tUF-39849 Samantha Hayes, Cherry Torn, Tommy Pis","uid":14070628,"size":1240954276,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:5551dc396de5d3713a62c7556ba1b22db543b4e9&amp;dn=The+Upperfloor--tUF-39849+Samantha+Hayes%2C+Cherry+Torn%2C+Tommy+Pis&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":188,"time":1459172506,"description":"Spoiled Sex Slave Broken &amp; Fucked\r\n\r\nMar 25, 2016 - Performers: Cherry Torn ,  Tommy Pistol  and  Samantha Hayes \r\n\r\n\r\nMed and Hi MP4 + Pics.\r\n\r\n\r\nSamanatha Hayes is a spoilt sexual submissive, always demanding more punishment and sex, having forgotten how to truly serve. Her Master brings her The Upper Floor to train with the original slave, Cherry Torn. Busty and confident, Cherry diagnosis' Samantha's submission coming from self interest and immediately sets to work breaking her beautiful body and will so that she may enjoy sex submission from a place ops serenity and service. Denied her Master and Husbands cock, Samantha cries in pain on the floor, Cherry sitting on her face and stealing all the dick while she receives a harsh caning. Only until she had properly begged and shown complete gratitude may Samantha have some cock, and only then while being shocked and electro tormented. \r\n\r\nNext scene finds Samantha tied in a very restrictive partial suspension, unable to move or control anything, she must give in to complete sexual use and try to not cum until she is given permission. At the beginning she squirts uncontrollably all over her husband's cock and Cherry's punishing hand, but by the end of the scene she is pleading and cumming on command like a good girl. When she doesn't a swift slap or electrical shock serves to remind her. \r\n\r\nHer next lesson is aiding in another slaves submissions while not being the center of attention. Cherry is latched down in a rope position, wrenching her perfect round ass into the air. Samantha's slutty mouth is cranked open wide and drooling, and she cleans her husbands cock, pleases Cherry's well fucked holes, and provides all the lubricant for a orgasmic anal fucking for Cherry. \r\n\r\nBoth slaves present their asses, to take punishment with grace. Why? Because her husband feel's like it. That's her final lesson, that BDSM is not about fair, it's about power and pleasure. Taking her flogging and spanking like a good slut, Samantha is finally allowed to help Cherry's ass gape around her husbands cock, and take a squirting screaming ride herself. A happy, health, well fucked slave emerges at the end of the day, all thanks to Cherry Torn.\r\n\r\nScreens \nhttp://www.theupperfloor.com/site/shoot.jsp?shootId=39849\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n20 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:5551dc396de5d3713a62c7556ba1b22db543b4e9","amp;dn":"The+Upperfloor--tUF-39849+Samantha+Hayes%2C+Cherry+Torn%2C+Tommy+Pis","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5551dc396de5d3713a62c7556ba1b22db543b4e9","infoHashBuffer":{"type":"Buffer","data":[85,81,220,57,109,229,211,113,58,98,199,85,107,161,178,45,181,67,180,233]},"announce":[],"urlList":[]}}