{"title":"The Upperfloor--tUF-39681 Zoe Parker, Abella Danger, Bill Bailey","uid":13829935,"size":2839049056,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:55e97f523b0d9c653119aceb4363a9080534cc3c&amp;dn=The+Upperfloor--tUF-39681+Zoe+Parker%2C+Abella+Danger%2C+Bill+Bailey&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":138,"time":1457734877,"description":"\n\r\n\r\nBill Bailey, Abella Danger, Zoe Parker\r\n\r\nMar 11, 2016 - Performers: Bill Bailey ,  Abella Danger  and  Zoe Parker \r\n\r\n\r\nMed and HD MP4 + Pics.\r\n\r\n\r\nSlutty masochist Abella Danger is a perfect slave, but can she graduate to tutoring another piece of hot slave fuck meat? The Butler finds her misusing the new girl as she cleans the lounge. Zoe has not even been taught the rules, let alone given a task aside from lapping at Abella's asshole. Cruel metal nipple clamps and weight are applied to Abella to teach her a lesson in humility as Bill ties up the new slave trainee and shows Abella how to properly use a new girl. filling her hot mouth with cock, fucking her tight pussy, and stimulating her clit as she has the rules pounded into her, and electro zapper on hand if she can't recite them. Abella is given a punishment orgasm, walking backwards to pull the tight metal clamps off her swollen nipples. \r\n\r\nSecond scene, Zoe is on her own as Abella has her head locked under a table and her ass tied open wide. Zoe must stand and take a deep pounding in her pink cunt while learning to plead for her and Abella's pleasure with composure. Gracefully begging into Abella's asshole, Zoes earns them both reward orgasms from the vibrators latched to both their clits with tight rope bondage. \r\n\r\nAbella, having done a wonderful job with Zoe, is fed torment and rough anal fucking in bondage for the rest of her service. The look on fresh girl Zoe's face is priceless and she soothes Abella's cunt with her tongue and rips clamps on Abella's insane breast zipper. Both girls get rough reverse cowgirl fucks and a hot cum on their lovely faces for a job well done. \r\n\r\nScreens \nhttp://www.theupperfloor.com/site/shoot.jsp?shootId=39681\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n20 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:55e97f523b0d9c653119aceb4363a9080534cc3c","amp;dn":"The+Upperfloor--tUF-39681+Zoe+Parker%2C+Abella+Danger%2C+Bill+Bailey","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55e97f523b0d9c653119aceb4363a9080534cc3c","infoHashBuffer":{"type":"Buffer","data":[85,233,127,82,59,13,156,101,49,25,172,235,67,99,169,8,5,52,204,60]},"announce":[],"urlList":[]}}