{"title":"Jesus Myth eBooks Collection (v2.0)","uid":13986164,"size":457127585,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:55eb93112ffe638e656be8467b0c3770a232643d&amp;dn=Jesus+Myth+eBooks+Collection+%28v2.0%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":188,"time":1458693790,"description":"\nJesus Myth eBooks Collection (v2.0)\r\n\r\n\r\nAlan Dundes - Holy Writ as Oral Lit\r\nAlan Segal - Life After Death\r\nAmy-Jill Levine - The Historical Jesus in Context\r\nArthur Drews - The Christ Myth\r\nBarber &amp; Barber - When They Severed Earth from Sky\r\nBeale &amp; Carson - Commentary on the New Testament\r\nBruce Malina - The Social Gospel of Jesus\r\nBurton Mack - The Lost Gospel - The Book of Q\r\nC. E. Hill - Who Chose the Gospels\r\nCandida Moss - The Myth of Persecution\r\nCharles Freeman - A New History of Early Christianity\r\nD. Jason Cooper - Mithras - Mysteries and Inititation Rediscovered\r\nDavid Brakke - The Gnostics\r\nDavid Fitzgerald - Nailed - Ten Christian Myths That Show Jesus Never Existed at All\r\nDennis MacDonald - Does the New Testament Imitate Homer\r\nDerek Murphy - Jesus Potter Harry Christ\r\nEarl Doherty - Jesus - Neither God Nor Man - The Case for a Mythical Jesus\r\nEarl Doherty - The End of an Illusion\r\nElaine Pagels - Adam, Eve, and the Serpent\r\nElaine Pagels - Beyond Belief - The Secret Gospel of Thomas\r\nElaine Pagels - Revelations\r\nElaine Pagels - The Gnostic Gospels\r\nElaine Pagels - The Origin of Satan\r\nFranz Cumont - Astrology and Religion Among the Greeks and Romans\r\nFranz Cumont - The Mysteries of Mithra\r\nFranz Cumont - The Oriental Religions in Roman Paganism\r\nFreke &amp; Gandy - The Jesus Mysteries (PDF)\r\nGeorge Wells - Cutting Jesus Down to Size\r\nGeorge Wells - Who Was Jesus\r\nGlenn Holland - Gods in the Desert\r\nGregory Shushan - Conceptions of the Afterlife in Early Civilizations\r\nHans Josef Klauck - The Religious Context of Early Christianity\r\nHector Avalos - Fighting Words - The Origins Of Religious Violence\r\nHelen Ellerbe - The Dark Side of Christian History\r\nIsrael Finkelstein - David and Solomon\r\nIsrael Finkelstein - The Bible Unearthed\r\nIsrael Finkelstein - The Quest for the Historical Israel\r\nJack David Eller - Cruel Creeds, Virtuous Violence\r\nJeffrey Cooley - Early Mesopotamian Astral Science and Divination (PDF)\r\nJill Levine, ed. - The Historical Jesus in Context\r\nJoel Baden - The Historical David\r\nJohn Crossan - The Power of Parable\r\nJohn Philip Jenkins - Jesus Wars\r\nJohn Philip Jenkins - The Lost History of Christianity\r\nJohn W. Loftus - Christianity Is Not Great\r\nJohn W. Loftus - The Christian Delusion - Why Faith Fails\r\nJohn W. Loftus - The End of Christianity\r\nJon Davies - Death, Burial and Rebirth in the Religions of Antiquity\r\nJonathan Kirsch - God Against The Gods\r\nKris Komarnitsky - Doubting Jesus' Resurrection\r\nLisa Miller - Heaven - Our Enduring Fascination with the Afterlife\r\nMarcus Borg - Reading the Bible Again For the First Time\r\nMark Smith - The Early History of God\r\nMark Smith - The Memoirs of God\r\nMark Smith - The Origins of Biblical Monotheism\r\nMark Smith - The Priestly Vision of Genesis\r\nMarvin Meyer - The Gnostic Discoveries\r\nMichael Coogan - Stories from Ancient Canaan\r\nMichael Satlow - How the Bible Became Holy\r\nPeter Struck - Birth of the Symbol\r\nRandel Helms - Gospel Fictions\r\nRaphael Lataster - There was no Jesus, there is no God\r\nRaphael Lataster and Richard Carrier - Jesus Did Not Exist\r\nRichard Carrier - Bart Ehrman and the Quest of the Historical Jesus of Nazareth\r\nRichard Carrier - Hitler Homer Bible Christ\r\nRichard Carrier - Not the Impossible Faith\r\nRichard Carrier - On the Historicity of Jesus\r\nRichard Carrier - Proving History\r\nRichard Carrier - Sense and Goodness Without God\r\nRichard Carrier - Why I Am Not a Christian\r\nRichard Friedman - The Hidden Book in the Bible\r\nRichard Friedman - Who Wrote the Bible\r\nRichard Rubenstein - When Jesus Became God\r\nRobert M. Price - Deconstructing Jesus\r\nRobert M. Price - Evolving out of Eden - Christian Responses to Evolution\r\nRobert M. Price - Inerrant the Wind - The Evangelical Crisis of Biblical Authority\r\nRobert M. Price - Jesus Is Dead\r\nRobert M. Price - Killing History - Jesus In The No-Spin Zone\r\nRobert M. Price - The Amazing Colossal Apostle - The Search for the Historical Paul\r\nRobert M. Price - The Case Against the Case For Christ\r\nRobert M. Price - The Christ-Myth Theory And Its Problems\r\nRobert M. Price - The Empty Tomb\r\nRobert M. Price - The Historical Bejeezus\r\nRobert M. Price - The Incredible Shrinking Son of Man\r\nS. Angus - The Mystery-Religions\r\nSteve Wells - Drunk with Blood\r\nSteve Wells - The Skeptic's Annotated Bible\r\nThomas Thompson - The Messiah Myth\r\nTom Harpur - The Pagan Christ\r\nVan Voorst - Jesus Outside the New Testament\r\nWilliam Dever - Did God Have a Wife\r\nWilliam Dever - The Rise of Ancient Israel\r\nWilliam Dever - What Did the Biblical Writers Know\r\nWilliam Dever - Who Were the Early Israelites\r\n\r\n\r\nFormats:\r\n.mobi (compatible with Amazon Kindle, etc.)\r\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)","torrent":{"xt":"urn:btih:55eb93112ffe638e656be8467b0c3770a232643d","amp;dn":"Jesus+Myth+eBooks+Collection+%28v2.0%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55eb93112ffe638e656be8467b0c3770a232643d","infoHashBuffer":{"type":"Buffer","data":[85,235,147,17,47,254,99,142,101,107,232,70,123,12,55,112,162,50,100,61]},"announce":[],"urlList":[]}}