{"title":"Hillary Clinton Censored Mails","uid":13863073,"size":678965,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:56548b023f2d5974390a290e023172d59d840e97&amp;dn=Hillary+Clinton+Censored+Mails&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":33,"time":1458045801,"description":"Early on (day one) I received insider information about Hillary's mail box. On day one they knew there were well over 10,000 classified documents that were deleted off of Hillary's hard drive, documents she was never supposed to have access to. And those E-mails constituted a revelation well worth nuking/rodding China over. Many people believe that China got the shaft because of financial decisions only, but I am going to explain just how grave the damage Hillary did to America is, and perhaps people will begin to understand why I think it had a lot to do with what happened in Tianjin.\r\n\r\nFirst of all, they know the exact number of deletes Hillary did, because her &quot;professional&quot; was not so pro. How do they know? EASY: On the inside edge of any hard drive platter, there is a table which contains the location information for every file on the disk. When a delete is done, the table entries are flagged as deleted, (but the files are still on the disk, they are simply marked as writable space). Fine, her &quot;pro&quot; wrote and re-wrote that writable space, to do a hard erase, but the entries in the file table were still there, marked as writable space.\r\n\r\nNormally you can't re-access these to see what the filenames were, unless . . . . . well, American intelligence has (and even I have) software that will simply command a hard drive to do a direct linear read of what is on it, and by doing this, they were able to dump the entire table to a readable file. They then sat down and read it line by line, deleted entries and all. And they found over 17,000 entries that had not been over written in this table. These entries did not contain the actual file they referred to, they only proved it existed, and when the files were wiped. This is how they knew.\r\n\r\nDAY ONE, AS I REPORTED HERE WITHOUT MINCING WORDS DAY ONE (almost a week ago now) that Hillary had THOUSANDS AND THOUSANDS of classified documents in her mail box.\r\n\r\nPhase 2 in the Hillary bust - the death part.\r\n\r\nOk, so her &quot;pro&quot; wiped the files by writing over them with an application such as Norton clean sweep. Great. BUT, that only works against hacker joe. The NSA and any other respectable intelligence agency can still get a good idea of what was there before the wipe. This cannot be done if the platters are left in the original hard drive. This is how this next step (the death part) was done:\r\nThey took the platters out of the hard drive and loaded them into a special drive with special heads that are far more sensitive than any commercially produced hard drive has. They then looked for the sub modulations beneath the bits the wiping software put there, and were able to assemble enough from the remaining stray magnetic information to prove that the deleted files were in fact classified documents with all the details. As of this writing, 330 are confirmed, 17,000 more to go!~\r\n\r\nPhase 3 in the Hillary bust: Staff screwups\r\n\r\nInitially, when I &quot;stumbled across&quot; the insider information, all the intelligence agencies did was run the not deleted mails from a copy of her hard drive through a text string checker (they made a copy first and then read the copy, to help preserve the written over sub-bits in the original) and just from what Hillary presented straight up, they were able to use the copy (which contains no sub bits) to match text strings with classified documents that did not show up in what she presented as the &quot;whole thing&quot; and from that alone they totally busted her. Her staff was able to wipe all the stuff marked classified, but it was not able to find everything that was copied from classified documents and talked about. What you are hearing about coming out now is the proven classified documents they managed to extract from the written over portion of the original hard drive loaded into the forensic chassis, not what they knew straight up on day one\r\n\r\nFrom the initial bust they knew on day one, just from text string checking - the step that did not even require a deep dredging of wiped data, they were able to conclude that Hillary had many many moles inside the NSA, who gave her the encryption keys for the NSA's own satellites, and they beamed her whatever she wanted on request. Now proven to be over 17,000 documents in all. That most likely equals somewhere between 100,000 to a million pages of classified documents, all at the highest possible level. How many classified documents per day does that equal? Enough to solidly prove that Hillary was far into the business of peddling classified data, and peg her as the #1 (known about) espionage agent in American history.\r\n\r\nNow consider who Hillary represents: The Bolshevik communist tip of the spear luciferian Jewish &quot;destroy and enslave the world&quot; cult. She simply cannot get busted for what she did, or the entire house of satan might bite the dust over it. After all, if she did it, he did it, they did it, now the genie is out of the bottle and the NSA knows it has been raped wholesale. If damage control cannot bury this, it is the end of a lot more than just Hillary. Would that be worth rodding China for, just for a simple topic diversion in the press? YES. Would that be worth waking up a volcano in Japan? YES. And it would even be worth a world war for the depraved death cult, BET ON IT.\r\n\r\nQUESTION THEN: Was the attack financial only, not considering Hillary at all?","torrent":{"xt":"urn:btih:56548b023f2d5974390a290e023172d59d840e97","amp;dn":"Hillary+Clinton+Censored+Mails","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56548b023f2d5974390a290e023172d59d840e97","infoHashBuffer":{"type":"Buffer","data":[86,84,139,2,63,45,89,116,57,10,41,14,2,49,114,213,157,132,14,151]},"announce":[],"urlList":[]}}