{"title":"Shes In Control 2 (NEW 2016 TEAM SKEET) [DVD RIP ALL 5 SPLIT SCE","uid":13991781,"size":2293243033,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5ab98704df8c37836c810f97fecbb52390848f0d&amp;dn=Shes+In+Control+2+%28NEW+2016+TEAM+SKEET%29+%5BDVD+RIP+ALL+5+SPLIT+SCE&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ImgSnaps","files":5,"time":1458709661,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/iPM\r\n \nhttp://imgsnaps.com/image/iPg\r\n \nhttp://imgsnaps.com/image/iPv\r\n \nhttp://imgsnaps.com/image/iP0\r\n \nhttp://imgsnaps.com/image/iPP\r\n \nhttp://imgsnaps.com/image/iPR\r\n\r\nCAST\r\nJojo Kiss, Adrian Maya, Cali Sparks, Mary Jane Mayhem, Mandy Muse\r\n\r\nDESCRIPTION\r\nAdrian Maya - Adrian catches the gardener spying on her getting dressed! She tells him she'll get him fired unless he gets naked for her! She humiliates him as he undresses but she agrees to help him get off. Adrian drops to her knees and makes his cock grow with her mouth! Then she gets drilled fully clothed until her ass gets covered in cum!\r\n\r\nCali Sparks - Cali had to stay at the coach's house because her mom didn't pick her up. Cali catches the coach's creepy son looking through her bag, sniffing her bra and panties! She tells him to take off his clothes so he'll get a taste of his own medicine! But once Cali saw how nice his dick she pulled her panties to the side and took that dick deep!\r\n\r\nJojo Kiss - Jojo's boyfriend uninvited her to the basketball finals, but she's not taking it lightly. Jojo humiliates him and makes him crawl around , bark like a dog and dance like a ballerina before sitting on his face and riding it! She tells him not touch her clothes and she fucks him until Jojo commands him to cum in her mouth!\r\n\r\nMandy Muse - Mandy's boyfriend wants to get some but Mandy is too in to her video game. She continues to play but she pulls her panties to the side to keep her guy happy. He takes her from behind, she sucks his dick and rides his massive cock all while still playing her video game fully clothes. Now that's a real game!\r\n\r\nMary Jane Mayhem - I couldn't help but get a boner when my new masseuse was touching me. She said it was making her feel uncomfortable but I told her I'd call her company and tell them that she wouldn't' massage me. Worried that she would lose her job she did what was necessary to make me lose my hardon - suck and fuck me until I came!","torrent":{"xt":"urn:btih:5ab98704df8c37836c810f97fecbb52390848f0d","amp;dn":"Shes+In+Control+2+%28NEW+2016+TEAM+SKEET%29+%5BDVD+RIP+ALL+5+SPLIT+SCE","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ab98704df8c37836c810f97fecbb52390848f0d","infoHashBuffer":{"type":"Buffer","data":[90,185,135,4,223,140,55,131,108,129,15,151,254,203,181,35,144,132,143,13]},"announce":[],"urlList":[]}}