{"title":"Mandrake the Magician (1939) Old Time Serial (OTS)","uid":13803490,"size":2746774168,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5be01d1da9e184c612d99130a1844397a909baef&amp;dn=Mandrake+the+Magician+%281939%29+Old+Time+Serial+%28OTS%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"MikeyMoMo","files":12,"time":1457472893,"description":"From 1939 come 12 episodes in glorious Black and White of Mandrake the Magician Columbia's 7th serial (between Flying G-Men and Overland With Kit Carson)was based on the King Features newspaper comic strip created by Lee Falk and Phil Davis, Mandrake the Magician, the world's foremost exponent of mind over matter, although most of us who read the strip over the years were never really certain whether Mandrake was really a magician, or just had even more ability to cloud men's minds than the Shadow. The serial does allow Mandrake to discard his tie and tails when he isn't performing professionally, but out of his top hat and cloak, he is mainly a fist-slugging detective in this serial. Mandrake and Luthor are working the cruise lines and meet Professor Hudson who has developed a radium energy machine, which is much coveted by &quot;The Wasp&quot;, who sends his hordes of henchmen in waves to steal the invention, and they blow up a radio station, a power plant and a dam pdq just to show they mean business. Mandrake, after 11 chapters, finally catches up to &quot;The Wasp&quot; in chapter 12, &quot;The Reward of Trachery&quot;, and discovers the villain is actually a scientist who has posed as a close friend of Hudson's. Mandrake is reunited with Hudson's daughter Betty, while Luthor, as usual, is saddled with putting up the props.\r\n- Written by Les Adams &lt;  &gt;","torrent":{"xt":"urn:btih:5be01d1da9e184c612d99130a1844397a909baef","amp;dn":"Mandrake+the+Magician+%281939%29+Old+Time+Serial+%28OTS%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5be01d1da9e184c612d99130a1844397a909baef","infoHashBuffer":{"type":"Buffer","data":[91,224,29,29,169,225,132,198,18,217,145,48,161,132,67,151,169,9,186,239]},"announce":[],"urlList":[]}}