{"title":"Alien Shooter v1.1.4 full + data","uid":14038346,"size":86265460,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:5d0263ebd336b8a3bddcfab1a2836c7ff9285955&amp;dn=Alien+Shooter+v1.1.4+full+%2B+data&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":2,"time":1458997030,"description":"Legendary PC Alien Shooter is now available on your Android device!\r\n\r\nDeserted military complex. Hordes of merciless creatures. Here you are. Your mission is simple – clear the base so there are just dead monsters' corpses left around.\r\n\r\n- burst through 10 missions and find out the reason of alien invasion!\r\n- Enjoy user friendly control schemes with auto-aim option available!\r\n- stand up to the huge crowds of monsters appearing on one screen at a time\r\n- level up, try out superhuman fighting abilities in an intense battle\r\n- corpses of the monsters eliminated do not disappear - check out what happens at the end of every level!\r\n\r\nThe alien invasion has begun, we have one chance, and that is to stop them cold in their staging area. Do not allow them escape this facility, you are our last hope. The fate of humanity now depends on you! Mow them down and stay alive!\r\n\r\n&quot;With a wonderful array of weapons, non-stop action, splendid graphics, eerie music and a wonderful adventure setting, Alien Shooter is a game that delivers on every front.&quot; - Game Tunnel\r\n\r\n&quot;Step forward Alien Shooter, which in the absence of any empirical studies, I'm happy to stake has a higher body count than all the Dooms, Dukes and Gauntlets put together. It's also a bloody good game with an arsenal of weapons any FPS would be proud of.&quot; - PC Zone Magazine\r\n\r\n- &quot;All in all, I highly recommend Alien Shooter, especially if you loved the old Doom by ID's because, although substantially different, they share the same frenzy and the same immediacy of play. Definitely a great title.&quot; - retrogaminghistory.com\r\n\r\nWhat’s new:\r\n- Minor bugs fixes and improvements.\r\n\r\nInstall APK,Place data folder in SDCard/Android/Obb/ and play","torrent":{"xt":"urn:btih:5d0263ebd336b8a3bddcfab1a2836c7ff9285955","amp;dn":"Alien+Shooter+v1.1.4+full+%2B+data","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d0263ebd336b8a3bddcfab1a2836c7ff9285955","infoHashBuffer":{"type":"Buffer","data":[93,2,99,235,211,54,184,163,189,220,250,177,162,131,108,127,249,40,89,85]},"announce":[],"urlList":[]}}