{"title":"Bekenntnisse des Hochstaplers Felix Krull (1_5) DSR.mkv","uid":13619010,"size":1640838543,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5f72f1e88d7e378ab1fa034abbe2ba5360473018&amp;dn=Bekenntnisse+des+Hochstaplers+Felix+Krull+%281_5%29+DSR.mkv&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"salsasat","files":1,"time":1455961040,"description":"A German soldier sent to Paris during World War I. He casts aside his uniform and gets a job as an elevator operator. A handsome lug, pursued by virtually every female who enters his little compartment. But the lad is shy, and besides, he'd rather discuss anthropology.\r\n\r\nDeutsche Erstausstrahlung: 24.01.1982 (ZDF)\r\nSpielfilm in 5 Teilen\r\n\r\nFelix Krull (John Moulder-Brown ) schafft sich schon als Kind im verfallenden Haushalt der bürgerlichen Sekterzeugerfamilie Krull seine eigene Welt. Er definiert sich selbst als den Mittelpunkt eines Hofstaates und wickelt seine Kindermädchen um den Finger. Er stiehlt die Objekte seiner Begierde, so die teuren Pralinen seiner Eltern und später die Frauen anderer Männer. Sogar vor dem Militärdienst kann sich Felix mit seiner herausragenden Verstellungskunst drücken. Als Krull senior (Klaus Schwarzkopf) sich, völlig bankrott, das Leben nimmt und Felix in einer verzweifelt tristen Lage steckt, vermittelt ihm sein Patenonkel (Nikolaus Paryla) eine Anstellung in einem Pariser Hotel. Nun beginnt der gesellschaftliche Höhenflug Krulls; seine Galanterie und Verführungskunst machen den Liftboy im Hotel de Ville schnell zum beliebtesten Oberkellner. Alsbald verstrickt sich der begehrte &quot;Armand&quot; in ein Eifersuchtsdrama: Der hochrangige Marquis de Venosta (Pierre-François Pistorio) will die Unterhaltungskünstlerin Zaza (Marie Colbin) heiraten, die sich aber nur für dessen Geld, umso mehr aber für Krull und seine Schönheit interessiert ...\r\n(aus dem fernsehserien.de-Episodenführer)\r\n\r\nThomas Manns populärstes und heiterstes Buch um den charmanten Hochstapler Felix Krull wurde bereits 1957 von Kurt Hoffmann mit Horst Buchholz in der Hauptrolle verfilmt. In dem fünfteiligen Fernsehfilm spielt der Engländer John Moulder-Brown die Titelrolle.\r\n\r\nCast &amp; Crew\r\n•\tJohn Moulder-Brown: Felix Krull\r\n•\tOliver Wehe: Felix Krull als Kind\r\n•\tKlaus Schwarzkopf: Vater Krull\r\n•\tDaphne Wagner: Mutter Krull\r\n•\tNikolaus Paryla: Schimmelpreester\r\n•\tMareike Carrière: Olympia\r\n•\tFranziska Walser: Genoveva\r\n•\tKlaus Pohl: Leutnant Übel\r\n•\tMagalie Noel: Madame Houpflé\r\n•\tHans Heinz Moser: Direktor Stürzli\r\n•\tPierre Doris: Hoteldektiv\r\n•\tMarie Colbin: Zaza\r\n•\tPierre-Francois Pistorio: Venosta\r\n•\tRita Tushingham: Mrs. Twentyman\r\n•\tJoss Ackland: Joss Ackland\r\n•\tFernando Rey: Professor Kuckuck\r\n•\tVera Tschechowa: Maria Pia\r\n•\tGeorgia Slowe: Zouzou\r\n•\tTony Portacio: Hurtado\r\nRegie: Bernhard Sinkel\r\nBuchvorlage: Thomas Mann\r\n\r\nFolge 1\r\n\r\nEtwa um die Jahrhundertwende wächst in dem kleinen Weinstädtchen Eltville am Rhein ein ungewöhliches Kind heran: Felix Krull, Sohn eines deutschen Sektfabrikanten, der aber französischen Champagner seinen Produkten vorzieht und auch sonst der leichten Lebensart eher zugeneigt ist als der spießbürgerlichen, die im dieser Stadt eigent- lich Sitte ist. Felix, ein Knabe von angenehmen Äußeren und nicht minder angenehmen Wesen, entdeckt schnell, daß seine natürlichen Ga- ben geeignet sind, seine Umwelt zu entzücken, wenn nicht zu verzau- bern. Und Felix beginnt nun, seine Talente zu erproben; an seinen Eltern, seinen Lehrern, seinem Patenonkel und schließlich als höch- stes Ziel, an Genoveva, dem jungen Hausmädchen. Während Felix sich in dieser Weise spielerisch vergnügt, hat auch sein Vater die schönen Seiten des Lebens dem vulgären Alltag vorgezogen, der ihn dann frei- lich in Form eines Bankrotts noch einholt. Nobel, wie es sich gehört, nimmt Vater Krull sich das Leben, und das Dasein von Felix hat auf einmal eine weniger behagliche Perspektive.\r\n\r\nmit John Moulder-Brown (Felix), Oliver Wehe (Felix als Kind), Klaus Schwarzkopf (Vater Krull), Daphne Wagner (Mutter Krull), Magali Noël (Mme Houpflé), Mareike Carrière (Olympia), Franziska Walser (Genoveva), Hans Heinz Moser (Herr Sturzil), Pierre Doris (Detective), Alain Flick (Monsieur Machatschek), Rolf Zacher (Stanko), Rita Tushingham (Mrs. Twentyman), Vera Tschechowa (Maria Pia), Georgia Slowe (Zouzou), Fernando Rey (Professor Kuckuck), Kurt Raab (Sally Meerschaum), Nikolaus Paryla (Schimmelpreester), Despina Pajanou (Rosza), James Cossins (Lord Kilmarnock), Marie Colbin (Zaza)","torrent":{"xt":"urn:btih:5f72f1e88d7e378ab1fa034abbe2ba5360473018","amp;dn":"Bekenntnisse+des+Hochstaplers+Felix+Krull+%281_5%29+DSR.mkv","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f72f1e88d7e378ab1fa034abbe2ba5360473018","infoHashBuffer":{"type":"Buffer","data":[95,114,241,232,141,126,55,138,177,250,3,74,187,226,186,83,96,71,48,24]},"announce":[],"urlList":[]}}