{"title":"Raw 25 [Evil Angel]","uid":13847127,"size":1734211913,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5f925c3078f875e32a736e6a3756e190f7237ec5&amp;dn=Raw+25+%5BEvil+Angel%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"distinc","files":1,"time":1457875173,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=6787449615\r\n \nhttp://imagedisco.net/?g=7482983018\r\n\r\n\r\nDescription:\r\n\r\nMovie : Raw 25\r\nDuration : 3:32:50\r\nReleased on: 2/22/2016\r\nDirected by: Manuel Ferrara\r\nSTD : Evil Angel\r\nStarring: Manuel Ferrara, Summer Brielle, Kendra Lust, Mercedes Carrera, Blair Williams\r\n\r\nManuel Ferrara is one of the top male performers in history. He has mastered the art of raw filmmaking whereas it's just him, a girl and a camera in a room. He shoots in POV or puts the camera on a dresser to film the hardcore action. His signature series, Raw, reaches its 25th edition and he has a sexy cast for us to enjoy. Blair Williams, Kendra Lust, Summer Brielle and Mercedes Carrera.\r\n\r\nScene One: Blair Williams/\r\nI have to say right off the bat that I'm jealous of Manuel. He relates the story of how he met Blair at the AVN Awards nomination party and the next day he has sex with her. I've known Blair for about 8 months longer than he has and I haven't had that opportunity!!! Blair is a sexy contestant of The Sex Factor and when she knocks on his door, I almost lose my load. She's wearing a black dress with a sheer covering over her cleavage. Damn, she's sexy! Manuel puts down the camera and makes out with her. Manuel eats her out and just buries himself in her cooch. Blair gives him head and impales her face on his dick. She does a great job! Manuel bangs her in doggie and Blair has a great arch. Blair leads him to the bedroom and he fucks her in spoon, cowgirl, mih and doggie. Blair sucks him off and tosses hsi salad. She rides in cowgirl and then they repeat a few positions. Blair gives him head and works out some stringers. Blair works out his load all over her face. I have to say, I've seen all 25 volumes of Raw and this is the most raw scene of the series!\r\n\r\nScene Two: Mercedes Carrera/\r\nMercedes is a gorgeous cougar and Manuel feels up her body. Mercedes is so gorgeous and she takes him down her throat. Mercedes licks his butthole and worships his dick. Manuel eats her out and enters her in mish. Manuel also pumps her in mish and Mercedes' body is insane! She also takes him balls deep in doggie, spoon, cowgirl and reverse. Mercedes is tremendous in this scene and is so fucking sexy. Manuel fucks her in a standing miah and Mercedes flat stomach is incredible! Mercedes strokes him off on her face and she cleans him off. Mercedes is incredible and does a great job.\r\n\r\nScene Three: Kendra Lust/\r\nKendra is naked and looks superb. She's ready for Manuel bur he wants to take a showrr firs,t,. Kendra rubs one out and puts herself in some nice positions. Manuel worships her body and she rides him in cowgirl. Kendra worships his cokc and bangs the back of her throat. She rides him in cowgirl, spoon, cowgirl and reverse.Kendra worships his balls and tosses his salad. fucking hot! Kendra rides him in cowgirl and reverse before taking him in doggie and spoon, Kendra gives him head and earns her load all over her face.\r\n\r\nScene Four: Summer Brielle/\r\nWe get introduced to Summer by focusing on her tits encased in a skimpy pink bra. She straddles Manuel and he worships her breasts. Manuel eats her out and bangs her in mish and cowgirl. Summer takes him into her mouth She gives him a very sensual blowjob and strokes his shaft as she bangs the back of her throat. They finish up in doggie, spoon, mish and cowgirl. Manuel fires a few ropes of cum at her face and Summer cleans him off","torrent":{"xt":"urn:btih:5f925c3078f875e32a736e6a3756e190f7237ec5","amp;dn":"Raw+25+%5BEvil+Angel%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f925c3078f875e32a736e6a3756e190f7237ec5","infoHashBuffer":{"type":"Buffer","data":[95,146,92,48,120,248,117,227,42,115,110,106,55,86,225,144,247,35,126,197]},"announce":[],"urlList":[]}}