{"title":"Privileged Asian Society Girl","uid":13697946,"size":905109474,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:61c7c6569f20daf78b5b0ffd956518758fb96b76&amp;dn=Privileged+Asian+Society+Girl&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sarah.jensen","files":1,"time":1456717037,"description":"Middle class girls have been getting tattoos for years now, it is nothing new, not even a way to rebel, it is the normal thing they do, especially good looking girls, as a mark of adulthood. It sets them apart from their family and sends a message of independence. I am not sure their parents agree, and I am not too sure about the stars tattooed on Cream's neck. Now they have got to do more. As a sign of self value and achievement, many middle class girls are asking to feature in their own adult movies, to be displayed on the internet. They don't do it for money, they have got plenty of that already. So Cream was introduced to me, as a girl who wants to be in a movie, quite simply. She assured me that she has been fucked a fair bit by a few guys, and would not be shy. So I fucked her on video. Exceptional figure, and that slightly stuck up but lovely face that privileged girls have. She certainly keeps herself well, and can afford the best creams and beauty products. She must be worth a fortune. When she gets married, it will cost her husband's family fucking millions. With her looks, she will quite easily bleed them dry. Still, she will have to find some guy who is both from the same social standing, and a modern thinker, someone who understands her reason for making this video. A few rich girls are doing it now, and Cream will not be left out. She has already got the mercedes car, and has had an expensive and wasted foreign education. So, please look at Cream in full high definition. This is a girl out of your social standing, but be glad to watch her soft skin and moist pink vagina, as I taste the high life","torrent":{"xt":"urn:btih:61c7c6569f20daf78b5b0ffd956518758fb96b76","amp;dn":"Privileged+Asian+Society+Girl","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61c7c6569f20daf78b5b0ffd956518758fb96b76","infoHashBuffer":{"type":"Buffer","data":[97,199,198,86,159,32,218,247,139,91,15,253,149,101,24,117,143,185,107,118]},"announce":[],"urlList":[]}}