{"title":"Young Stalin (FLAC) [2nd attempt to fix]","uid":14105533,"size":1169251721,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:634847067325d01496a864d0963d148dbdf7ff9d&amp;dn=Young+Stalin+%28FLAC%29+%5B2nd+attempt+to+fix%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"captainhadd0ck","files":78,"time":1459350968,"description":"**** my third attempt to make this audiobook available ***\r\n**** please ignore earlier torrents ****\r\n\r\nYoung Stalin by Simon Sebag Montefiore\r\n\r\nRead by Seán Barrett\r\n\r\nWinner of the Costa Biography Prize\r\n\r\nWhat makes a Stalin? Was he a Tsarist agent or Lenin's bandit? Was he to blame for his wife's death? When did the killing start?\r\n\r\nBased on revelatory research, here is the thrilling story of how a charismatic cobbler's son became a student priest, romantic poet, prolific lover, gangster mastermind and murderous revolutionary. \r\nCulminating in the 1917 revolution, Simon Sebag Montefiore's bestselling biography radically alters our understanding of the gifted politician and fanatical Marxist who shaped the Soviet empire in his own brutal image. \r\n\r\n\r\n\r\nThis is the story of how Stalin became Stalin.\r\n\r\nAuthor biography:\r\nSimon Sebag Montefiore's bestselling and prize-winning books are now published in over 45 languages. \r\n\r\nHis new book 'The Romanovs: 1613-1918,' a full history of the 20 tsars of the Romanov dynasty over three hundred years, is out in January 2016.\r\n\r\nHe has won literary prizes for both fiction and non-fiction. His latest novel, 'One Night in Winter' won the Best Political Novel of the Year Prize and was longlisted for the Orwell Prize. His thriller-love-stories set in Russia -'One Night in Winter' and 'Sashenka' - are both out in paperback.\r\n \r\nAmongst his history books: 'Catherine the Great &amp; Potemkin' was shortlisted for the Samuel Johnson, Duff Cooper, and Marsh Biography Prizes. 'Stalin: The Court of the Red Tsar' won the History Book of the Year Prize at the British Book Awards. 'Young Stalin' won the Costa Biography Award (UK), the LA Times Book Prize for Biography (US), Le Grand Prix de la Biographie Politique (France) and the Kreisky Prize for Political Literature (Austria). 'Jerusalem: The Biography' was a global number one bestseller. \r\nMontefiore read history at Gonville &amp; Caius College, Cambridge University where he was awarded his Doctorate of Philosophy. A Fellow of the Royal Society of Literature and Visiting Professor at the University of Buckingham, Dr Montefiore is the presenter of four BBC TV series Jerusalem (2011); Rome (2012) and Istanbul/Constantinople - 'Byzantium: a tale of 3 cities' (2013) and now Spain (2015)","torrent":{"xt":"urn:btih:634847067325d01496a864d0963d148dbdf7ff9d","amp;dn":"Young+Stalin+%28FLAC%29+%5B2nd+attempt+to+fix%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"634847067325d01496a864d0963d148dbdf7ff9d","infoHashBuffer":{"type":"Buffer","data":[99,72,71,6,115,37,208,20,150,168,100,208,150,61,20,141,189,247,255,157]},"announce":[],"urlList":[]}}