{"title":"The Greatest Love (Korean Drama) [JseitchenC]","uid":13840305,"size":2353846930,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:682c994c72bf1764f616372e05d6207ddaba43a6&amp;dn=The+Greatest+Love+%28Korean+Drama%29+%5BJseitchenC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":13,"uploader":"xueshen","files":16,"time":1457790770,"description":"Greatest Love\r\n\r\nFile info\r\nCodec:ffh264\r\nResolution:640 x 352\r\nFramerate:29.970 fps\r\nBitrate:289 Kbps\r\nAudio info:ffaac, 44 kbps, 48000 Hz\r\n\r\nProfile\r\nDrama: The Greatest Love (English &amp; literal title)\r\nRevised romanization: Choigowei Sarang\r\nHangul: ìµœê³ ì˜ ì‚¬ëž‘\r\nDirector: Park Hong-Kyun, Lee Dong-Yoon\r\nWriter: Hong Mi-Ran, Hong Jung-Eun\r\nNetwork: MBC\r\nEpisodes: 16\r\nRelease Date: May 4 - June 23, 2011\r\nRuntime: Wed. &amp; Thurs. 21:55\r\nGenre:' Romance\r\nLanguage: Korean\r\nCountry: South Korea\r\nPlot\r\n&quot;The Greatest Love&quot; depicts a sometimes comical, sometimes sad, sometimes sweet and sometimes maddening love square between a popular actor, a washed up former pop idol, a successful former pop idol, and a doctor of traditional Asian medicine.\r\n\r\n10 years ago, girl group &quot;Kukbo Sonyeo (National Treasure Girls)&quot; was the top girl group, but 18 months later the group held a press conference announcing their breakup--for unknown reasons. Since that time, lead vocalist Ku Ae-Jung (Kong Hyo-Jin) has gone through many difficulties; she released a solo album, but it flopped. Many negative rumors also swirled around her, but again, for unknown reasons, she never discussed them or explained them in any way. This led the public to develop a very negative image of her. Her father and brother lost all the money from her brief success on a string of failed business ventures. Now 10 years later, she is known to of the public only as a D-lister, the bottom of the celebrity pile, but she still struggles to maintain her career and take care of her family by appearing on any TV or radio programs that will have her.\r\n\r\nMeanwhile, top actor Dok Ko-Jin (Cha Seung-Won) is considered by the public as the perfect man; he is an action movie star who is sexy, yet humble--to the public. In actuality, Dok Ko-Jin is arrogant, self absorbed, and downright mean to those who know him. By chance, Dok Ko-Jin and Ku Ae-Jung cross paths at a gas station. Ku Ae-Jung seems to be recognized by a young fan and, because she is flattered, stands next to Dok Ko-Jin's decked out van while he is still sitting inside--as if it is hers. After the fan leaves, she becomes curious who might be in the van and peers into the heavily tinted windows, but is unable to see anything. Dok Ko-Jin sees her trying to peer through the window and believing she is a fan of his, grabs her arm through a partially opened window and autographs his cyrptic signature onto her palm. He then has his driver drive off without identifying himself to her.\r\n\r\nLater on, Dok Ko-Jin and Ku Ae-Jung meet again in the lobby of a TV broadcasting company. Through a series of mishaps, Ku Ae-Jung finds herself hiding in Dok Ko-Jin's dressing room and overhears a conversation between Dok Ko-Jin and his manager where she learns that Dok Ko-Jin had his eardrum ruptured during a shooting scene and he wasn't picked for a coveted movie role, even though he bribed the director with a very expensive bottle of wine. On her way out of his dressing room, she bumps into Dok Ko-Jin and when he autographs his name on her scarf she realizes that he was the arrogant star at the gas station in the van.\r\n\r\nKu Ae-Jung then appears on the variety TV show &quot;Sebakwi&quot; and lies to the staff that she can call the famous actor Dok Ko-Jin during the show's speed quiz segment. Before she goes on, she asks Dok Ko-Jin to take her call--but he refuses. However, for some reason when the show airs he changes his mind and actually takes her phone call. Unfortunately for both, Ku Ae-Jung, caught up in the excitement and pressure of the game, accidentally reveals one of the secrets that she overheard in his dressing room--that Dok Ko-Jin tried to bribe a movie director with a bottle of wine. This leads to the beginning of their tumultuous, often hilarious relationship...\r\n\r\nWe continue to see the ups and downs of their relationship and there are several surprising things that the storywriters let happen to both characters throughout the series as their relationship continues to build and develop.\r\n\r\nAnother wonderful Hong Sisters drama, arguably the best of their career, &quot;The Greatest Love&quot; carries a dual meaning. The most obvious is the love Ko-Jin grows to have for Ae-Jung, but just as important and poignant is the deep, sacrificial love Ae-Jung has for the people in her life. It's Ae-Jung's willingness to sacrifice herself that lies behind why she finds it so difficult to escape her bad image and the rumors that follow her.\r\n\r\nNotes\r\nEarly Korean title was &quot;Aejungui Balgyun&quot; (literal translation &quot;The Discovery of Affection&quot;).\r\n&quot;The Greatest Love&quot; took over the MBC Wed. &amp; Thurs. 21:55 time slot previously occupied by &quot;Royal Family&quot; and was followed by &quot;Heartstrings&quot; on June 29.\r\n\r\nCast\r\nCha Seung-Won\tKong Hyo-Jin\tYoon Kye-Sang\tYoo In-Na\r\n\r\nHardsubbed Complete\r\nPlease seed and enjoy!\r\nHappy watching!","torrent":{"xt":"urn:btih:682c994c72bf1764f616372e05d6207ddaba43a6","amp;dn":"The+Greatest+Love+%28Korean+Drama%29+%5BJseitchenC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"682c994c72bf1764f616372e05d6207ddaba43a6","infoHashBuffer":{"type":"Buffer","data":[104,44,153,76,114,191,23,100,246,22,55,46,5,214,32,125,218,186,67,166]},"announce":[],"urlList":[]}}