{"title":"Minions Paradise v7.0.2851 mod","uid":14036702,"size":81511943,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:69a1e2c93af495a5ae234a2766a324f4cfff001a&amp;dn=Minions+Paradise+v7.0.2851+mod&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tiropitaki","files":1,"time":1458975328,"description":"Join the Minions on the vacation of a lifetime!\r\n\r\nWhen a lovable yet bumbling Minion named Phil sinks the cruise ship carrying his Minion buddies, he must turn a deserted tropical island into the perfect paradise! Join Illumination Entertainment – the creators of the MINIONS movie – and EA as they take your favorite Minions on an incredible journey.\r\n\r\nUNLEASH YOUR CREATIVITY\r\nHelp Phil build the perfect Minions Paradise! Customize your island with hot tubs, hammocks, and beach volleyball courts. Plant firefly trees, harness power from electric eels, and grow bushels of bananas to make an island paradise for Phil and his Minion buddies. \r\n\r\nEXPLORE YOUR PARADISE\r\nThe more land you get, the more fun your Minions will have! Become an expert at alligator waterskiing, throw mangoes from hot air balloons, and dive off waterslides.\r\n\r\nPARTY WITH YOUR FAVORITE MINIONS\r\nShare your paradise with Kevin, Stuart, and Bob from the MINIONS movie! Make all your vacation dreams come true and be joined by all your favorite Minion buddies.\r\n\r\nCOMPLETE VILLAINOUS MASTER PLANS\r\nAll Minions need a villain to serve! Aid Phil and the Minions as they work to finish Professor Flux’s master plan. Help Flux put his dastardly plans into motion and earn special Minion Level-Up Tokens to upgrade the abilities of your favorite Minions!\r\n\r\nWhat’s new:\r\nHey paradise people! We made a few behind-the-scenes improvements to keep your island escape as fun as possible. Don't forget to rate Minions Paradise to let us know how we’re doing. Thanks for playing.\r\n\r\nMod Info: \r\nMassive XP Every time you build a DECORATION. Get to lvl3 then build decorations\r\n\r\nRequired Android O/S : 4.1+","torrent":{"xt":"urn:btih:69a1e2c93af495a5ae234a2766a324f4cfff001a","amp;dn":"Minions+Paradise+v7.0.2851+mod","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69a1e2c93af495a5ae234a2766a324f4cfff001a","infoHashBuffer":{"type":"Buffer","data":[105,161,226,201,58,244,149,165,174,35,74,39,102,163,36,244,207,255,0,26]},"announce":[],"urlList":[]}}