{"title":"Stargate SG-1 - Season 03 - Episodes 12 thru 22","uid":14099310,"size":7344532733,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6c97f10a89e7fef302e43a5e8788127a2f44ff13&amp;dn=Stargate+SG-1+-+Season+03+-+Episodes+12+thru+22&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":38,"time":1459306793,"description":"Stargate SG-1 - Season 03 - Episodes 12 thru 22\r\n\r\n\r\n3.12 &quot;Jolinar's Memories Part 1&quot;\r\nCarter's father has been captured on a moon transformed into a literal hell. As no one has ever escaped from hell except for Jolinar, Tok'ra technology is used to access Jolinar's memories from Carter's mind…but not before an old foe shows up to foil the rescue mission.\r\n\r\nGuide | Transcript\r\n312eg.jpg\r\n3.13 &quot;The Devil You Know Part 2&quot;\r\nDuring an attempt to rescue Carter's father, SG-1 is caught by one of hell's denizens, determined to use the information they possess to overthrow the Goa'uld lord Sokar. Using Tok'ra technology, the team is forced to relive painful memories…but how much torture can they take?\r\n\r\nGuide | Transcript\r\n313eg.jpg\r\n3.14 &quot;Foothold&quot;\r\nDuring routine medical exams, Dr. Fraiser injects each team member with a sedative, rendering them unconscious. Teal'c awakens and sees General Hammond conspiring with Fraiser and two aliens. What has happened at Stargate Command, and can SG-1 overpower its own &quot;allies&quot;?\r\n\r\nGuide | Transcript\r\n314eg.jpg\r\n3.15 &quot;Pretense&quot;\r\nWhen SG-1 is invited to the Tollan planet to attend a ceremony called a &quot;Triad,&quot; they are shocked to discover it is actually a trial to determine the fate of their old friend Skaara. Daniel and O'Neill must argue a case against a mysterious Goa'uld named Zipacna to save Skaara's personality.\r\n\r\nGuide | Transcript\r\n315eg.jpg\r\n3.16 &quot;Urgo&quot;\r\nEn route to a paradise planet, SG-1 is secretly implanted with an alien spore that evolves into a being called Urgo. Though Urgo claims to be friendly, the suspicious team members work feverishly to rid themselves of the creature before it destroys their minds.\r\n\r\nGuide | Transcript\r\n316eg.jpg\r\n3.17 &quot;A Hundred Days&quot;\r\nSG-1 visits the friendly planet Edora and gathers to watch the annual meteor show that lights up the sky like a fiery rain. But suddenly, wayward asteroids bombard the planet, destroying the Stargate. Can O'Neill and the team ever return home?\r\n\r\nGuide | Transcript\r\n317eg.jpg\r\n3.18 &quot;Shades Of Grey&quot;\r\nOn a mission to Tollana, O'Neill steals a weapon and takes it back to Earth. When Hammond discovers the deception, he suspends O'Neill. But O'Neill's misconduct is only the beginning of a mystery that could have catastrophic consequences.\r\n\r\nGuide | Transcript\r\n318eg.jpg\r\n3.19 &quot;New Ground&quot;\r\nThree quarters of SG-1 are captured upon arrival to a planet in the midst of a religious war. While Carter, Daniel, and O'Neill are tortured for information as they try to convince their Bedrosian captors they're not enemy spies, an injured Teal'c gets help from a Bedrosian scientist who may have his own agenda.\r\n\r\nGuide | Transcript\r\n319eg.jpg\r\n3.20 &quot;Maternal Instinct&quot;\r\nBra'tac arrives at Stargate Command with a wild story about interplanetary warfare with Apophis. Daniel deduces that the battle is over Apophis' child, Harsesis, and races to save the child before Apophis finds him first.\r\n\r\nGuide | Transcript\r\n320eg.jpg\r\n3.21 &quot;Crystal Skull&quot;\r\nDaniel finds a glowing crystal skull identical to one first discovered by his grandfather decades before. When Daniel stares into the skull's eyes, a mysterious force makes him disappear. Now SG-1 must find Daniel's grandfather to unlock the mystery of the skull and bring Daniel back.\r\n\r\nGuide | Transcript | Wallpapers | Screencaps\r\n321eg.jpg\r\n3.22 &quot;Nemesis Part 1&quot;\r\nO'Neill is kidnapped by the Asgard and taken aboard a ship, where he encounters a swarm of metallic, buglike creatures on a mission to destroy Earth. O'Neill plans to blow up the ship and sacrifice himself, but can the Stargate team find another way to stop this apocalyptic scheme?","torrent":{"xt":"urn:btih:6c97f10a89e7fef302e43a5e8788127a2f44ff13","amp;dn":"Stargate+SG-1+-+Season+03+-+Episodes+12+thru+22","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c97f10a89e7fef302e43a5e8788127a2f44ff13","infoHashBuffer":{"type":"Buffer","data":[108,151,241,10,137,231,254,243,2,228,58,94,135,136,18,122,47,68,255,19]},"announce":[],"urlList":[]}}