{"title":"Star Trek - The Next Generation - Season 1","uid":13848657,"size":10659309751,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:76a62766e7442c74b16de40c63d1684bb1922a19&amp;dn=Star+Trek+-+The+Next+Generation+-+Season+1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"POtHS11","files":30,"time":1457901897,"description":"Star Trek - The Next Generation - Season 1\r\n\r\n\r\nThe series follows the adventures of a space-faring crew on board the starship USS Enterprise (NCC-1701-D), the fifth Federation vessel to bear the name and registry and the seventh starship by that name. (See Starship Enterprise for other ships with the name and/or registry). The series is set about 70 years after the final mission of the original Enterprise crew under the command of James T. Kirk.[1] The Federation has undergone massive internal changes in its quest to explore and seek out new life, adding new degrees of complexity and controversy to its methods, especially those focused on the Prime Directive. The Klingon Empire and the United Federation of Planets have ceased wartime hostilities and become galactic allies, while more sinister foes such as the Romulans and the Borg take precedence on the series.\r\n\r\nThe Enterprise is commanded by Captain Jean-Luc Picard and is staffed by first officer Commander William Riker, second officer/operations manager Data, security chief Tasha Yar, ship's counselor Deanna Troi, chief medical officer Dr. Beverly Crusher, conn officer Lieutenant Geordi La Forge, and junior officer Lieutenant Worf. The death of Lieutenant Yar in the series' first season prompts an internal shuffle of personnel, making Worf official chief of security. Geordi La Forge is promoted to chief engineer at the beginning of season 2.\r\n\r\nThe series begins with the crew of the Enterprise-D put on trial by a nefarious, omnipotent being known as Q. The god-like entity threatens the extinction of mankind for being a race of savages, forcing them to solve a mystery at nearby Farpoint Station to prove their worthiness to be spared. After successfully solving the mystery and avoiding disaster, the crew officially departs on its mission to explore strange new worlds.\r\n\r\nSubsequent stories focus on the discovery of new life and sociological and political relationships with alien cultures, as well as exploring the human condition. Several new species are introduced as recurring antagonists, including the Ferengi, the Cardassians, and the Borg. Throughout their adventures, Picard and his crew are often forced to face and live with the consequences of difficult choices.\r\n\r\nThe series ended in its seventh season with a two-part episode &quot;All Good Things...&quot;, which brought the events of the series full circle to the original confrontation with Q. An interstellar anomaly that threatens all life in the universe forces Picard to leap from his present, past, and future to combat the threat. Picard was successfully able to show to Q that humanity could think outside of the confines of perception and theorize on new possibilities while still being prepared to sacrifice themselves for the sake of the greater good. The series ended with the crew of the Enterprise portrayed as feeling more like a family and paved the way for four consecutive motion pictures that continued the theme and mission of the series","torrent":{"xt":"urn:btih:76a62766e7442c74b16de40c63d1684bb1922a19","amp;dn":"Star+Trek+-+The+Next+Generation+-+Season+1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76a62766e7442c74b16de40c63d1684bb1922a19","infoHashBuffer":{"type":"Buffer","data":[118,166,39,102,231,68,44,116,177,109,228,12,99,209,104,75,177,146,42,25]},"announce":[],"urlList":[]}}