{"title":"Femina - 25 March 2016 (gnv64)","uid":13864244,"size":23902088,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7a226445533b0dd94094453898b6f433c57dd63d&amp;dn=Femina+-+25+March+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gnv65","files":5,"time":1458057460,"description":"Femina - 25 March 2016\r\nEnglish | 80 pages | True PDF | 22.5 mb \nhttp://www.femina.in/\r\n\r\nThe story of Femina, reads much like the story of the Indian woman.\r\nFor over 50 years now, Femina, India's first and largest read women's English magazine has long been the definitive life and lifestyle guide for progressive woman.\r\nIn this brave new age of the multi-faceted, multitasking woman, Femina still remains the referral point for women who are expanding their roles, and exploring new frontiers. And continues to talk to forward- thinking women on issues that matter most to them. Periodicity: Fortnightly\r\n\r\nALL ABOUT YOU\r\n28 Love THE END. NOW WHAT? We help you find closure\r\n29 Love DON’T GET WEBBED Want a healthy love life? Avoid these social media pitfalls\r\n31 Passion BIG O, BIG NO? Pregnancy doesn’t have to mean the end of your sex life. Our experts dispel the myths\r\n33 Passion EROTICA, THE READ A well-written sex scene can get much more than your imagination fired up. Here is our bedtime reading list\r\n34 Relationships I LIKE HIM, I LOVE HIM NOT? Can’t decide whether he’s the one? We prepare a checklist to\r\nhelp you decide\r\n35 Celeb cheat sheet GET A MAKEOVER LIKE KARISMA KAPOOR She’s ditched the fuzzy eyebrows for a sleek new\r\navatar. Here’s our cheat sheet to help you channel her transformation\r\n36 Money HOW TO SHOP SAFE ONLINE It’s never been more important to learn how to secure your e-transactions\r\n37 Career ARE YOU BURNING OUT AT WORK? Identify the symptoms and check if it’s time to slow down the pace\r\n\r\nFASHION\r\n40 Front row ORANGE YOU GLAD This summer is going to be sunny\r\n41 Front row GET IN LINE Skinny and fat, horizontal or vertical, just make sure you stay in line\r\n42 Front row WHAT LIES BENEATH Sex up your wardrobe\r\n43 Accessories TWILIGHT HOUR These cocktail-ready stilettos come loaded with the powers of seduction\r\n44 Fashion TRENDING All the latest news, views and buzz in fashion\r\n45 Debut MEET THE RINGMASTERS Get a peek at the workings of zesty new label, The Circus\r\n47 Conversation THE MAN WITH A PLAN He’s a regular at Paris Fashion Week with roots in Uttar Pradesh. Meet designer Rahul Mishra\r\n\r\nBEAUTY\r\n52 Masterclass GET THE LOOK Makeup artist Flavia Giuliodori’s guide to working orange makeup\r\n54 Trial-a-trend STAY STRONG Define yourself with sharp contouring, a loud pout and bold brows\r\n55 Makeup mantra BE THE UNDER-DOLL Take your cue from Alia Bhatt for the best brunch look\r\n56 Nail edit COAT DECODE That final layer of polish will strengthen, revive and add shine to your nails\r\n58 Beauty documentary HAIR APPARENT We flew to Berlin to bring you the future of hair care and colour from Wella’s latest International TrendVision\r\n61 Beauty blast MISSION POSSIBLE: ZEROBUDGET BEAUTY These at-home natural remedies are quick, easy and light on the wallet\r\n65 Fitness bulletin WANT ARMS LIKE MICHELLE OBAMA’S? Get sculpted arms with these five exercises\r\n\r\nREALITY\r\n68 Cover girl EVER THE QUEEN As scion of the Kapoor family and with a career spanning over 15 years, it’s no wonder that Kareena Kapoor Khan is as confident offscreen as she is on screen\r\n72 On my own PROPHECIES IN THE LAB After two years of trying, Anu Acharya finally founded the path-breaking MapMyGenome project in 2013. She says women entrepreneurs need to be willing to take more risks\r\n74 Man we love ‘I LOVE TO EXPERIMENT’ Actor Rajkummar Rao is concocting his own recipe for success in Bollywood\r\n\r\nTHIS JUST IN\r\n76 5 questions with… PRACHI DESAI The actor talks about her bond with Farhan Akhtar and buying her own home\r\n77 Trend tracker ENTER SUPERWOMAN Just throw it over your shoulder and you’re ready to go. That’s why celebs are loving the new cape\r\n78 Insider REEL ESTATE INVESTMENT These young celebs are raking it in and their first investment is a dream home\r\n80 The buzzmakers JOSHNA CHINAPPA ON A WINNING SPREE A free-wheeling WhatsApp chat with the 29-year-old squash champ\r\n\r\nIN EVERY ISSUE\r\n2 EDITOR’S LETTER\r\n3 TOMBSTONE\r\n6 INBOX\r\n57 BEAUTY MANDATE\r\n \nhttp://s8.postimg.org/fr9xkinol/Femina_25_March_2016a.jpg","torrent":{"xt":"urn:btih:7a226445533b0dd94094453898b6f433c57dd63d","amp;dn":"Femina+-+25+March+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a226445533b0dd94094453898b6f433c57dd63d","infoHashBuffer":{"type":"Buffer","data":[122,34,100,69,83,59,13,217,64,148,69,56,152,182,244,51,197,125,214,61]},"announce":[],"urlList":[]}}