{"title":"Teachings of Arnaud Desjardins (Meditation.Zen)","uid":13675860,"size":6346972708,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:7c2a71dfcd3b1b1b51d2fce991050ffc0e5fcc19&amp;dn=Teachings+of+Arnaud+Desjardins+%28Meditation.Zen%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"asperge","files":21,"time":1456403020,"description":"In October, 2007, Arnaud Desjardins arrived at the Sat Loka ashram in Bozeman, Montana. His purpose was to deliver the teachings on non-duality that he had received from his guru, Swami Prajnanpad, and which have formed the basis for his own work with students for over thirty years. To effectively communicate the foundation of this teaching, Arnaud had said, would require ten days of teaching.\r\n\r\nThe teachings in this collection are a record of the talks and dialogues that occurred over those ten remarkable days. They represent the fruits of a lifetime of spiritual exploration, discovery, and realization. Throughout, Arnaud demonstrates an outlook on Advaita Vedanta (the classical Indian tradition of non-dualism) that is completely unique: an earthy, pragmatic, life-affirming approach to &quot;being one with&quot; that does not reject the relative in its focus on the absolute. Encompassing everything from the importance of psychological healing to the highest possibilities of human realization, and enlivened by intimate stories from his own spiritual process, Arnaud offers a perspective on ancient spiritual wisdom that is striking in its clarity, rigor, and sense of possibility.\r\n\r\n\r\nArnaud Desjardins, one of the most highly regarded Western spiritual teachers, was born in Paris in 1925. In the 1960's he became well known as a director and producer for French television, making a series of acclaimed documentaries on spiritual teachers from India, Tibet, Afghanistan, and Japan. These films helped bring authentic Eastern spiritual traditions to a wide audience in France for the first time. In 1965 he met his Teacher, Swami Prajnanpad, who subsequently instructed Arnaud to begin teaching and to found his own ashram. Since 1974 Arnaud has been the leader of his own spiritual community and an active proponent of dialogue between teachers in a wide variety of spiritual traditions. This is the first time he has offered in-depth teachings in English","torrent":{"xt":"urn:btih:7c2a71dfcd3b1b1b51d2fce991050ffc0e5fcc19","amp;dn":"Teachings+of+Arnaud+Desjardins+%28Meditation.Zen%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c2a71dfcd3b1b1b51d2fce991050ffc0e5fcc19","infoHashBuffer":{"type":"Buffer","data":[124,42,113,223,205,59,27,27,81,210,252,233,145,5,15,252,14,95,204,25]},"announce":[],"urlList":[]}}