{"title":"testee","uid":13581665,"size":16284,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:7dc8b300b46d03cd43f6300e596d6cdd4fe96e7b&amp;dn=testee&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rrrr14","files":1,"time":1455751578,"description":"pple CEO Tim Cook speaks in Milan, Italy, on Nov. 15. Cook has vowed to fight a court order compelling the tech company to help the FBI defeat security measures on a phone belonging to the San Bernardino shooters. (Luca Bruno / Associated Press)\r\nTracey Lien, James Queally, Brian Bennett, Paresh Dave and Richard WintonContact Reporters\r\n \r\nCybersecurity experts warned Wednesday that the battle over a court order requiring Apple to help the FBI access encrypted data on a cellphone belonging to the couple who killed 14 people in San Bernardino will have far-reaching consequences for the tech industry.\r\n\r\nThe dispute, the latest chapter in a long-brewing battle between Silicon Valley and Washington, D.C., over the tech industry's role in combating terror plots, will now shift from a philosophical disagreement to a very real courthouse fight after Apple said it would not comply with the order.\r\n\r\nIn an open letter published early Wednesday morning, Apple Inc. CEO Tim Cook vowed to fight the directive issued earlier this week and said the FBI's call for the company to help defeat security measures on a phone belonging to Syed Rizwan Farook would be a major blow to customer privacy.\r\n\r\nSee more of our top stories on&gt;&gt;","torrent":{"xt":"urn:btih:7dc8b300b46d03cd43f6300e596d6cdd4fe96e7b","amp;dn":"testee","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dc8b300b46d03cd43f6300e596d6cdd4fe96e7b","infoHashBuffer":{"type":"Buffer","data":[125,200,179,0,180,109,3,205,67,246,48,14,89,109,108,221,79,233,110,123]},"announce":[],"urlList":[]}}