{"title":"Stargate SG-1 - Season 01 - Episodes 12 thru 22","uid":14089821,"size":5803260296,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7f95f4e74a459429d0b1c68142fdbc5df8d6baf7&amp;dn=Stargate+SG-1+-+Season+01+-+Episodes+12+thru+22&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":38,"time":1459291131,"description":"Guide | Transcript\r\n111eg.jpg\r\n1.12 &quot;Bloodlines&quot;\r\nWith the proviso that they bring back a Goa'uld larva for study, Teal'c returns with the SG-1 team to Chulak to stop the Goa'uld from enslaving his son Ry'ac. After a difficult reunion with Drey'auc, the wife he abandoned, Teal'c discovers that his son is dying. He needs the healing properties of a larval Goa'uld and the only one available is Teal'c's own.\r\n\r\nGuide | Transcript\r\n112eg.jpg\r\n1.13 &quot;Fire And Water&quot;\r\nThe SG-1 team is transported to Oannes, a planet of opposites, the home of the sole survivor on an ancient aquatic race. Teal'c, Jack and Carter return to Earth shell-shocked at their loss of Daniel Jackson. The grieving team members are confused, unable to let go of Daniel. Can they discover their true memories in time to rescue Daniel?\r\n\r\nGuide | Transcript\r\n113eg.jpg\r\n1.14 &quot;Hathor&quot;\r\nThe evil and beautiful Goa'uld Hathor escapes from stasis in a Mayan pyramid in Mexico. At the Stargate facility, she uses her charms and a powerful drug to seduce men into her service as she plots to take over the world. With Daniel as her Beloved Pharaoh and Jack her intended First Prime, can Carter and the female personnel stop her in time?\r\n\r\nGuide | Transcript\r\n114eg.jpg\r\n1.15 &quot;Singularity&quot;\r\nSam Carter returns with the sole survivor of a planetary plague—a little girl, Cassandra. As they become attached, Carter, Dr. Fraiser and Daniel discover the girl's terrible secret—a time-bomb implanted by the Goa'uld Nirrti to destroy the Stargate on Earth. Can Carter save Cassandra or will she share her fate?\r\n\r\nGuide | Transcript\r\n115eg.jpg\r\n1.16 &quot;Cor-ai&quot;\r\nO'Neill and the team travel to Cartago, where Teal'c is recognized as once having been First Prime to Apophis, who 'harvested' hosts from this world many times. His guilt already decided, Teal'c is arrested for the murder of Hanno's father and put on trial for his life. While Jack and Carter attempt to get help from the SGC, Daniel battles Hanno in Cor-Ai.\r\n\r\nGuide | Transcript\r\n116eg.jpg\r\n1.17 &quot;Enigma&quot;\r\nThe SG-1 team rescues a group of highly developed survivors from the cataclysmic planet of Tollan. To stop the legendary knowledge of the Tollan people from falling into the wrong hands, O'Neill and his team stake all on the cross-universal rescue.\r\n\r\nGuide | Transcript\r\n117eg.jpg\r\n1.18 &quot;Solitudes&quot;\r\nFollowing a Stargate technical defect, O'Neill and Carter find themselves stranded on an icy wasteland. O'Neill is severely wounded, both are freezing to death, and nobody can find the section of the universe in which they are stranded.\r\n\r\nGuide | Transcript\r\n118eg.jpg\r\n1.19 &quot;Tin Man&quot;\r\nUpon landing on Planet PX3-989, the mysterious alien Harlan renders the SG-1 team unconscious. After waking and returning to the SGC, they find that their spirits and minds have been transferred into the bodies of androids. Their energy literally failing, the team must return to Harlan in a bid to reunite body and soul.\r\n\r\nGuide | Transcript\r\n119eg.jpg\r\n1.20 &quot;There But For The Grace Of God&quot;\r\nA mysterious mirror transports Daniel Jackson to another dimension. Suddenly he finds himself on an alternate Earth under attack from the Goa'uld, his place at the SGC filled by Catherine Langford and Dr. Sam Carter. Daniel foresees that the same fate awaits Earth in his reality. Can he return home in time to save the world?\r\n\r\nGuide | Transcript\r\n120eg.jpg\r\n1.21 &quot;Politics&quot;\r\nOnly Daniel Jackson knows of the Goa'uld plans to invade Earth. Despite the injury he sustained in escaping the other reality, no one takes his warnings seriously, not even Jack and his friends on SG-1. The adversarial Senator Kinsey has chosen to terminate the costly Stargate Program and close the gate forever just as Earth faces its worst threat.\r\n\r\nGuide | Transcript\r\n121eg.jpg\r\n1.22 &quot;Within The Serpent's Grasp Part 1&quot;\r\nConvinced at last by Daniel to take the threat seriously, Jack leads SG-1 into disobeying orders as they gate off-world to the coordinates Daniel brought back from the alternate reality. The team find themselves amidst preparations by Apophis and Klorel for an all-out strike on Earth. Can they avert disaster and save Earth?","torrent":{"xt":"urn:btih:7f95f4e74a459429d0b1c68142fdbc5df8d6baf7","amp;dn":"Stargate+SG-1+-+Season+01+-+Episodes+12+thru+22","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f95f4e74a459429d0b1c68142fdbc5df8d6baf7","infoHashBuffer":{"type":"Buffer","data":[127,149,244,231,74,69,148,41,208,177,198,129,66,253,188,93,248,214,186,247]},"announce":[],"urlList":[]}}