{"title":"[Girls Way] 16.03.24 Vegas Sins Part Two - Dahlia Sky, Syren De","uid":14055131,"size":1930825794,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:8040694411ea41ad3af280480ead8381bf2d86e9&amp;dn=%5BGirls+Way%5D+16.03.24+Vegas+Sins+Part+Two+-+Dahlia+Sky%2C+Syren+De+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"distinc","files":2,"time":1459107991,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=2066132566\r\n \nhttp://imagedisco.net/?g=7352221166\r\n\r\n\r\n\r\nDescription:\r\n\r\nDahlia wakes naked and bound, slowly taking a moment to realize what has just happened. As a naive housewife from out of town, she is just getting a taste of what the real world is sometimes like. She remembers her evening with Cadence Lux, going great, and it making her dream of what lesbian sex could really be. But then it's all black. But we saw her knocked out by Syren De Mer, the owner of the escort service Dahlia contacted. Syren swoops in to inform Dahlia that she's demanded a ransom for Dahlia's safe return to her wife, who's coffers runneth over.\r\n\r\nIf Reena doesn't pay up, Syren is going to keep Dahlia to be her pretty little bitch. Syren's dominant sexual aura is already wrapped around Dahlia. Dahlia agrees to do whatever Syren wants in order to be released without Syren talking to Reena. Dahlia gets to work taking Syren's oily nipples into her mouth as she moans on her giant milf tits. Syren unties Dahlia, as they have a deal. Syren's job, getting Dahlia to work on her juicy pussy is underway, Syren instructs Dahlia to keep her ass int he air, and to lick her exactly how she'd want to be licked. Dahlia soon has Syren screaming in pleasure, with her fingers deep inside the MILF boss Dahlia eats out Syren from beneath, almost making Syren see stars","torrent":{"xt":"urn:btih:8040694411ea41ad3af280480ead8381bf2d86e9","amp;dn":"%5BGirls+Way%5D+16.03.24+Vegas+Sins+Part+Two+-+Dahlia+Sky%2C+Syren+De+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8040694411ea41ad3af280480ead8381bf2d86e9","infoHashBuffer":{"type":"Buffer","data":[128,64,105,68,17,234,65,173,58,242,128,72,14,173,131,129,191,45,134,233]},"announce":[],"urlList":[]}}