{"title":"PetiteBallerinasFucked - Angel Piaff, Candee Licious 02 Mar 2016","uid":13732926,"size":411078355,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:80f68ba635e285695e79e3f47c9db878a3f4253f&amp;dn=PetiteBallerinasFucked+-+Angel+Piaff%2C+Candee+Licious+02+Mar+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ImgSnaps","files":1,"time":1457028102,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/yPf\r\n \nhttp://imgsnaps.com/image/yPI\r\n \nhttp://imgsnaps.com/image/yP5\r\n\r\nCandee Licious and Angel Piaff are practicing their dance routine by doing everything in tandem, including rubbing their horny pussies and tits beneath their leotards. Itâ™s no surprise when the two girls start peeling off each otherâ™s clothes between kisses as they attempt to relieve some of the sexual tension! When their dance instructor Max Dior catches them in the act, they invite him to join them in their sexcapades by pulling off his pants and delivering a double blowjob that leaves him hard as hell and wanting more. Getting down on their hands and knees, Angel and Candee present their creamy bald pussies to be sampled and then fucked by Max. He chooses to sink his cock into Angelâ™s snatch, but puts his hand to work rubbing and fingering Candeeâ™s twat to keep the blonde from feeling left out. Besides, Candee gets the first crack at a stiffie ride when Max lays down to let his two sex kittens take full advantage of him. Next the girls arrange themselves so that Angel can get her pussy pounded while also eating Candee out. Once Angel has reached her climax, Candee gets her snatch stuffed one more time as Max works her towards the big O that she craves. Candeeâ™s climax is just what Max needs to bring him off as well. Pulling out at the last moment, he covers Candeeâ™s belly in his cum while Angel helps to make sure every last drop has been milked from Maxâ™s hardon","torrent":{"xt":"urn:btih:80f68ba635e285695e79e3f47c9db878a3f4253f","amp;dn":"PetiteBallerinasFucked+-+Angel+Piaff%2C+Candee+Licious+02+Mar+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80f68ba635e285695e79e3f47c9db878a3f4253f","infoHashBuffer":{"type":"Buffer","data":[128,246,139,166,53,226,133,105,94,121,227,244,124,157,184,120,163,244,37,63]},"announce":[],"urlList":[]}}