{"title":"TrickySpa ~ Cadence Lux NEW (The Pop Star Sex-Tape / Fantasy Mas","uid":13581021,"size":225354397,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:814f0592afee5d9590019b6fc777542e170591ba&amp;dn=TrickySpa+%7E+Cadence+Lux+NEW+%28The+Pop+Star+Sex-Tape+%2F+Fantasy+Mas&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ImgSnaps","files":1,"time":1455743229,"description":"TrickySpa ~ Cadence Lux NEW (The Pop Star Sex-Tape / Fantasy Massage / 17 February 2016) 544p NEW\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/image/kDN\r\n \nhttp://imgsnaps.com/image/kDT\r\n \nhttp://imgsnaps.com/image/kDb\r\n \nhttp://imgsnaps.com/image/kDc\r\n\r\nSteven St. Croix here and today I'm in for a special cock sucking treat. Innocent and naive client Cadence Lux is my newest patient. She came in with some back pain. Her small boobs and long blonde hair turn me on and I cant wait to have my cock drenched in her mouth. Cadence comes clean admitting she is somewhat of a celebrity, bragging about how cool she is that she's still a virgin. Cadence admits she fantasizes about sucking cock a lot but her manager insists she stays a virgin to help her image. Having her turn over, I focused on massaging her boobs, and lured her into thinking that I am totally on her side, keeping her virginity a secret. I suggest that since I have no reason to spill her secrets to the press, I can be the one that takes her virginity and she can finally know what it's like to get pounded by a hard cock. It didn't take long before I seduced the innocent pop-star. I remove her panties and start licking her fresh pussy making her orgasm. It was my turn to have my cock sucked, and she deep throated and gagged on it, all the way down to my balls. I grabbed the virgin, spread her legs and slowly inserted my hard cock in her tight pussy, fucking her faster and faster, unable to keep myself from cumming all over her stomach!\r\nCategories Oil, Pussy Licking, Blonde, Body Massage, Blowjob, Deepthroat, Hardcore, Foot Massage, Natural Tits, Rimming, Massage","torrent":{"xt":"urn:btih:814f0592afee5d9590019b6fc777542e170591ba","amp;dn":"TrickySpa+%7E+Cadence+Lux+NEW+%28The+Pop+Star+Sex-Tape+%2F+Fantasy+Mas","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"814f0592afee5d9590019b6fc777542e170591ba","infoHashBuffer":{"type":"Buffer","data":[129,79,5,146,175,238,93,149,144,1,155,111,199,119,84,46,23,5,145,186]},"announce":[],"urlList":[]}}