{"title":"Les Boxtrolls MULTI BluRay 1080p 2014","uid":13604937,"size":5869050810,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:825df95cd2c1cfb824571ac95b974b59f609f8ff&amp;dn=Les+Boxtrolls+MULTI+BluRay+1080p+2014&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"annuaireweb","files":1,"time":1455882249,"description":"The.Boxtrolls.2014.MULTi.WiTH.TRUEFRENCH.1080p.BluRay.x264-LOST\r\n\r\nLes Boxtrolls est une fable qui se déroule à Cheesebridge, une ville huppée de l’époque victorienne, dont la principale préoccupation est le luxe, la distinction et la crème des fromages les plus puants. Sous le charme de ses rues pavées, se cachent les Boxtrolls, d’horribles monstres qui rampent hors des égouts la nuit pour dérober ce que les habitants ont de plus cher : leurs enfants et leurs fromages. C’est du moins la légende à laquelle les gens de Cheesebridge ont toujours cru. En réalité les Boxtrolls sont une communauté souterraine d’adorables et attachantes créatures excentriques qui portent des cartons recyclés comme les tortues leurs carapaces. Les Boxtrolls ont élevé depuis le berceau un petit humain orphelin OEuf, comme l’un  des leurs, explorateur de décharge et collectionneur de détritus mécaniques. Ils deviennent soudainement la cible d’un infâme dératiseur Archibald Trappenard qui voit dans sa disposition à éradiquer les trolls son ticket d’entrée au sein de la bonne société de Cheesebridge. La bande de bricoleurs au grand coeur doit alors se tourner vers celui dont ils ont adopté la responsabilité, ainsi qu’une jeune fi lle de la haute qui n’a pas froid aux yeux, Winnie afin de concilier leurs deux mondes, au gré des vents du changement... et du fromage","torrent":{"xt":"urn:btih:825df95cd2c1cfb824571ac95b974b59f609f8ff","amp;dn":"Les+Boxtrolls+MULTI+BluRay+1080p+2014","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"825df95cd2c1cfb824571ac95b974b59f609f8ff","infoHashBuffer":{"type":"Buffer","data":[130,93,249,92,210,193,207,184,36,87,26,201,91,151,75,89,246,9,248,255]},"announce":[],"urlList":[]}}