{"title":"Earths.Greatest.Spectacles--BBC-2016-w.subs-720p","uid":13610453,"size":3185832467,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:832f7cf84ee97e773f2c9bf1788d08456616d9c7&amp;dn=Earths.Greatest.Spectacles--BBC-2016-w.subs-720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"uggauga","files":6,"time":1455925277,"description":"\nEarth's Greatest Spectacles\r\n\r\nSet in three of the most seasonally changeable landscapes on earth - Svalbard, Okavango and New England - this series showcases the stunning transformations that occur each year, revealing the unique processes behind them and showing how wildlife has adapted to cope with the changes. Narrated by Domhnall Gleeson.\r\n\r\nBBC (2016) - 3 Episodes\r\n \nhttp://www.bbc.co.uk/programmes/b0702s77\r\n_______________________________________\r\n\r\n1280x720 resolution\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - enjoy !!\r\n_______________________________________\r\n\r\nNew England\r\nEarth's Greatest Spectacles Episode 1 of 3\r\nNew England is the stage for the most incredible colour change on earth, when the vivid greens of summer give way to the golds and reds of autumn. This film reveals how this vibrant fiesta is created by the battles between the trees and the forests' inhabitants. Moose, chipmunks, rattlesnakes and a bizarre mixture of caterpillars all play a crucial role, but surprisingly the forest itself was made so colourful thanks to a combination of hard work by beavers, ants and humans.\r\n\r\nSvalbard\r\nEarth's Greatest Spectacles Episode 2 of 3\r\nSvalbard in the Arctic spends many months of the year in complete darkness, an unrelenting frozen winter with temperatures down to -40 Celsius. But when the sun finally reappears, the landscape magically transforms from an ice world into a rich tundra, full of exotic plants, birds, arctic foxes, polar bears, walrus and reindeer. This film captures the changes in all their glory and reveals how this transformation is only possible thanks to some bizarre micro-organisms that feed on ice and the stunning abilities of migrating birds.\r\n\r\nOkavango\r\nEarth's Greatest Spectacles Episode 3 of 3\r\nThe Okavango Delta is one of the world's largest inland deltas - and supports a variety of life as rich as any you will see in Africa. Yet this lush wetland of islands and lagoons lies in the middle of the vast, featureless Kalahari Desert. This is the story of how it happens. Following groups of wildlife, including hippos, baboons, catfish, kingfishers, leopards, warthogs and elephants, the film reveals how the yearly flood transforms the landscape and impacts their lives. But more surprisingly, it reveals how, with the help of termites and hippos, the flood actually creates this extraordinary delta in the first place","torrent":{"xt":"urn:btih:832f7cf84ee97e773f2c9bf1788d08456616d9c7","amp;dn":"Earths.Greatest.Spectacles--BBC-2016-w.subs-720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"832f7cf84ee97e773f2c9bf1788d08456616d9c7","infoHashBuffer":{"type":"Buffer","data":[131,47,124,248,78,233,126,119,63,44,155,241,120,141,8,69,102,22,217,199]},"announce":[],"urlList":[]}}