{"title":"Osho_The Last Testament_Vol.2 #28_world-press -Sheela and her ga","uid":13886532,"size":597979596,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:849f0a2e268cf561d40ea8daa7802998d4b06613&amp;dn=Osho_The+Last+Testament_Vol.2+%2328_world-press+-Sheela+and+her+ga&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1458177530,"description":"An interview on 19 September 1985 pm in Sanai Grove, Rajneeshpuram US,\r\n\r\nOSHO WITH QUICK MAGAZINE, WEST GERMANY,\r\n \r\nit was straight but warm, friendly talk about Sheela and her gang;\r\nwhat they have done and and why Osho didn't know about this earlier.\r\n\r\nRead all text here:\n\r\nOsho_The Last Testament, Vol 2,Chapter #28 \r\n\r\nQ:* SOME OF THE QUESTIONS THAT I PLAN ASK YOU THIS EVENING MAY SEEM VERY HOSTILE TO YOU.\r\nA:* No.\r\nQ:* AND I DON'T WANT YOU OR THE COMMUNE TO FEEL THAT I'M BEING HOSTILE AT ALL.\r\nA:* No. Nobody can be hostile to me. Whatever you do, I never feel any hostility from any human being towards me. It is your work -- to be a journalist is a tough job.\r\nSo you be as harsh as you can. But remember that I am a tough guy too!\r\n.......................................\r\n(about Sheela)\r\nA:* ... She informed to Savita that she is leaving the country and she will leave her resignation to her and my authority letter for being my secretary, my power of attorney, but what actually happened, Savita also escaped with the group, so I know only the information. I never got any resignation in my hand.\r\n\r\nQ:* SO IS THERE AT THE COMMUNE HERE, A LETTER SIGNED BY SHEELA OR IS THERE NOT A LETTER SIGNED BY SHEELA?\r\n\r\nA:* That will have to be inquired.\r\n\r\nQ:* BECAUSE IF NOT, IT IS VERY POSSIBLE THAT SHEELA AND HER GANG WHO ARE NOW IN ZURICH COULD AND MAY HAVE ALREADY EMPTIED OUT YOUR BANK ACCOUNTS IN ZURICH.\r\n\r\nA:* They have done that. They have done that already.\r\nBut I am not an organization man, so you will have to ask the people -- Sheela's secretary perhaps has the letter of resignation and everything and they can be made available to you. But in Zurich Sheela has become incredibly criminal.\r\nShe married a Swiss sannyasin. She was already married to an American sannyasin here -- this is bigamy. And she married this Swiss sannyasin because he had the power to take the money out; the money belonged to the Swiss Zurich commune, so he had taken out the money....\r\nQ:* HM MM. DO WE KNOW HOW MUCH WAS TAKEN OUT?\r\nA:* No, because I don't have any connection with these things. I have never gone here to the office, I never look at their files, I never inquire -- that is not my business and not my interest.\r\n......................\r\nread all interview","torrent":{"xt":"urn:btih:849f0a2e268cf561d40ea8daa7802998d4b06613","amp;dn":"Osho_The+Last+Testament_Vol.2+%2328_world-press+-Sheela+and+her+ga","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"849f0a2e268cf561d40ea8daa7802998d4b06613","infoHashBuffer":{"type":"Buffer","data":[132,159,10,46,38,140,245,97,212,14,168,218,167,128,41,152,212,176,102,19]},"announce":[],"urlList":[]}}