{"title":"Straight A Student (Red Light District) 2004 split scenes","uid":14089118,"size":1286257213,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:8a513415ffa50069f327d1c64181efeba08df086&amp;dn=Straight+A+Student+%28Red+Light+District%29+2004+split+scenes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"distinc","files":6,"time":1459286214,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=8183162030\r\n \nhttp://imagedisco.net/?g=7601049496\r\n\r\n\r\n\r\nDescription:\r\n\r\nBody of Review: Red Light District is one of those gonzo production companies that excel at providing value and high end production aspects that their competition seem to fall short of much of the time. They tend to show the edgier types of sex, including those circus act sex acts that so many fans seem to enjoy (I'm not actually a big fan of that kind of thing myself). The latest release from the company is Straight A Student, a show that has a lot of anal sex with all the trimmings (so to speak). With all the usual energy and value, the DVD was full of what fans have asked for, including hotties like Bobbi Eden. If you hate plots, acting and the frills of feature porn and want the basic hardcore stuff RLD provides, read the following breakdown of the scenes, noting that the formula used was pretty basic in nature:\r\n\r\nScene One: Bobbi, the ultra hot looking blonde on the front DVD cover, started off the show by adjusting her school girl uniform. Her tease sequence was nearly enough to get me going all by itself. The way she oiled up her breasts was great and she soon took on Michael. They each did some oral action on one another and while he didn't go straight to her ass as the advertising suggests, I didn't mind one little bit. They did all the things you'd expect of them, including anal sex and an anal creampie (internal pop shot), but the feeding of his semen from her ass was a bit gross. Regardless of that fact, she was a doll here but a doll that had more chemistry and energy than any man could hope for. Whew!\r\n\r\nScene Two: Nikki, a brunette that was more of a girl next door than the babe she followed, discussed her sex life with David in the interview portion of the scene before she did the tease and masturbation sequence. She then did both Steve Holmes and Steve Hooper after some oral on both of them. While I didn't like the large blemishes on her legs, I think she gave a convincing performance as a neophyte wannabe who took a DP like a champion after some straight and anal. I didn't like the camera angle much this time since it left lots of shadows but aside from her taking an eyeshot, it looked like fun. The chemistry level here was weaker than the first scene but pretty strong for a beginner.\r\n\r\nScene Three: Jamie, a bleached blonde gal from the UK, claimed to be a major slut in school before her tease with David. After masturbating with some ATM action (her finger initially) and David's help, she had her scene with Michael and some uncredited guy (I'm sure I've seen him before but I'm not a mind reader-I recall seeing his large eagle tattoo on his right arm a few times). They were a bit rougher than average with her but she appeared to like this type of thing a lot. In any case, there was oral and some gagging action before the guys started hammering away at her ass before the DP began. Fans of DPs will want to know that there was a lot of that taking place here as well as some tasting of their cocks after penetration. The down side of the scene was that the guys did most of the work here, giving me the impression that she was just there for the money. In the end, they coated her face something fierce and she took one for the team in her eye.\r\n\r\nScene Four: Allison, a redhead with a ton of freckles and a lean body that will appeal to the guys desiring younger gals, adjusted her stockings (they all wore a school girl outfit in this one) before teasing the camera. I really didn't like her look all that much but some guys will probably worship the ground she walks on. After her tease session and masturbation sequence, she had her scene with Joel and Brett, two of the most well known porn studs these days. They had some oral and straight sex with a lot of anal and DP action. I wasn't keen on her cum swallowing after scooping it out of her ass (anal creampie) but fans of circus act sex will jump for joy at this one.\r\n\r\nScene Five: Roxy, a lean brunette following the same formula as the others, was not my favorite performer here. It was mostly based on her look and general demeanor (acting too young doesn't work for me) but Darren didn't mind one little bit. They did some oral before she took his large dick in her ass, screwing very fast and hard throughout the scene. There was some ATM and swallowing that took place here but again, she didn't turn me on so most of it was for naught. If you like younger gals that act really nasty, you'll enjoy her act but only if you don't look too closely.\r\n\r\nScene Six: Britney, a bleached blonde with that kind of slutty look a lot of porn fans enjoy, showed off her 19 year old body (great ass and breasts) to entice studly Michael and faggy Tony into doing her. They spanked her, spit on her and played really hard with her body, all of which she seemed to enjoy, before screwing her hard and wet. She did ATM, PTM and a double anal after some DP action. At the end, they jerked off into her mouth and she swallowed their loads handily. I didn't notice much energy or chemistry this time but she tried hard so she gets some credit.\r\n\r\nAllison Whyte, Bobbi Eden, Britney Madison, Jamie Brooks, Nikki Nite, Roxy Jezel","torrent":{"xt":"urn:btih:8a513415ffa50069f327d1c64181efeba08df086","amp;dn":"Straight+A+Student+%28Red+Light+District%29+2004+split+scenes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a513415ffa50069f327d1c64181efeba08df086","infoHashBuffer":{"type":"Buffer","data":[138,81,52,21,255,165,0,105,243,39,209,198,65,129,239,235,160,141,240,134]},"announce":[],"urlList":[]}}