{"title":"Fallout.4.Beta.Update.v1.5","uid":14087682,"size":2044488144,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8aa01238c3f81ad9874e65308a331b0743902634&amp;dn=Fallout.4.Beta.Update.v1.5&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mercs215","files":14,"time":1459273059,"description":"Install instructions:\r\nNote: Requires your game patched to v1.4.132 as this is not an AIO update!\r\n- Copy contents of the Update folder to your main game dir\r\n- Copy contents of the Crack folder to your main game dir\r\n- Play\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nChange log:\r\nNew Features \r\nNew Survival difficulty \r\nSurvival adds additional challenges including no fast travel, saving only when you sleep, increased lethality, diseases, fatigue, danger and more. \r\nCharacters set to Survival difficulty appear under their own Character Selection filter \r\nSurvival difficulty characters are not backward compatible with the 1.4 version of Fallout 4. If you opt out of the Beta, do not use Survival character saved games.\r\nFixes \r\nGeneral stability and performance improvements \r\nFixed rare crash related to reloading a save that relies on Automatron \r\nFixed issue with the robot workbench camera not moving properly immediately after canceling out of the menu \r\nFixed issue with perks being repeatedly added when reloading a saved game while in robot workbench \r\nFixed issue with Ada not properly traveling to an assigned settlement \r\nRobots can now be assigned as settlement vendors \r\nFixed issue with &quot;Appropriation&quot; where blueprints would not appear properly if the container had already been looted prior to getting the quest \r\nIn &quot;Nuclear Option,&quot; entering the Institute using the targeting helmet on Power Armor no longer inadvertently causes the player to go into combat, and become stuck in the Institute \r\nFixed distance check with Robotics Expert perk","torrent":{"xt":"urn:btih:8aa01238c3f81ad9874e65308a331b0743902634","amp;dn":"Fallout.4.Beta.Update.v1.5","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8aa01238c3f81ad9874e65308a331b0743902634","infoHashBuffer":{"type":"Buffer","data":[138,160,18,56,195,248,26,217,135,78,101,48,138,51,27,7,67,144,38,52]},"announce":[],"urlList":[]}}