{"title":"Lost - Seasons 5 and 6","uid":13744283,"size":8454524730,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:90d51a813f2588b7686bf7fa631712cf9c1a4eca&amp;dn=Lost+-+Seasons+5+and+6&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":48,"time":1457107110,"description":"Lost - Seasons 5 and 6\r\n\r\nSpoilers for the entirety of Lost: Season 6 follow. You've been warned!\r\n\r\nSeason 6 of Lost is quite possibly the most scrutinized season of television in history. With both longtime fans of the series and curious outsiders wondering if this season would deliver both on answers and a satisfying conclusion, series show runners Damon Lindelof and Carlton Cuse had an incredible task on their hands. With an edge-of-your-seat conclusion to Season 5, the small band of survivors we've grown to love set out on their final journey against a villainous shape shifter on an island of mystery.\r\n\r\nIn Season 4, &quot;The Constant&quot; established Lost as a science fiction series when it introduced time travel into the equation. From that point forward, until the conclusion of Season 5, the series maintained and expanded on that concept by sending the survivors hurtling through time until they eventually landed in 1974 (or 1977, for those on Ajira 316). Season 6 drops the time travel story completely and introduces a different sci-fi concept: alternate realities. It appears that the detonation of Jughead in &quot;The Incident&quot; created a parallel universe in which events played out slightly different and Oceanic Flight 815 never crashed.\r\n\r\nMuch like flash-backs and flash-forwards, we experience this parallel universe through a series of &quot;centric&quot; flash-sideways featuring the lives of these characters as if the crash had never happened. This gives Lindelof and Cuse a unique opportunity to reexamine the lives of these characters from a completely different perspective. One of the issues I had with Season 5 was that important character development took a backseat to science fiction. Those issues are corrected in Season 6, with the flash-sideways giving us incredibly important character moments and an intriguing new story that's both surprising and engaging.\r\n\r\nWith each &quot;centric&quot; flash-sideways story, parallels are drawn to the character's plight while they are on the island. This relationship between timelines establishes a key connection between both storylines that give the flash-sideways an importance outside of simply being a different perspective on how things could have ultimately played out. Connections between the two universes are explored more thoroughly as the series progresses and we do ultimately get a resolution to the flash-sideways storyline. How satisfying that resolution is will ultimately be based on a number of factors that stem from your own expectations. In other words, it's a polarizing conclusion to a very unique story and you're probably either going to love it or hate it. I loved the way the flash-sideways story ended because it satisfied my need for closure, but I can understand why there are those who weren't satisfied. The reveal that the flash-sideways has been taking place in a purgatory of sorts, of the characters' own design, is a surprising conclusion and some may feel that earlier events in the season don't do enough to establish these shocking final moments","torrent":{"xt":"urn:btih:90d51a813f2588b7686bf7fa631712cf9c1a4eca","amp;dn":"Lost+-+Seasons+5+and+6","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90d51a813f2588b7686bf7fa631712cf9c1a4eca","infoHashBuffer":{"type":"Buffer","data":[144,213,26,129,63,37,136,183,104,107,247,250,99,23,18,207,156,26,78,202]},"announce":[],"urlList":[]}}