{"title":"Square Wave - Mark de Silva","uid":13766254,"size":12824578,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9112112eef5d3fd05bd3cb171336beefcd935437&amp;dn=Square+Wave+-+Mark+de+Silva&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mr_mando","files":3,"time":1457241255,"description":"&quot;I don't know of anything like [Square Wave]. [Mark de Silva is] doing something that I think few people have dared to do. The book fascinated me... it is a book that I found quite exciting, it's a book that I would recommend to people who love to read novels and see what a novel can do when it steps off the beaten track. [Square Wave is] an intelligent climate-thriller... possibly leading to a new way of thinking about the novel, or thinking about how the novel can be meaningful. It was thrilling. I think it's really an interesting book and I'll be reading it again and again.&quot;\r\n—Michael Silverblatt, 'Bookworm' on KCRW\r\n\r\nSynopsis:\r\nCarl Stagg, a writer researching imperial power struggles in 17th century Sri Lanka, ekes out a living as a watchman in a factionalized America where confidence in democracy has eroded. Along his nightly patrol, Stagg finds a beaten prostitute, one in a series of monstrous attacks. Suspicious of his supervisor’s intentions, Stagg seeks the truth with a fellow part-time watchman, Ravan, who hails from a family developing storm-dispersal technologies jointly funded by the Indian and American governments.\r\n\r\nThe watchmen’s discoveries put a troubling complexion on Stagg’s research, giving it new shape and impetus, just as the weather modification project begins to appear less about dispersing storms than weaponizing them.\r\n\r\nBy gracefully weaving a study of the psychological effects of a militarized state upon its citizenry with topics as diverse as microtonal music and cloud physics, Square Wave signals the triumphant arrival of a young writer certain to be considered one of the most ambitious and intelligent of his generation","torrent":{"xt":"urn:btih:9112112eef5d3fd05bd3cb171336beefcd935437","amp;dn":"Square+Wave+-+Mark+de+Silva","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9112112eef5d3fd05bd3cb171336beefcd935437","infoHashBuffer":{"type":"Buffer","data":[145,18,17,46,239,93,63,208,91,211,203,23,19,54,190,239,205,147,84,55]},"announce":[],"urlList":[]}}