{"title":"Ed Greenwood - Band of Four Series 1 - 5","uid":14116155,"size":1906384756,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9180e7c79cd01c23b22d28e1c094a52890a1dae0&amp;dn=Ed+Greenwood+-+Band+of+Four+Series+1+-+5&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Horisarte","files":32,"time":1459416971,"description":"1. The Kingless Land (1999) \r\n\r\n(Narrated by: Nadia May)\r\nAglirta is known as the Kingless Land—once prosperous and peaceful, it has now fallen into lawlessness, studded with feuding baronies engaged in a constant state of war. The only hope for peace lies in the legend of the Sleeping King: destined to rise and restore peace when the Dwaerindim stones are recovered.Lady Embra Silvertree is the sorceress daughter of a bellicose baron with an eye towards world domination. She has been imprisoned by her father who hopes to use her as a magical battery to fortify his castle. When a pair of good natured rogues attempt to steal one of her jewel encrusted gowns, they are quickly enlisted as allies to help her escape and, with the aid of a shape-shifting cleric, to seek out the Dwaerindim.\r\n\r\n2. The Vacant Throne (2001) \r\n\r\n( Narrated by: Stuart Langston)\r\nAglirta is known as the Kingless Land. Once prosperous and peaceful, it has fallen into lawlessness, studded with feuding baronies engaged in a constant state of war . . . but the land is kingless no more. The legendary Sleeping King has been reawakened by the efforts of the valiant Band of Four:-Hawkril, a bold and brave warrior gifted with great strength and fortitude-Craer, the crafty and clever thief-Sarasper, the learned and wise healer-Lady Embra Silvertree, the mystical Lady of Jewels, a powerful sorceressWith the aid of the Dwaerindim Stones, the King's curse has been lifted . . . but it will take more than the Dwaerindim to restore him to the long vacant throne of the land. Ambitious and devious barons are ready to challenge him for the throne, while dark, inhuman forces wait for the chance to bring Aglirta under its evil shadow. The Band of Four must quest for a powerful secret that will restore the kingdom to its former glory.\r\n\r\n3. A Dragon's Ascension (2002) \r\n\r\n(Narrated by: Simon Vance)\r\nAglirta is known as the Kingless Land. Once a prosperous and peaceful river valley, it has fallen into lawlessness, and its feuding baronies are engaged in a constant state of war. But the land is kingless no more, for the Sleeping King of legend, King Kelgrael, has been reawakened by the efforts of the valiant Band of Four: - Hawkril, a bold and brave warrior gifted with great strength and fortitude- Craer, the crafty and clever thief- Sarasper, the learned and wise healer and last but not least- Lady Embra Silvertree, the mystical Lady of Jewels, a powerful sorceressYet peace has not returned. In The Kingless Land, high magic and wizard kings stood in the way, while in The Vacant Throne, civil wars and backstabbing barons resisted the restoration of order. Now, a powerful warlord comes to the front to take control through military might, while the diabolic minions of the Serpent move into position for a climactic battle that will scar the Band of Four forever.\r\n\r\n4. The Dragon's Doom (2003) \r\n\r\n(Narrated by: Simon Vance)\r\nThe Serpent is vanquished, and the Dragon is dead ...but has the endless strife that kept Aglirta a Kingless Land finally ended? Hawkril the mighty warrior, Embra the beautiful sorceress, and Craer the crafty thief mourn their lost companion, but now must forge new alliances in their role as overdukes of Aglirta, a land that has been torn asunder by double-crossing royals, savage warlords, and sinister high priests.Now the kingdom is threatened by a mystical berserker plague that is promoting anarchy among the citizenry while serpentine acolytes move in the shadows to try and resurrect a new Serpent.Will a new dragon rise to vanquish it, and if so, who will it be, and can it avoid the fate of its predecessor?The fate of Aglirta lies in balance in the triumphant conclusion of this cycle of Band of Four novels! \r\n\r\n5. The Silent House (2004) \r\n\r\n(Narrated by: Simon Vance) \r\nThe Silvertree Stronghold is more than just the family estate of the feared and awed Silvertree dynasty whose wizardly powers and political cunning has survived through many generations. But with their power comes a curse. A curse more terrifying than rival warlords or the mystical threats of the dreaded faceless — an inward corruption of the soul that binds one's power to a downward spiral of madness and magic. The Stronghold goes by the name of The Silent House. It is a soul repository for this dynasty. Two daring treasure hunters hope to profit from unlocking the secrets of its past and harvesting the powers of its bounty ¿ but unbeknownst to them an observer watches their every move, and waits to make his presence known from the halls of eternity.The Silent House is a Chronicle of Aglirta, the multigenerational tale of a powerful and feared wizardly dynasty.\r\n \nhttps://www.goodreads.com/author/show/20513.Ed_Greenwood","torrent":{"xt":"urn:btih:9180e7c79cd01c23b22d28e1c094a52890a1dae0","amp;dn":"Ed+Greenwood+-+Band+of+Four+Series+1+-+5","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9180e7c79cd01c23b22d28e1c094a52890a1dae0","infoHashBuffer":{"type":"Buffer","data":[145,128,231,199,156,208,28,35,178,45,40,225,192,148,165,40,144,161,218,224]},"announce":[],"urlList":[]}}