{"title":"The Inner Circle by Brad Meltzer (2011).epub Gooner","uid":13623858,"size":1620057,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92f75572d57f5bba14e41eb400674718678b5d44&amp;dn=The+Inner+Circle+by+Brad+Meltzer+%282011%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1455994311,"description":"The Inner Circle by Brad Meltzer (2011).epub Gooner\r\n\r\nPublisher: Grand Central Publishing; First Edition edition (January 11, 2011)\r\nLanguage: English\r\nISBN-10: 0446577898\r\nISBN-13: 978-0446577892\r\n\r\n&quot;There are stories no one knows. Hidden stories. I love those stories. And since I work in the National Archives, I find those stories for a living.&quot;\r\n\r\nBeecher White, a young archivist, spends his days working with the most important documents of the U.S. government. He has always been the keeper of other people's stories, never a part of the story himself...Until now.\r\n\r\nWhen Clementine Kaye, Beecher's first childhood crush, shows up at the National Archives asking for his help tracking down her long-lost father, Beecher tries to impress her by showing her the secret vault where the President of the United States privately reviews classified documents. After they accidentally happen upon a priceless artifact - a 200 hundred-year-old dictionary that once belonged to George Washington, hidden underneath a desk chair, Beecher and Clementine find themselves suddenly entangled in a web of deception, conspiracy, and murder.\r\n\r\nSoon a man is dead, and Beecher is on the run as he races to learn the truth behind this mysterious national treasure. His search will lead him to discover a coded and ingenious puzzle that conceals a disturbing secret from the founding of our nation. It is a secret, Beecher soon discovers, that some believe is worth killing for.\r\n\r\nGripping, fast-paced, and filled with the fascinating historical detail for which he is famous, The Inner Circle is a thrilling novel that once again proves Brad Meltzer as a brilliant author writing at the height of his craft","torrent":{"xt":"urn:btih:92f75572d57f5bba14e41eb400674718678b5d44","amp;dn":"The+Inner+Circle+by+Brad+Meltzer+%282011%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92f75572d57f5bba14e41eb400674718678b5d44","infoHashBuffer":{"type":"Buffer","data":[146,247,85,114,213,127,91,186,20,228,30,180,0,103,71,24,103,139,93,68]},"announce":[],"urlList":[]}}