{"title":"The Gate of Firmament-FLT","uid":13721729,"size":25889117636,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9771295c48a44dacefbd416cad976ff95eca7337&amp;dn=The+Gate+of+Firmament-FLT&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pirata","files":3,"time":1456948627,"description":"\n\n    In Their 29th Year of Glory, FairLight Released #1111\n     \n    (c) DOMO Studio\n     \n    : Supplied by: FAIRLIGHT : : Release Date: 01/03/2016 :\n    Cracked by: FAIRLIGHT Game Type: RPG\n    Packaged by: FAIRLIGHT Image Format: ISO\n     \n    DISCS: 1 Protection: Steam\n     \n    System Requirements : Nobody knows!\n     \n    Game information:\n     \n    In ancient times long ago, in order to find his beloved missing daughter\n    the divine Jade Emperor opened the gates of heaven, allowing a direct\n    connection between heaven and earth. This was done, so that worthy mortals\n    could appeal to the Jade Emperor and obtain divine powers, to aid in the\n    search of his missing daughter. However, this gift was exploited and taken\n    advantage of, causing chaos in the mortal realm. The Nine Li Tribe became\n    a cult that worshipped demons and practiced in the occult, divorcing\n    themselves from the businesses of the mortal realm\n     \n    Forces of evil suddenly arose, inciting wars across the continent\n    condemning people into a life of fears and sufferings\n    Emperor Zhuanxu feared the demon Chiyou would once again ravage the mortal\n    realm. Limited by his own capabilities, he sought the help of the Queen of\n    Huaxu, who once assisted Xuanyuan the Yellow Emperor in warding off the\n    Otherworld with the Bell of Donghuang. Both Fuxi and Nuwa the children of\n    the Queen of Huaxu also supported Emperor Zhuanxu in convincing the Queen\n    for they too could not bear to watch people suffer any longer. In the end\n    the gates to heaven were finally sealed with the powers of the Divine\n    Artifacts combined\n     \n    Since then, no mortals were able to ascend, nor were gods able to descend\n    at will. This incident was later recorded down in history as &quot;Juedi\n    Tiantong.&quot;\n     \n    Features:\n     \n    * This latest entry broke new grounds in comparison with previous\n    titles in the series, including: the new lighting system that\n    better establishes moods, creating various atmospheric scenes; as\n    well as facial animation and lip-sync systems, MVN motion capture\n    system to elevate the quality standard of all characters in every\n    aspect. These new technologies not only improve visuals but also\n    game immersion, enabling the players to fully comprehend the\n    behaviors and feelings of the protagonists\n    * The battle system has been replaced with a real-time\n    encounter-based gameplay mechanism, making the battles more\n    intense than ever. Improved returning features exclusive to the\n    Xuan-Yuan Sword series include: the Urn of Spirit Infusion that\n    enables demon-synthesis and equipment refinement; the Guardian\n    System that allows your captured demons to fight on your side;\n    and the Miracle System that grants additional attack buffs. A new\n    &quot;Battle Formation&quot; system is also introduced in this latest\n    entry, allowing for a richer and better gaming experience for the\n    players\n     \n    Installation Information:\n     \n    * Burn or mount\n    * Install\n    * Play the game\n     \n    NOTE: As usual, block the game exe in your firewall\n     \n    /TEAM FAiRLIGHT\n     \n    QUALITY, TRADITION AND PRIDE","torrent":{"xt":"urn:btih:9771295c48a44dacefbd416cad976ff95eca7337","amp;dn":"The+Gate+of+Firmament-FLT","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9771295c48a44dacefbd416cad976ff95eca7337","infoHashBuffer":{"type":"Buffer","data":[151,113,41,92,72,164,77,172,239,189,65,108,173,151,111,249,94,202,115,55]},"announce":[],"urlList":[]}}