{"title":"Attack On Titan Ovas","uid":13743488,"size":910243360,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:9850293faf8b2efa040ab9f6569064b7a25d776f&amp;dn=Attack+On+Titan+Ovas&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kailer24","files":3,"time":1457099525,"description":"O autor da série, Hajime Isayama, primeiro escreveu uma versão one-shot de 65 páginas em 2006.[10] Originalmente, ele ofereceu seu trabalho ao departamento da Weekly Shonen Jump, da editora Shueisha, onde ele foi avisado a modificar seu estilo e história para ser mais adequado a Jump. Ele recusou e decidiu levar seu trabalho ao departamento da Weekly Shonen Magazine da Kodansha.[11] Antes da serialização começar em 2009, ele já havia pensado em reviravoltas, embora elas sejam concretizadas enquanto a série progride. O autor inicialmente baseou o cenário do mangá na sua cidade, que é cercada por montanhas.[12] Quando criou a aparência dos Titãs, ele usou como modelo lutadores de artes marciais mistas: Yushin Okami para a forma Titã de Eren Yeager e Brock Lesnar para o Titã Encouraçado.[13] [14] George Wada, produtor do anime, afirmou que os muros da série também foram influenciados pela natureza isolada e fechada da cultura Japonesa.[15] E também que os sentimentos de cada individuo é uma das maiores influências.[16]\r\n\r\nIsayama estima seu tempo mensal em uma semana para trabalhar na história e duas para de fato desenhar o capítulo. A história é planejada com antecedência, até marcando quais volumes terá uma especifica &quot;revelação&quot;.[17] Em setembro de 2013, ele afirmou que planeja terminar a série em 20 volumes.[18] Originalmente, Isayama planejou dar a série uma conclusão trágica similar a O Nevoeiro de Stephen King, onde cada personagem morre. No entanto, a resposta positiva para o mangá e o anime causou o autor a considerar mudar o final devido ao impacto que poderia causar aos fãs","torrent":{"xt":"urn:btih:9850293faf8b2efa040ab9f6569064b7a25d776f","amp;dn":"Attack+On+Titan+Ovas","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9850293faf8b2efa040ab9f6569064b7a25d776f","infoHashBuffer":{"type":"Buffer","data":[152,80,41,63,175,139,46,250,4,10,185,246,86,144,100,183,162,93,119,111]},"announce":[],"urlList":[]}}