{"title":"An Introduction to Aqueous Electrolyte Solutions","uid":13930729,"size":3273868,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9990370126122eaa7f786d538f4460348db43974&amp;dn=An+Introduction+to+Aqueous+Electrolyte+Solutions&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1458419039,"description":"ISBN 978-0-470-84293-5\r\n\r\n&quot;An Introduction to Aqueous Electrolyte Solutions&quot; is a comprehensive coverage of solution equilibria and properties of aqueous ionic solutions. Acid/base equilibria, ion pairing, complex formation, solubilities, reversible emf's and experimental conductance studies are all illustrated by many worked examples. Theories of non-ideality leading to expressions for activity coefficients, conductance theories and investigations of solvation are described; great care being taken to provide detailed verbal clarification of the key concepts of these theories. The theoretical development focuses on the physical aspects, with the mathematical development being fully explained. An overview of the thermodynamic background is given.\r\n\r\nEach chapter includes intended learning outcomes and worked problems and examples to encourage student understanding of this multidisciplinary subject.\r\n\r\nAn invaluable text for students taking courses in chemistry and chemical engineering. This book will also be useful for biology, biochemistry and biophysics students who may be required to study electrochemistry as part of their course. A comprehensive introduction to the behaviour and properties of aqueous ionic solutions, including clear explanation and development of key concepts and theories Clear, student friendly style clarifying complex aspects which students find difficult Key developments in concepts and theory explained in a descriptive manner to encourage student understanding Includes worked problems and examples throughout","torrent":{"xt":"urn:btih:9990370126122eaa7f786d538f4460348db43974","amp;dn":"An+Introduction+to+Aqueous+Electrolyte+Solutions","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9990370126122eaa7f786d538f4460348db43974","infoHashBuffer":{"type":"Buffer","data":[153,144,55,1,38,18,46,170,127,120,109,83,143,68,96,52,141,180,57,116]},"announce":[],"urlList":[]}}