{"title":"7 Days to Die Alpha 14 64bit","uid":14068838,"size":1490093547,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:99c9d763a174a9b1c5e9f8ec9261d4edb1db2a8b&amp;dn=7+Days+to+Die+Alpha+14+64bit&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"dauphong","files":1,"time":1459146530,"description":"Building on survivalist and horror themes, players in 7 Days to Die can scavenge the abandoned cities of the buildable and destructible voxel world for supplies or explore the wilderness to gather raw materials to build their own tools, weapons, traps, fortifications and shelters. In coming updates these features will be expanded upon with even more depth and a wider variety of choices to survive the increasing dangers of the world. Play alone or with friends, run your own server or join others.\r\n\r\n7 Days to Die development was launched following a successful Kickstarter campaign in August 2013, demonstrating the initial prototype. Joining us in early access now will help support the cause and ensure continued expansion of the development team, their efforts and the planning and addition of even more features and depth eagerly awaited by fans.\r\n\r\nMany of our fans have commented in these early stages that they feel we are building the survivalzombie game they have always wanted. Our goal is to live up to this as much as we can and build a customizable, moddable game that allows users to fine tune their survival and zombie experience to create the experience players and their friends want","torrent":{"xt":"urn:btih:99c9d763a174a9b1c5e9f8ec9261d4edb1db2a8b","amp;dn":"7+Days+to+Die+Alpha+14+64bit","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99c9d763a174a9b1c5e9f8ec9261d4edb1db2a8b","infoHashBuffer":{"type":"Buffer","data":[153,201,215,99,161,116,169,177,197,233,248,236,146,97,212,237,177,219,42,139]},"announce":[],"urlList":[]}}