{"title":"Cyber Knights Elite 2.9.31","uid":13832251,"size":25447418,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:99d7829792df6a7c7689c802189f7a0a35d468c2&amp;dn=Cyber+Knights+Elite+2.9.31&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tiropitaki","files":1,"time":1457740047,"description":"Elite edition adds 3 unique Cyber Knights, 50+ weapons, and 20+ armors, 30+ cybernetic implants.\r\n\r\nCyber Knights is a turn-based tactical RPG in which you control a squad of runners and soldiers who are completing illegal contracts for the various powers that fight for control over the cities. Explore a massive persistent world with 10 battling factions, more than 600 contacts and citizens, over 500 shops, more than 400 battle combinations and danger lurking at every turn.\r\n\r\nLead a deadly team of skilled and cybered mercenaries to fight, hack, and infiltrate in the shadows of 2217. As a Cyber Knight you are the elite but expendable urban soldier in the silent wars of a cyberpunk future. You do the dirty work of megacorporations, criminal organizations and street gangs.\r\n\r\nStory\r\nIt is the dawn of 2217, and the world has ended. Megacorporations provide humanity’s last survivors shelter in the vast dome cities of New Boston, New Berlin and others. Across the planet the Global Matrix has reunited the scattered survivors and reignited the fires of competition.\r\n\r\nTechnology has changed humanity. No longer merely flesh, many Cyber Knights have turned to nano- and cyber- technology to gain an edge and extend their abilities beyond human limits.\r\n\r\nA global arms race has begun between the remaining megacorporations. Technological domination and control of the remaining metroplex are the only things that matter now.\r\nIn this cold war conflict the soldiers are called Cyber Knights. Elite urban mercenaries they are expendable, deniable and effective. The megacorporations need them to do the dirty work in the grey shadows of the metroplex. \r\n\r\nYou will control of a skilled team of mercenary cyber-warriors. Use turn-based tactics combat to deploy skills, equipment and cybernetic implants for maximum effect. Specialize your team members in stealth, combat or hacking skills. Dominate the megacorporate landscape with strategy, infiltration, battle prowess or be a digital ghost.\r\n\r\nFeatures\r\n8 unique skills, 5 character classes, 400 different items, weapons and armor. Customized your leader and teams with 65 different cybernetic improvements. Pick sides in this urban battle and play as Hacker, Gun Slinger, Sniper, Cyber Sword or the fearsome AgentEX!\r\n\r\nAs a Knight, you'll encounter:\r\n* 140 Weapons\r\n* 45 Armors\r\n* 100 Matrix Hosts\r\n* 60 Cybernetic Implants\r\n* 600 NPC Contacts\r\n* 55 Monsters\r\n* 400 Monster Teams\r\n\r\nWhat's new:\r\n- Fixed bug preventing use of items\r\n- Fixed issue with Hunds dying and not appearing in kennels - lost hunds are back\r\n- Fixed issue with dismissed Hunds not appearing in kennels - lost hunds are back\r\n- Fixed reported crashes\r\n\r\nRequires Android OS 1.6 and up","torrent":{"xt":"urn:btih:99d7829792df6a7c7689c802189f7a0a35d468c2","amp;dn":"Cyber+Knights+Elite+2.9.31","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99d7829792df6a7c7689c802189f7a0a35d468c2","infoHashBuffer":{"type":"Buffer","data":[153,215,130,151,146,223,106,124,118,137,200,2,24,159,122,10,53,212,104,194]},"announce":[],"urlList":[]}}