{"title":"Justified - Season 6 of 6","uid":13811454,"size":6710019075,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9b6502ba4803d9c1257f203081baca59378d7d65&amp;dn=Justified+-+Season+6+of+6&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":25,"time":1457619796,"description":"Justified - Season 6 of 6\r\n\r\nThe sixth and final season of the American television drama series Justified premiered on January 20, 2015, on FX, and concluded on April 14, 2015, consisting of 13 episodes.[1] The series was developed by Graham Yost based on Elmore Leonard's novels Pronto and Riding the Rap and his short story &quot;Fire in the Hole&quot;.[2] Its main character is Raylan Givens, a deputy U.S. Marshal. Timothy Olyphant portrays Givens, a tough federal lawman, enforcing his own brand of justice in his Kentucky hometown.[2] The series is set in the city of Lexington, Kentucky, and the hill country of eastern Kentucky, specifically in and around Harlan.[3] The sixth season was released on DVD and Blu-ray in region 1 on June 2, 2015.[4]\r\n\r\n\r\nSeason 6\r\nFate's Right Hand\r\nS6, Ep1\r\n20 Jan. 2015\r\nFate's Right Hand\r\nRaylan turns to Dewey Crowe to help make a new federal case against Boyd Crowder, but he is not interested. Meanwhile, Boyd begins launching new plans that will take him beyond Harlan.\r\n \r\nCash Game\r\nS6, Ep2\r\n27 Jan. 2015\r\nCash Game\r\nRaylan sets out to find out more about the mysterious group buying up land in Harlan, Boyd tries to make a profit off the ledger from the bank heist, and Ava is stuck in the middle of everything.\r\n \r\nNoblesse Oblige\r\nS6, Ep3\r\n3 Feb. 2015\r\nNoblesse Oblige\r\nBoyd makes the uncomfortable discovery that the man he is trying to rob is very dangerous, and Raylan tries to put the squeeze on Boyd's explosives supplier.\r\n \r\nThe Trash and the Snake\r\nS6, Ep4\r\n10 Feb. 2015\r\nThe Trash and the Snake\r\nRaylan and Boyd separately find out why Avery Markham is buying up all the land in Harlan, as well as the consequences if you don't cooperate. Meanwhile, Katherine Hale pays an unexpected visit to Ava.\r\n \r\nSounding\r\nS6, Ep5\r\n17 Feb. 2015\r\nSounding\r\nAva tries to find a way to escape from everything, Boyd decides to stay in Harlan and compete with Avery Markham, and Katherine Hale and Wynn Duffy come up with a plan to see if Ava is an informant.\r\n \r\nAlive Day\r\nS6, Ep6\r\n24 Feb. 2015\r\nAlive Day\r\nBoyd finds a way to keep tabs on Ava while he works in the mine with Ava's Uncle Zachariah, And Ty orders a reluctant Choo-Choo to tie up loose ends after he kills Calhoun Schreier.\r\n \r\nThe Hunt\r\nS6, Ep7\r\n3 Mar. 2015\r\nThe Hunt\r\nRaylan takes a break from the case to take a visit from Winona and their daughter, Boyd takes Ava to his cabin to confront her about her loyalty, and Ty is on the run without any help after the shootout with the marshals.\r\n \r\nDark as a Dungeon\r\nS6, Ep8\r\n10 Mar. 2015\r\nDark as a Dungeon\r\nRaylan begins to break his ties to Harlan as he pursues a new lead and makes a new alliance to take down Boyd. Meanwhile, a desperate Ty comes to Boyd and Ava with a proposition.\r\n \r\nBurned\r\nS6, Ep9\r\n17 Mar. 2015\r\nBurned\r\nWith Ava burned as an informant, Raylan turns to the informant who got Katherine Hale's husband killed to bring down Boyd, who suddenly gets an unexpected ally in the fight against Avery Markham.\r\n \r\nTrust\r\nS6, Ep10\r\n24 Mar. 2015\r\nTrust\r\nWith Avery Markham and Wynn Duffy's help, Raylan sets up a trap for Boyd. But Ava informs Raylan that he didn't take the bait and offers up a new route to put Boyd away for good.\r\n \r\nFugitive Number One\r\nS6, Ep11\r\n31 Mar. 2015\r\nFugitive Number One\r\nRaylan goes after Ava after she shoots Boyd and steals the ten million dollars, but Art calls him off the chase. Meanwhile, Avery sets out to kill Boyd, and Katherine sets out to kill Wynn.\r\n \r\nCollateral\r\nS6, Ep12\r\n7 Apr. 2015\r\nCollateral\r\nRaylan and Boyd head for the mountains to find Ava, whose plan to escape with Uncle Zachariah has hit a dead end. But will Avery Markham get to her first?\r\n \r\nThe Promise\r\nS6, Ep13\r\n14 Apr. 2015\r\nThe Promise\r\nRaylan is captured by the authorities, but Art reluctantly lets him go and puts him back on the case. Avery gets to Ava and questions her about his missing money, but she winds up leading Boyd straight to them","torrent":{"xt":"urn:btih:9b6502ba4803d9c1257f203081baca59378d7d65","amp;dn":"Justified+-+Season+6+of+6","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b6502ba4803d9c1257f203081baca59378d7d65","infoHashBuffer":{"type":"Buffer","data":[155,101,2,186,72,3,217,193,37,127,32,48,129,186,202,89,55,141,125,101]},"announce":[],"urlList":[]}}