{"title":"Windows Firewall Control 4.6.2.4 + Activator","uid":13782386,"size":326552,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9ce82bc9e4deccf43d9d4117922724b0eaea1ffc&amp;dn=Windows+Firewall+Control+4.6.2.4+%2B+Activator&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rubberboy37","files":1,"time":1457343523,"description":"Windows Firewall Control is a tool that provides fast access to the Windows Firewall settings and enhances functionality by letting you manage networking rules for each application. It mainly caters to experienced users, such as Network Administrators.\r\n\r\n\r\n\r\nQuick access from the tray icon\r\n\r\nOnce intialized, the app created an icon in the system tray area and allows you to select the security profile, ranging from no filtering (turns of Windows Firewall) to high filtering mode (blocks all inbound and outbound connections).\r\n\r\n\r\n\r\nThorough management of application connections\r\n\r\nWhen it comes to rules management, you can allow or deny access to any application, disable, delete it from the list or create a duplicatwe. The list shows names, groups, programs, locations, statuses, actions, directoins, locate and remote ports, remote addresses, protocols and services.\r\n\r\n\r\n\r\nPopulate permission lists with custom apps\r\n\r\nIt is possible to sort items by statusd or direction (inbound, outbound, all, user-created), use a search function, view recently blocked programs, as wel as switch to a simplified viewing mode for enabling and disabling program access, as well as for adding a new app to the list.\r\n\r\n\r\n\r\nRich settings to work with\r\n\r\nWindows Firewall Control features a control panel where you can make additional tweaks. You can integrade the tool into the Explorer Context menu, set it to autorun at startup, sisable other programs from adding Firewall rules, activate global hotkeys for the control panel and rules management area, adjust the frame's hue, import and export rules as wel as access some Windows tools (Firewall with Advanced SAecurity, Command Prompt, Evernt Viewer, Resource Monitor, Windows Registry ect.).\r\n\r\n\r\n\r\nTo end with\r\n\r\nAll in asll, the application has a fair reaction speed and work very smoothly, without causing any problems to the OS. It quickly applies rule changes. Windows Firewall Control is and excellent utility for a better control over your Windows Firewall options from Microsoft, especially when it comes to setting up rules for each program.\r\n\r\n\r\n\r\nChangelog ((06.03.2016):\r\n\r\n- Improved: There are updaters which use a .tmp file to update their installations. From WFC is now possible to create Firewall rules for *.tmp files\r\n\r\n\r\n- Improved: The update dialog which is displayed when a new version of WFC is available can't be moved and if the taskbar is set to auto hidde, the dialog displayed out of the screen. The update dialog can be moved now by the user\r\n\r\n\r\nImproved: The autorized groups list height is not fixed anymore and will expand with the window size so that the user can see more entries in the list\r\n\r\n\r\n- Improved: Added support for &quot;@&quot; keywordf in the authorized groups, if this keyword is added as an authorized group name, Windows 10 rules with @{} names will not be deleted anymore by the Secure Rules feature\r\n\r\n\r\nFixed: Setting the direction to &quot;Outbound and Inbound&quot; when editing a the details of a new rule in the notification dialog does not create the inboundf\r\n rule","torrent":{"xt":"urn:btih:9ce82bc9e4deccf43d9d4117922724b0eaea1ffc","amp;dn":"Windows+Firewall+Control+4.6.2.4+%2B+Activator","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ce82bc9e4deccf43d9d4117922724b0eaea1ffc","infoHashBuffer":{"type":"Buffer","data":[156,232,43,201,228,222,204,244,61,157,65,23,146,39,36,176,234,234,31,252]},"announce":[],"urlList":[]}}