{"title":"Dream Team (2013).epub Gooner","uid":13690191,"size":6216511,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d61dca8dd46a574918e5ebb776a6cb19a4dfacc&amp;dn=Dream+Team+%282013%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1456602739,"description":"Dream Team - How Michael, Magic, Larry, Charles and the Greatest Team of All Time Conquered the World and Changed the Game of Basketball Forever (2013).epub Gooner\r\n\r\nPublisher: Ballantine Books Inc.; Reprint edition (20 May 2013)\r\nLanguage: English\r\nISBN-10: 0345520491\r\nISBN-13: 978-0345520494\r\n\r\ncclaimed sports journalist Jack McCallum delivers the untold story of the greatest team ever assembled: the 1992 U.S. Olympic Men’s Basketball Team. As a writer for Sports Illustrated, McCallum enjoyed a courtside seat for the most exciting basketball spectacle on earth, covering the Dream Team from its inception to the gold medal ceremony in Barcelona. Drawing on fresh interviews with the players, McCallum provides the definitive account of the Dream Team phenomenon. He offers a behind-the-scenes look at the controversial selection process. He takes us inside the team’s Olympic suites for late-night card games and bull sessions where superstars like Michael Jordan, Magic Johnson, and Larry Bird debated the finer points of basketball. And he narrates a riveting account of the legendary intrasquad scrimmage that pitted the Dream Teamers against one another in what may have been the greatest pickup game in history. In the twenty years since the Dream Team first captivated the world, its mystique has only grown. Dream Team vividly re-creates the moment when a once-in-a-millennium group of athletes came together and changed the future of sports—one perfectly executed fast break at a time","torrent":{"xt":"urn:btih:9d61dca8dd46a574918e5ebb776a6cb19a4dfacc","amp;dn":"Dream+Team+%282013%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d61dca8dd46a574918e5ebb776a6cb19a4dfacc","infoHashBuffer":{"type":"Buffer","data":[157,97,220,168,221,70,165,116,145,142,94,187,119,106,108,177,154,77,250,204]},"announce":[],"urlList":[]}}