{"title":"Rigmar Radio Karaoke RE SEED Request Letter M 8 Final Torrent","uid":13782576,"size":2978520670,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9d7b5fd1e51e4f263733515877e32c4318fe8342&amp;dn=Rigmar+Radio+Karaoke+RE+SEED+Request+Letter+M+8+Final+Torrent&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"rigmar_radio","files":980,"time":1457345719,"description":"OK Gang a very large torrent with 491 songs this time as I want to close this off and that is the last of the Letter M AND the Rigmar Radio 2015 Karaoke collection until the end of 2016 when of course I will do this all over again.\r\n\r\nI have been seeding this collection since October of 2015 and it is time I moved on and did something else, and perhaps used my precious upload speed for my own stuff for a change.   So on the KAT site I will be deleting all these torrent and on my local computer the original data files to get back the disc drive space.\r\n\r\nOn the Pirate Bay of course you can not delete your torrents so it is up to the community here if they sink or swim, but I will be taking no more re seed request.\r\n\r\nI hope you enjoyed this collection, for next year it will be bigger and better will all the letters having been given a makeover and the Karaoke label info added to all titles where possible.\r\n\r\nMy next torrents will be promoting the 2016 Eurovision Song Contest and the first volume of that will be up in the Music Video section real soon.\r\n\r\nRigmar Radio - Seeding to the World since 2004","torrent":{"xt":"urn:btih:9d7b5fd1e51e4f263733515877e32c4318fe8342","amp;dn":"Rigmar+Radio+Karaoke+RE+SEED+Request+Letter+M+8+Final+Torrent","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d7b5fd1e51e4f263733515877e32c4318fe8342","infoHashBuffer":{"type":"Buffer","data":[157,123,95,209,229,30,79,38,55,51,81,88,119,227,44,67,24,254,131,66]},"announce":[],"urlList":[]}}