{"title":"Black Sails - Season 2 - E 6 thru 10","uid":13684013,"size":5797986187,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9d8165b03bf27a51e648ba3c7087b40c4c85134a&amp;dn=Black+Sails+-+Season+2+-+E+6+thru+10&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":18,"time":1456532728,"description":"Description\r\nBlack Sails - Season 1 - E 5 thru 8\r\n\r\nDescription\r\n\r\n\r\nBlack Sails spared no expense for its twentieth chapter, taking Flint and his devoted crew into the heart of a brutal ship-wrecking tempest. All to avoid capture by Hornigold, with the added tension of Flint's crew actually having been offered full pardons for their crimes, but riding into the storm anyhow because of Flint's sweeping speech of madness. One that Silver even soon regretted getting caught under the spell of.\r\n\r\nWe've seen sea battles, land battles, and sea-to-land conflict, but this was Sails' first big experience with destructive weather. And it was pretty damn impressive. Watching Flint sacrifice his own men, in that particular regretful-yet-cold manner that we know only he can project. But then also watching him tie himself to the wheel of the ship during the most dangerous part of the journey while his crew took shelter below deck. So there was a lot of give and take here. And seeing Billy react to things helped layer the process even more given what Flint once did to him.\r\n\r\nSails' has had several non-essential characters come and go, but - damn - a good death is a good death. Muldoon's tragic drowning was very effective. From him expressing his gratitude toward Silver, on behalf of himself and the entire crew, to his hopefulness in the face of an agonizing demise, the entire bit with him and Silver down below was very well done. In particular, the way that it worked to craft and shape Silver. A character who's already so changed and altered from who he was at the start of the series.\r\n\r\nAnd now that the ship is lost at sea, with no water and very little food, it'll be time to see how everyone holds up. How quickly the crew's allegiance to Flint will crumble. Or, to that end, the loyalty of Billy and Silver. Rough times lie ahead and I have no real idea how anyone's getting back to Nassau. Or what Flint's haunting dreams mean. The ones of Miranda, the abandoned cabin, the mystery hatch, and the dark figure. I think I could make out her lips saying &quot;Help us&quot; and &quot;Come with me,&quot; but I'm just guessing","torrent":{"xt":"urn:btih:9d8165b03bf27a51e648ba3c7087b40c4c85134a","amp;dn":"Black+Sails+-+Season+2+-+E+6+thru+10","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d8165b03bf27a51e648ba3c7087b40c4c85134a","infoHashBuffer":{"type":"Buffer","data":[157,129,101,176,59,242,122,81,230,72,186,60,112,135,180,12,76,133,19,74]},"announce":[],"urlList":[]}}