{"title":"CCleaner 5.15.5513 AIO + Serial","uid":13660518,"size":6816986,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9e119586a8d65488ea00ac0cb69ae6f498fa0576&amp;dn=CCleaner+5.15.5513+AIO+%2B+Serial&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rubberboy37","files":1,"time":1456239070,"description":"Your computer is not only at risk from being infectem by malicious software, residues left after uninstalling appl;ications and so-called junk files can significantly reduce performance. However, performing perodic scans and cleaning can keep your PC in good shape. One of the applications that can aid in this situation is CCleaner, equipped with all tools needed to scrub every bit of your computer. \r\n\r\n\r\n\r\n\r\nCleverly organized interface \r\n\r\n\r\nLauncing the application brings up a cleverly simple interface, intuitive enough to let anyone instantly accommodate. Major functions are stored in tabs found in a side panel, an upper part constantly displays system info, while the rest of the space is dedicated to actual options you get to handle. \r\n\r\n\r\n\r\nEasily get rid of junk files \r\n\r\n\r\nThe &quot;Cleaner&quot; feature helps you get rid of various files that are no longer of use or take up disk space for no further reason. Two tabs let you select either Windows features or specific applications, each with it's own list of areas to be cleaned. Amongst others you are able to select recent documents, auto-complete history, saved passwords, cookies or even old Windows installations. \r\n\r\n\r\n\r\n\r\nYou can simply analize an area to see what needs cleaning so that you don't accidentally remove any important files. The scan process, as well as the scrubbing is done incredibly fast, with post-process details displayed. \r\n\r\n\r\n\r\n\r\nHave broken registries fixed \r\n\r\n\r\nFurthermore, you are also able to fix registry issues with the help of a dedicated tool. Simularly to the cleaner, there are several selectable areas, such as missing shared DLL's, ActiveX and Class Issues, obsolete software, start menu ordering or Windows services. \r\n\r\n\r\n\r\nMultiple tools to work with \r\n\r\n\r\nThe application's usability does not end here, because more tools are available under the homonimous tab. ASn integrated uninstaller let's you safely remove applications so that they leave no traces, starup items can also be deleted, as well as browser add-ons or extensions and even context menu processes. \r\n\r\n\r\n\r\nWhat's more, system restore points can be viewed in a list, with the popssibility to have them removed for a little extra space or comfort. Last but not least, you can choose to wipe an entire drive, be it internal or removable, with the possibility to select either free space or whole drive, as well as the security level. \r\n\r\n\r\n\r\n\r\nChanges in v5.13.5460 (26 Jan 2016):\r\n\r\n- Updated Google Chrome cleaning: Cache, Sesion amnd History\r\n- Improved Firefox Cookie detection\r\n- Added Disk Analizer search feedback\r\n- Improved System and Browser Monitoring (Professional Edition only)\r\n- Improved Media Player Classic cleaning\r\n- Minor GUI improvements\r\n- Minior bug fixes\r\n\r\n\r\n\r\nPLEASE,DON'T HIT AND RUN! KEEP THIS TORRENT ALIVE!!!","torrent":{"xt":"urn:btih:9e119586a8d65488ea00ac0cb69ae6f498fa0576","amp;dn":"CCleaner+5.15.5513+AIO+%2B+Serial","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e119586a8d65488ea00ac0cb69ae6f498fa0576","infoHashBuffer":{"type":"Buffer","data":[158,17,149,134,168,214,84,136,234,0,172,12,182,154,230,244,152,250,5,118]},"announce":[],"urlList":[]}}