{"title":"Warehouse 13 - Season 4 - Episodes 1 thru 6","uid":13977597,"size":6379418699,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9ebbf473c6491c33afb8b021b82d4e22d93d008b&amp;dn=Warehouse+13+-+Season+4+-+Episodes+1+thru+6&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":24,"time":1458660887,"description":"Season 4\r\nA New Hope\r\nS4, Ep1\r\n23 Jul. 2012\r\nA New Hope\r\nWarehouse 13 has been destroyed, Pandora's Box has been opened, and quite possibly the only hope left in the world lies in the use of a dangerous, evil artifact with the ability to turn back time.\r\n \r\nAn Evil Within\r\nS4, Ep2\r\n30 Jul. 2012\r\nAn Evil Within\r\nPete and Myka investigate a mysterious case where mobs of angry people are hallucinating en masse and attacking innocents.\r\n \r\nPersonal Effects\r\nS4, Ep3\r\n6 Aug. 2012\r\nPersonal Effects\r\nIt's all hands on deck to prevent a small town from being wiped off the map when a box full of Artifacts is accidently unleashed there.\r\n \r\nThere's Always a Downside\r\nS4, Ep4\r\n13 Aug. 2012\r\nThere's Always a Downside\r\nPete and Claudia reunite with Warehouse alum Hugo (Rene Auberjonois) to track down a deadly artifact at his nephew's prep school, while Myka and Steve investigate an Artifact that is killing an up and coming musician (Sam Huntington) in New Orleans.\r\n \r\nNo Pain No Gain\r\nS4, Ep5\r\n20 Aug. 2012\r\nNo Pain No Gain\r\nPete and Myka investigate a hockey player who seems to be miraculously and instantly recovering from serious game injuries, while Claudia is invited to a mysterious lunch by Mrs. Frederic. Elsewhere, Artie and Steve discover someone has been stealing artifacts from inside the Warehouse.\r\n \r\nFractures\r\nS4, Ep6\r\n27 Aug. 2012\r\nFractures\r\nSomeone has stolen Lewis Carroll's Mirror from inside the Warehouse allowing the psychotic and murderous spirit of Alice Liddell to escape again. Our team must stop her killing spree before one of them ends up dead.\r\n \r\nEndless Wonder\r\nS4, Ep7\r\n10 Sep. 2012\r\nEndless Wonder\r\nGet caught up on the mysteries of Warehouse 13, with this irreverent look at the series' story so far.\r\n \r\nSecond Chance\r\nS4, Ep8\r\n17 Sep. 2012\r\nSecond Chance\r\nPete and Myka investigate the case of people literally rusting away in a West Virginia mill town. Steve and Claudia visit his hometown in New Jersey in a bid to end his dependence on the Metronome.\r\n \r\nThe Ones You Love\r\nS4, Ep9\r\n24 Sep. 2012\r\nThe Ones You Love\r\nPete, Myka, and Claudia each travel to save a loved one who has fallen victim to an artifact, Mrs. Frederic and Steve head to the Vatican to investigate the Brotherhood, and Artie has an impossible showdown with Brother Adrian.\r\n \r\nWe All Fall Down\r\nS4, Ep10\r\n1 Oct. 2012\r\nWe All Fall Down\r\nHis personality split after using the Astrolabe, Artie embarks on a scheme to release a deadly virus that could wipe out half the world's population.\r\n \r\nThe Living and the Dead\r\nS4, Ep11\r\n29 Apr. 2013\r\nThe Living and the Dead\r\nFollowing the orchid's release in Germany, Pete and Myka must race to stop a global plague before it kills half the world's population.\r\n \r\nParks and Rehabilitation\r\nS4, Ep12\r\n6 May 2013\r\nParks and Rehabilitation\r\nPete and Claudia travel to Oregon to investigate a series of earthquake-related accidents occurring in a National Park.\r\n \r\nThe Big Snag\r\nS4, Ep13\r\n10 Apr. 2014\r\nThe Big Snag\r\nIn a special, black and white noir episode, Pete and Myka are transported into an unfinished 1940s crime novel.\r\n \r\nThe Sky's the Limit\r\nS4, Ep14\r\n20 May 2013\r\nThe Sky's the Limit\r\nArtie is blindsided when Mrs. Frederic introduces him to Abigail Chow, the new B&amp;B manager - with ulterior motives.\r\n \r\nInstinct\r\nS4, Ep15\r\n3 Jun. 2013\r\nInstinct\r\nH.G. Wells returns to help Pete and Myka with an artifact that's forcing confessions out of criminals all while earthquakes are beginning to shake the Warehouse.\r\n \r\nRunaway\r\nS4, Ep16\r\n10 Jun. 2013\r\nRunaway\r\nWhen a volcanic event at an Arkansas State Prison allows two inmates to escape, Pete, Myka and Steve must partner with a U.S. Marshal to track down the fugitives.\r\n \r\nWhat Matters Most\r\nS4, Ep17\r\n17 Jun. 2013\r\nWhat Matters Most\r\nWhen residents of a posh gated community start getting affected by a mysterious, versatile artifact, Myka and Pete investigate.\r\n \r\nLost &amp; Found\r\nS4, Ep18\r\n24 Jun. 2013\r\nLost &amp; Found\r\nThe Warehouse team uncovers a lead on a cache of artifacts stolen from Warehouse 12 by the infamous pirate, Roaring Dan Seavey.\r\n \r\nAll the Time in the World\r\nS4, Ep19\r\n1 Jul. 2013\r\nAll the Time in the World\r\nThe team tracks an evil alchemist who has bronzed Claudia and stolen the only artifact that can reverse the process. The clock is ticking as Claudia's condition apparently affects both Mrs. Frederic and the Warehouse.\r\n \r\nThe Truth Hurts\r\nS4, Ep20\r\n8 Jul. 2013\r\nThe Truth Hurts\r\nThe evil alchemist Paracelsus is on the run, and Pete and Myka must stop him before he achieves immortality - or something worse. Myka fights what appears to be a losing battle against cancer, while Steve learns Artie's been keeping life-altering information from","torrent":{"xt":"urn:btih:9ebbf473c6491c33afb8b021b82d4e22d93d008b","amp;dn":"Warehouse+13+-+Season+4+-+Episodes+1+thru+6","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ebbf473c6491c33afb8b021b82d4e22d93d008b","infoHashBuffer":{"type":"Buffer","data":[158,187,244,115,198,73,28,51,175,184,176,33,184,45,78,34,217,61,0,139]},"announce":[],"urlList":[]}}