{"title":"Call Of Duty 4: Modern Warfare","uid":13840697,"size":6767511552,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a1bdab1685903ed027c1e76e78f82a15920b3855&amp;dn=Call+Of+Duty+4%3A+Modern+Warfare&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jp_tutors_1","files":1,"time":1457793910,"description":"Call of Duty 4: Modern Warfare é um jogo de tiro em primeira pessoa, desenvolvido pela Infinity Ward e publicado pela Activision para Microsoft Windows, PlayStation 3, Xbox 360, Mac OS X, e Nintendo Wii em 2007. Foi também lançada uma versão portátil para a Nintendo DS. Foi editado na América do Norte, Austrália e na Europa em Novembro de 2007 para os consoles caseiros e para Windows. A versão para Mac foi lançada em Setembro de 2008 e a versão Wii editada em Novembro de 2009 com o subtítulo Reflex Edition. É o quarto título da série Call of Duty (excluindo pacotes de expansão) e o primeiro da franquia Modern Warfare, seguido depois por uma sequela directa, Call of Duty: Modern Warfare 2. Foi o primeiro jogo da série a ter uma classificação M (Mature) nos Estados Unidos. O jogo rompe com os argumentos anteriores da série sobre a Segunda Grande Guerra e situa-se num cenário actual. Call of Duty 4 esteve em produção durante dois anos e usa um motor de jogo propriedade da Infinity Ward. Em Setembro de 2009 foi reeditado no Japão pela Square Enix.\r\n\r\nA história decorre em 2011, quando um líder radical executou o presidente de um país não reconhecido no Médio Oriente, e um movimento &quot;Ultranacionalista&quot; inicia uma guerra civil na Rússia. Os conflitos descritos na história, são vistos da perspectiva de um fuzileiro americano e de um soldado do Serviço Aéreo Especial britânico e decorrem em várias localizações, incluindo o Reino Unido, Médio Oriente, Azerbaijão, Rússia e Ucrânia. A secção de multijogador do jogo apresenta vários modos, e contém um sistema de níveis que permite que o jogador vá desbloqueando armas adicionais, acessórios e esquemas de camuflagens enquanto avança.\r\n\r\nAclamado pela crítica, Call of Duty 4: Modern Warfare recebeu uma nota agregada de 94% nos sites GameRankings e Metacritic e é considerado por muitos como o melhor Call of Duty de sempre. Em particular, a jogabilidade, o multijogador e o enredo receberam muitos elogios, enquanto houve críticas que disseram que o jogo falhou ao tentar inovar substancialmente o género first-person shooter (FPS). Recebeu muitos prémios de vários sites especializados, incluindo &quot;Melhor Jogo para Xbox 360&quot;, da IGN e &quot;Jogo do Ano&quot; pela GameSpy. Foi o mais vendido em 2007, vendendo cerca de sete milhões de cópias em Janeiro e mais de treze milhões em Maio de 2009. Desde o seu lançamento, Call of Duty 4: Modern Warfare contribuiu para que a série Call of Duty domine actualmente as vendas do género. Muito influente, é normalmente indicado para as listas dos melhores videojogos de sempre, criadas por críticos e publicações; o IGN designou-o o quinto melhor first-person shooter de sempre. Em 2010 foi incluído no livro 1001 VideoJogos que Tem de Jogar Antes de Morrer","torrent":{"xt":"urn:btih:a1bdab1685903ed027c1e76e78f82a15920b3855","amp;dn":"Call+Of+Duty+4%3A+Modern+Warfare","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1bdab1685903ed027c1e76e78f82a15920b3855","infoHashBuffer":{"type":"Buffer","data":[161,189,171,22,133,144,62,208,39,193,231,110,120,248,42,21,146,11,56,85]},"announce":[],"urlList":[]}}