{"title":"Video Tramp (US) (1985)","uid":13844895,"size":368346217,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:a59247400be6d89c4b67565644dda4d717f22865&amp;dn=Video+Tramp+%28US%29+%281985%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"distinc","files":1,"time":1457869402,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=970888762\r\n \nhttp://imagedisco.net/?g=3741026996\r\n\r\n\r\n\r\nDescription:\r\n\r\nAlready a huge seller, Video Tramp proves that any ho-hum sexvid with nice packaging can prove popular. Unfortunately, this tape wastes the beautiful Christy Canyon, the video tramp who is actually the video clerk. The loveable Christy seems to choke on Tom Byron during one three-way scene, also involving Marc Wallace and Jessica Wylde's orgasms still do not convince me that she enjoys herself while being filmed. Plus you can't always see everything going on, which becomes a bore when the sex scenes are as overextended as they are here. Actually, the best part occurs when Jessica Wylde briefly masturbates. Video Tramp proves to be cumbersome viewing. So much for best-selling videos, with pretty box covers.\r\n\r\n\r\nBuxom video store clerk Ilene helps a customer picking up a porn tape. The tape indeed helps getting his girlfriend in mood. The customer and his friend then see Ilene in the street and pick her up. Ilene later helps the customer's girlfriend select a lesbian tape. The girlfriend pleasures herself while watching the tape, but later on her lesbian friend joins her. Ilene hires the customer's friend. But her first tutoring is locking the door and showing him to the back. When the customer's girlfriend returns, she also gets introduced to the back. The customer finds them but just","torrent":{"xt":"urn:btih:a59247400be6d89c4b67565644dda4d717f22865","amp;dn":"Video+Tramp+%28US%29+%281985%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a59247400be6d89c4b67565644dda4d717f22865","infoHashBuffer":{"type":"Buffer","data":[165,146,71,64,11,230,216,156,75,103,86,86,68,221,164,215,23,242,40,101]},"announce":[],"urlList":[]}}