{"title":"Advances in Gas Phase Ion Chemistry [Vol. 2-4]","uid":13699037,"size":34128977,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a854b6583833ea2139e7244c9aa7c5c916eff317&amp;dn=Advances+in+Gas+Phase+Ion+Chemistry+%5BVol.+2-4%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":3,"time":1456749167,"description":"Advances in Gas Phase Ion Chemistry is different from other ion chemistry series in that it focuses on reviews of the author's own work rather than giving a general review of the research area. This allows for presentation of some current work in a timely fashion which marks the unique nature of this series. Emphasis is placed on gas phase ion chemistry in its broadest sense to include ion neutral, ion electron, and ion-ion reactions. These reaction processes span the various disciplines of chemistry and include some of those in physics. Within this scope, both experimental and theoretical contributions are included which deal with a wide variety of areas ranging from fundamental interactions to applications in real media such as interstellar gas clouds and plasmas used in the etching of semiconductors. The authors are scientists who are leaders in their fields and the series will therefore provide an up-to-date analysis of topics of current importance. This series is suitable for researchers and graduate students working in ion chemistry and related fields and will be an invaluable reference for years to come. The contributions to the series embody the wealth of molecular information that can be obtained by studying chemical reactions between ions, electrons and neutrals in the gas phase","torrent":{"xt":"urn:btih:a854b6583833ea2139e7244c9aa7c5c916eff317","amp;dn":"Advances+in+Gas+Phase+Ion+Chemistry+%5BVol.+2-4%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a854b6583833ea2139e7244c9aa7c5c916eff317","infoHashBuffer":{"type":"Buffer","data":[168,84,182,88,56,51,234,33,57,231,36,76,154,167,197,201,22,239,243,23]},"announce":[],"urlList":[]}}