{"title":"The Senator's GrandDaughter (Desperate Pleasures) (2015)","uid":14011240,"size":2250541860,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:aa7e457b688550498748886e1157e84c2f21b319&amp;dn=The+Senator%27s+GrandDaughter+%28Desperate+Pleasures%29+%282015%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"distinc","files":4,"time":1458828144,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=5818152958\r\n \nhttp://imagedisco.net/?g=3984873076\r\n\r\n\r\n\r\nDescription:\r\n\r\nPlot:\r\n\r\nTags:\r\n\r\nAll sex, Teens, Feature\r\n\r\n\r\nDescription:\r\n\r\nViolet Monroe’s grandpa was running for the U.S. Senate several years ago when Violet’s libido and sex drive began to consume her whole life. In an attempt to save his campaign, Grandpa had Violet committed to a sex addict rehab while he won the election. Now that she has learned to control her carnal desires she is back to working on her grandfather’s re-election campaign, until a nosy reporter discovers her indiscretions. He follows Violet and uncovers a torrid affair between her and her cousin which is just what he needed. He blackmails Violet for sexual favors and political gains in exchange for her influencing Grandpa’s decisions the only way she knows how. Working closely with her Grandfather regularly makes it easy for her to seduce him and get exactly what she wants…ALL THE COCK ON CAPITOL HILL!\r\n\r\nScene One: A very appreciative Violet Monroe rubs the shoulders of hardworking Loki Black. It leads to a nice hand job. Her face looks quite pleasant while she rubbed his hard on with her right hand with very good persistency. At times, she used both hands for a double rub-a-dub. It's those moments that I enjoyed the most. As a matter of fact, she used both hands to make him cum. \r\n\r\n\r\n\r\nScene Two: After a hard day at the campaign office, Violet Monroe receives a massage from Conor Coxxx on the sofa. The brief rub down on her shoulders and back leads to the horny woman focusing on his dick. She sucks it and rubs it nicely. I enjoyed seeing her deep throat him. Once their clothes are removed, the bj activity turns into a good doggie screw. I liked Conor's steady and driven humping motion. Violet's moans sound cool. With the missionary screw, her tits jiggled nicely and the woman paid close attention to her partner's eyes. A very turned on guy accidentally cums into her.\r\n\r\n\r\nScene Three: Violet is strapped on a bed where the white strap along her pussy lips makes her get off while she squirms around. There are flashbacks and future moments that transpire throughout this scene. The moments when the focus remains solely on Violet rubbing herself with that strap is good action for guys to jack off to.\r\n\r\n\r\n\r\nScene Four: Violet and Camille Black are in one of her sessions. Moments later, she grabs a Hitachi vibrator from behind the white couch and uses it on her pussy. It leads to a good side by side masturbation session with both women as Camille rubs her own feminine plaything too. Violet's moans become more intense as the vibrating contraption makes her inner thighs jiggle.\r\n\r\nScene Five: Violet is having a fucking nice time with her cousin Conor Coxxx on the bed in doggiestyle. You start getting used to them fucking by now. Afterwards, they lay on their sides for some spoonful of pleasure action. Violet's naked body looks delicious to jack off to for the viewers. She really is a good looking fuck. Her tits jiggle so well and Conor applies some good hard fucking delivery. A mish","torrent":{"xt":"urn:btih:aa7e457b688550498748886e1157e84c2f21b319","amp;dn":"The+Senator%27s+GrandDaughter+%28Desperate+Pleasures%29+%282015%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa7e457b688550498748886e1157e84c2f21b319","infoHashBuffer":{"type":"Buffer","data":[170,126,69,123,104,133,80,73,135,72,136,110,17,87,232,76,47,33,179,25]},"announce":[],"urlList":[]}}