{"title":"uTorrent Pro 3.4.5 Build 41865 Final + Crack","uid":13686103,"size":82745746,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:abcc5cecec2d0d8a268736e1d618936368835fe5&amp;dn=uTorrent+Pro+3.4.5+Build+41865+Final+%2B+Crack&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rubberboy37","files":1,"time":1456557551,"description":"Description:\r\n\r\nuTorrent is a fast, easy, free , lightweight and compact torrent client. Cklient uTorrent, to date, is one of the most functional solutions for network BitTorrent. The program combines optimum functionality with a small amount. It supports the work regardless of the trekkers, it allows you to upload multiple files at once, hass a custom bandwith, rapid restoration of interrupted downloads and much more.\r\n\r\n\r\n\r\nuTorrent supports parallel loading:\r\n\r\n- Rational use of bandwidth and allows het to customize\r\n- Build-in scheduler uTorrent manages tasks\r\n- uTorrent has the ability to define the priority of traffic and regulate the speed\r\n- It has featuresd a quick stop and resume downloads\r\n- uTorrent supports UPnP and NAT-PMP, as well ass popular protocol extentions\r\n- It has a low memory consumption and small size of the program\r\n- It supports reading RSS-Feeds and download torrent announcements\r\n- Interacts with other customerrs without the need for a basic tracker (DHT)\r\n- uTorrent supports the Protocol Encryption\r\n- Interface uTorrent has the support of the change order and the possibility of translation into other languages\r\n- uTorrent integrated remote control via HTTP-Protocol, using the (WEbUI) web-interface\r\n- uTorrent works in all versions of Windows operating systems\r\n- It is also possible to use uTorrent in Linux using Wine\r\n\r\n\r\n\r\nFeatures versdion of uTorrent Pro:\r\n\r\n- Instant Streaming\r\nPlayback or preview torrent files as they are loaded, without waiting for the full file download\r\n\r\n- Conversion, download and play in a variety of formats\r\nMTorrent Pro Package includes HD Media Player, as well as the ability to convert files for playback on any device\r\n\r\n- New features and capabilities of the Premium Package\r\nIn uTorrent Pro continuously added new features, you get access to them at no extra charge !\r\n\r\n- Anti-Virus protection\r\nSecurity Support for your PC by automatically scan downloaded files for viruses and malware\r\n\r\n- Easy access\r\nAccess to upgrades and new features before anyone else\r\n\r\n- No advertisements\r\nThrough your supscription to Pro and supports for uTorrent, you can use the app without ads\r\n\r\n\r\nLatest uTorrent Release: \r\n\r\n\r\nLast Updated: Feb 16, 2016 02:51PM PST","torrent":{"xt":"urn:btih:abcc5cecec2d0d8a268736e1d618936368835fe5","amp;dn":"uTorrent+Pro+3.4.5+Build+41865+Final+%2B+Crack","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abcc5cecec2d0d8a268736e1d618936368835fe5","infoHashBuffer":{"type":"Buffer","data":[171,204,92,236,236,45,13,138,38,135,54,225,214,24,147,99,104,131,95,229]},"announce":[],"urlList":[]}}