{"title":"Mercury as a Global Pollutant - Donald B. Porcella et al.","uid":13926497,"size":64387397,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:abfcc97f0f7683100e8202ec028b98c5739a5e44&amp;dn=Mercury+as+a+Global+Pollutant+-+Donald+B.+Porcella+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1458384656,"description":"ISBN 978-94-010-4069-3\r\n\r\nACKNOWLEDGEMENTS xiv PART I MERCURY AND HUMAN HEALTH B. WHEATLEY and S. PARADIS I Exposure of Canadian Aboriginal Peoples to Methylmercury 3-11 M. GIRARD and C. DUMONT I Exposure of James Bay Cree to Methylmercury during Pregnancy for the Years 1983-91 13-19 M. RICHARDSON, M. MITCHELL, S. COAD and R. RAPHAEL I Exposure to Mercury in Canada: A Multimedia Analysis 21-30 M. RICHARDSON, M. EGYED and D. J. CURRIE I Human Exposure to Mercury may Decrease as Acidic Deposition Increases 31-39 L. E. FLEMING, S. WATKINS, R. KADERMAN, B. LEVIN, D. R. AVYAR, M. BIZZIO, D. STEPHENS and J. A. BEAN I Mercury Exposure in Humans through Food Consumption from the Everglades of Florida 41-48 J. M. GEARHART, H. J. CLEWELL III, K. S. CRUMP, A. M. SHIPP and A. SILVERS I Pharmacokinetic Dose Estimates of Mercury in Children and Dose-Response Curves of Performance Tests in a Large Epidemiological Study 49-58 I. SKARE I Mass Balance and Systemic Uptake of Mercury Released from Dental Amalgam Fillings 59-67 J. DELLINGER, N. KMIECIK, S. GERSTENBERGER and H. NGU I Mercury Contamina­ tion of Fish in the Ojibwa Diet: I. Walleye Fillets and Skin-On versus Skin-Off Sampling 69-76 J. DELLINGER, L. MALEK and M. BEATTIE I Mercury Contamination of Fish in the Ojibwa Diet: II. Sensory Evoked Responses in Rats Fed Walleye 77-83 H. AKAGI, O. MALM, F. J. P. BRANCHES, Y. KINJO, Y. KASHIMA, J. R. D. GUIMARAES, R. B. OLIVEIRA, K. HARAGUCHI, W. C. PFEIFFER, Y","torrent":{"xt":"urn:btih:abfcc97f0f7683100e8202ec028b98c5739a5e44","amp;dn":"Mercury+as+a+Global+Pollutant+-+Donald+B.+Porcella+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abfcc97f0f7683100e8202ec028b98c5739a5e44","infoHashBuffer":{"type":"Buffer","data":[171,252,201,127,15,118,131,16,14,130,2,236,2,139,152,197,115,154,94,68]},"announce":[],"urlList":[]}}