{"title":"Kandinsky Cossacks (Art Ebook).pdf","uid":13710270,"size":3722098,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:acdb4705ebb85abb9ce212b50fbdbca5c2209b8b&amp;dn=Kandinsky+Cossacks+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"STBGD","files":1,"time":1456866668,"description":"Kandinsky Cossacks\r\nTate Gallery | 1986 | ISBN 0946590354 | English | 36 pages | PDF | 3.5 MB\r\n\r\nNo other artist epitomizes the character of the Guggenheim Museum quite like Vasily Kandinsky, who is closely linked to the history of the museum and has been collected in depth in the permanent collection since its founding. Kandinsky accompanies the first full-scale retrospective of the artist's career to be exhibited in the United States since 1985, when the Guggenheim culminated its trio of groundbreaking exhibitions of the artist's life and work in Munich, Russia and Paris. This presentation of nearly 100 paintings brings together works from the three institutions that have the greatest concentration of Kandinsky's work in the world: the Solomon R. Guggenheim Museum, New York; Centre Georges Pompidou, Paris; and Städtische Galerie im Lenbachhaus, Munich; as well as significant loans from private and public holdings. This traveling exhibition's final iteration at the Guggenheim Museum will investigate both Kandinsky's formal and conceptual contributions to the course of abstraction in the twentieth century, concentrating on his innovations in painting. Kandinsky traces the artist's vision through thematic motifs such as the horse and rider, mountainous landscapes, tumultuous seascapes, apocalyptic imagery and other religious subjects","torrent":{"xt":"urn:btih:acdb4705ebb85abb9ce212b50fbdbca5c2209b8b","amp;dn":"Kandinsky+Cossacks+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acdb4705ebb85abb9ce212b50fbdbca5c2209b8b","infoHashBuffer":{"type":"Buffer","data":[172,219,71,5,235,184,90,187,156,226,18,181,15,189,188,165,194,32,155,139]},"announce":[],"urlList":[]}}