{"title":"Stargate SG-1 - Season 05 - Episodes 12 thru 22.new","uid":14114646,"size":6871442593,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b807aa6cb3b86ff0a8ec8cf288c76f32c9bc66b9&amp;dn=Stargate+SG-1+-+Season+05+-+Episodes+12+thru+22.new&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":38,"time":1459395593,"description":"511eg.jpg\r\n5.12 &quot;Wormhole X-Treme&quot;\r\nA mysterious ship is hurtling toward Earth and the key to stopping it lies with Marty, the alien who is producing a new sci-fi TV series called &quot;Wormhole X-Treme!&quot; But due to his amnesia, Marty has forgotten not only how to stop the ship…but also that he lived through the &quot;Wormhole&quot; experience himself.\r\n\r\nGuide | Transcript\r\n512eg.jpg\r\n5.13 &quot;Proving Ground&quot;\r\nCol. Jack O'Neill and his new SG recruits have become the targets of a secret hostile takeover. Now it's up to a wounded O'Neill and his neophyte troop to save the command center from a possible alien invasion!\r\n\r\nGuide | Transcript\r\n513eg.jpg\r\n5.14 &quot;48 Hours&quot;\r\nDuring a near-fatal pursuit by the Goa'uld gliders, Teal'c fails to make it through the Stargate before it is destroyed. Now SG-1 has only 48 hours to reestablish Teal'c's energy signature from the temporary memory of the Stargate before it's erased…for good!\r\n\r\nGuide | Transcript\r\n514eg.jpg\r\n5.15 &quot;Summit Part 1&quot;\r\nA truce has been declared among the Goa'uld, so that the warlords can attend a summit on the future of universe domination. Since Jackson speaks fluent Goa'uld, he is sent to the summit disguised as an aide. But his real mission is to poison the delegates!\r\n\r\nGuide | Transcript\r\n515eg.jpg\r\n5.16 &quot;Last Stand Part 2&quot;\r\nEmbattled and under siege, SG-1 attempts to escape a Goa'uld search and destroy mission bent on finding them and the secret crystal they carry. Meanwhile, the balance of life is threatened by the reappearance of Anubis—the oldest and most evil System Lord.\r\n\r\nGuide | Transcript\r\n516eg.jpg\r\n5.17 &quot;Failsafe&quot;\r\nAs an asteroid hurtles toward Earth, SG-1 uses an abandoned Goa'uld ship as a launch pad for a megabomb that's designed to explode the rock before impact. But when SGC loses the ship's signal, it's feared that the team is dead and Earth is in devastating peril.\r\n\r\nGuide | Transcript\r\n517eg.jpg\r\n5.18 &quot;The Warrior&quot;\r\nKytano, former First Prime of the late Imhotep, is now the leader of a powerful Jaffa rebellion. SG-1 visits Kytano's stronghold with the aim of securing an alliance. But O'Neill and the team soon learn that this strategic partnership may well come at a hefty price.\r\n\r\nGuide | Transcript\r\n518eg.jpg\r\n5.19 &quot;Menace&quot;\r\nA dormant female android discovered on a barren planet is transported back to Earth for study. On reactivation, she exhibits a childlike innocence. But soon, SG-1 discovers that this seemingly innocent being may hold a dangerous secret.\r\n\r\nGuide | Transcript\r\n519eg.jpg\r\n5.20 &quot;The Sentinel&quot;\r\nO'Neill must enlist the aid of a couple of convicted felons in a bid to save a planet from the Goa'uld. With an attack looming and the planet's automated defense systems seemingly offline, an entire world's salvation rests in the hands of SG-1 and two former NID operatives.\r\n\r\nGuide | Transcript\r\n520eg.jpg\r\n5.21 &quot;Meridian&quot;\r\nExposed to a lethal dose of radiation, Jackson has just hours to live. SG-1 tries everything in its power to save him, but as the hours tick away, Jackson's spirit meets with each member individually to discuss his next mission: life after death.\r\n\r\nGuide | Transcript\r\n521eg.jpg\r\n5.22 &quot;Revelations&quot;\r\nStill dealing with the death of one of their own, SG-1 must put its mourning aside in order to confront the warlord Anubis—who has captured the Asgard leader Thor so he can extract the secrets of their ancient technology for universal domination.\r\n\r\nGuide | Transcript","torrent":{"xt":"urn:btih:b807aa6cb3b86ff0a8ec8cf288c76f32c9bc66b9","amp;dn":"Stargate+SG-1+-+Season+05+-+Episodes+12+thru+22.new","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b807aa6cb3b86ff0a8ec8cf288c76f32c9bc66b9","infoHashBuffer":{"type":"Buffer","data":[184,7,170,108,179,184,111,240,168,236,140,242,136,199,111,50,201,188,102,185]},"announce":[],"urlList":[]}}