{"title":"AIAA Journal of Spacecraft and Rockets (1964-2011)","uid":13757375,"size":8949266345,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b9910b187d2a1688f2ca722fe2e989ec65984885&amp;dn=AIAA+Journal+of+Spacecraft+and+Rockets+%281964-2011%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Horisarte","files":358,"time":1457207167,"description":"http://www.aiaa.org/\n\nAmerican Institute of Aeronautics and Astronautics\n\n\nThis Journal is devoted to reporting advancements in the science and technology associated with spacecraft and tactical and strategic missile systems, including subsystems, applications, missions, environmental interactions, and space sciences. The Journal publishes original archival papers disclosing significant developments in spacecraft and missile configurations, re-entry devices, transatmospheric vehicles, systems and subsystem design and application, mission design and analysis, applied and computational fluid dynamics, applied aerothermodynamics, development of materials and structures for spacecraft and missile applications, space instrumentation, developments in space sciences, space processing and manufacturing, space operations, interactions with spacecraft and sensors, design of sensors and experiments for space, and applications of space technologies to other fields. The context of the Journal also includes ground-support systems, manufacturing, integration and testing, launch control, recovery and repair, space communications, scientific data processing, and human and environmental factors in spacecraft and mission design. Papers also are sought which describe the effects of propulsion, guidance and control, thermal management, and structural systems on spacecraft and missile design and performance","torrent":{"xt":"urn:btih:b9910b187d2a1688f2ca722fe2e989ec65984885","amp;dn":"AIAA+Journal+of+Spacecraft+and+Rockets+%281964-2011%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9910b187d2a1688f2ca722fe2e989ec65984885","infoHashBuffer":{"type":"Buffer","data":[185,145,11,24,125,42,22,136,242,202,114,47,226,233,137,236,101,152,72,133]},"announce":[],"urlList":[]}}