{"title":"Scrutiny 6.2 [MAC OS X]","uid":13876723,"size":11419409,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:ba7b48b635f50fcd5806a4785775dd0281fda1c5&amp;dn=Scrutiny+6.2+%5BMAC+OS+X%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"iAlexander","files":1,"time":1458129404,"description":"MADE IN UKRAINE\r\n\r\nScrutiny 6.2 – Suite of Web optimization tools.\r\n\r\nScrutiny 5 is a suite of web optimization tools including link checking, SEO checks, Sitemap generation, page load speed test, html validation. Version 5 is a major update and includes these new features. It allows 15 days free and unrestricted use. This is a major update and paid upgrade from v4. There is an upgrade path for existing users.\r\n\r\n- Cleaner ‘task based’ interface\r\n- Website monitoring of as many urls as you like with a choice of alerts and logging\r\n- Able to scan pdf documents for links\r\n- Scheduling made easy with a few easy clicks (the old method using iCal will still work)\r\n- On finish of a scheduled or manual scan, Scrutiny 5 can send an email, save a report, open a file or applescript, ftp the sitemap xml and other actions\r\n- Opens and scans a list of links in html, plain text format or xml sitemap (automatically detected)\r\n- Improved page analysis – finds more elements making up a page\r\n- Scan a site for pages containing specific text\r\n\r\nWhat’s new in version 6.2:\r\n\r\n- adds 'live view' by popular request. Allows results to be viewed while the scan is happening, either to spot any problems early (ie with settings or maybe timeouts etc) or just for visual feedback or because it's fun to watch the action.\r\n- Live view eats into the speed of the scan and system resources. For small sites this is insignificant, but for larger sites, liveview isn't recommended. A message to that effect is shown once per session when triggering live view.\r\n\r\nMADE IN UKRAINE","torrent":{"xt":"urn:btih:ba7b48b635f50fcd5806a4785775dd0281fda1c5","amp;dn":"Scrutiny+6.2+%5BMAC+OS+X%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba7b48b635f50fcd5806a4785775dd0281fda1c5","infoHashBuffer":{"type":"Buffer","data":[186,123,72,182,53,245,15,205,88,6,164,120,87,117,221,2,129,253,161,197]},"announce":[],"urlList":[]}}