{"title":"BoundGods--BG-39632 Christian Wilde, Dylan Knight and Scotty Zee","uid":13913161,"size":3523779209,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:bd19a9cc6c7555699611b669c246a989faaab474&amp;dn=BoundGods--BG-39632+Christian+Wilde%2C+Dylan+Knight+and+Scotty+Zee&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"merzedes","files":2,"time":1458322302,"description":"\n\r\nBound Gods Live: New House Slaves Tested by the Kink Olympics\r\n\r\nMar 17, 2016 - Performers: Christian Wilde ,  Dylan Knight  and  Scotty Zee \r\n\r\n\r\nHi and HD MP4.\r\n\r\n\r\nBound Gods proudly presents the Kink Olympics hosted by Van and Christian Wilde! Broadcast live, the Kink Olympics pits Slave #002 against #735 in a series of brutal and humiliating challenges. The slave with the most devotion and discipline gets the grand prize: a face full of Mr. Wilde's hot cum.\r\n\r\nFor the first challenge, the slaves must escape ropes around their wrists and ankles -- and then undress while blindfolded. Next, they have to hold tight to an overhead bar as they take a vicious torrent of hits from the flogger. The slaves take turns sucking off Mr. Wilde, seeing which slut can bring him to the edge faster. Mr. Darkholme and Mr. Wilde take the slaves to a knotted rope and make them straddle it and move to and fro on the line. Each knot knocks their balls as they fight rope burn to make the best time. During an intermission, Mr. Darkholme fits each slave with an ice lock connecting their sack to a bowling ball. The slaves race again, this time circling the main platform on their knees dragging the bowling balls behind them -- with a bucket in clenched in their teeth. After the race, the slaves must melt the ice locks -- hands free -- with mounted hair driers. The hosts take a tally of the points earned by the slaves, with #735 holding a slight lead. In return, he gets fucked by Mr. Wilde, who has #002's loser face strapped to his ass. The slaves move to a row of a sybians and face one last challenge. With the scores close, whoever blows first while riding the sybian at full power wins it all and gets anointed by Mr. Wilde's load.\r\n\r\nScreens \nhttp://www.boundgods.com/site/shoot.jsp?shootId=39632\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n20 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:bd19a9cc6c7555699611b669c246a989faaab474","amp;dn":"BoundGods--BG-39632+Christian+Wilde%2C+Dylan+Knight+and+Scotty+Zee","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd19a9cc6c7555699611b669c246a989faaab474","infoHashBuffer":{"type":"Buffer","data":[189,25,169,204,108,117,85,105,150,17,182,105,194,70,169,137,250,170,180,116]},"announce":[],"urlList":[]}}