{"title":"Mash - Season 11","uid":13775022,"size":4852829238,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bd3bbbaaefa6666f64b60af797a66c2a371107d5&amp;dn=Mash+-+Season+11&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":26,"time":1457307632,"description":"M*A*S*H (Season 11)\r\n\r\nActor \tRole\r\nAlan Alda \t        Capt. Benjamin Franklin &quot;Hawkeye&quot; Pierce\r\nWayne Rogers \t        Capt. &quot;Trapper&quot; John MacIntyre\r\nMcLean Stevenson \tLt. Col. Henry Blake\r\nLoretta Swit \t        Maj. Margaret &quot;Hot Lips&quot; Houlihan\r\nLarry Linville \t        Maj. Frank &quot;Ferret Face&quot; Burns\r\nGary Burghoff \t        Cpl. Walter &quot;Radar&quot; O'Reilly\r\n\r\nM*A*S*H is an American television series developed by Larry Gelbart and adapted from the 1970 feature film MASH (which was itself based on the 1968 novel MASH: A Novel About Three Army Doctors by Richard Hooker).[1] It follows a team of doctors and support staff stationed at the 4077th M*A*S*H (Mobile Army Surgical Hospital) in Uijeongbu, South Korea, during the Korean War.[2] The episodes were produced by 20th Century Fox Television for the CBS network and aired from September 17, 1972, to February 28, 1983.[2] The series, which covered a three year military conflict, spanned 11 seasons and 255 episodes and the 2-1/2 hour finale.[3]\r\n\r\nThe regular cast originally consisted of Alan Alda as Captain Benjamin Franklin &quot;Hawkeye&quot; Pierce and Wayne Rogers as Captain &quot;Trapper&quot; John McIntyre, two surgeons; McLean Stevenson as Lieutenant Colonel Henry Blake, a surgeon and the base commander; Loretta Swit as Major Margaret J. &quot;Hot Lips&quot; Houlihan, the head nurse; Larry Linville as Major Frank Burns, another surgeon; and Gary Burghoff as Corporal Walter &quot;Radar&quot; O'Reilly, the company clerk. Recurring characters in the first season consisted of John Orchard as Captain &quot;Ugly John&quot; Black, Timothy Brown as Captain &quot;Spearchucker&quot; Jones, William Christopher as First Lieutenant 'Father' John Patrick Mulcahy, the company chaplain (played by George Morgan in the pilot), and Jamie Farr as Corporal Maxwell Klinger.[4]\r\n\r\nSeveral changes were made in the cast line up during the 11-year run. Ugly John and Spearchucker were dropped after the first season, while Klinger and Father Mulcahy were retained and became permanent cast members in, respectively, the fourth and fifth seasons.[5][6] Rogers and Stevenson left the series at the end of the third season and were replaced in the fourth by, respectively, Mike Farrell as Captain B. J. Hunnicutt and Harry Morgan as Colonel Sherman Potter.[4] Linville left the series at the end of the fifth season and was replaced in the sixth by David Ogden Stiers as Major Charles Emerson Winchester III.[4] Burghoff left the series during the eighth season.[4] Two recurring characters—Allan Arbus as Major Sidney Freedman, a psychiatrist (called Milton Freedman in his first appearance) and Edward Winter as Colonel Sam Flagg (a Lieutenant Colonel, before the fourth season), CIA—were introduced in the second season.\r\n\r\nAlthough not an immediate success, the popularity of M*A*S*H increased in its second season, when it ranked among the ten most-popular programs on prime time American television. Except for the fourth season, where it dropped to number 15 (due to the departure of Rogers and Stevenson), the series stayed in the top 10 for the remainder of its run. The final episode, &quot;Goodbye, Farewell and Amen&quot;, became the most-watched show in American television history with 106 million viewers.[7] During its 11-year run M*A*S*H received 14 Emmy Awards.[8] The series continues to air in syndication, while the entire run has been released on DVD","torrent":{"xt":"urn:btih:bd3bbbaaefa6666f64b60af797a66c2a371107d5","amp;dn":"Mash+-+Season+11","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd3bbbaaefa6666f64b60af797a66c2a371107d5","infoHashBuffer":{"type":"Buffer","data":[189,59,187,170,239,166,102,111,100,182,10,247,151,166,108,42,55,17,7,213]},"announce":[],"urlList":[]}}