{"title":"Sarah Bird-Above the East China Sea  A Novel","uid":13694828,"size":303016225,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:be1614f0f1211fd9bb026b56f28ae89028d7b8d0&amp;dn=Sarah+Bird-Above+the+East+China+Sea++A+Novel&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"twocows","files":69,"time":1456667099,"description":"Above the East China Sea  A Novel\r\nSarah Bird\r\n\r\n    \t\r\n\r\nSet on the island of Okinawa today and during World War II, this deeply moving and evocative novel tells the entwined stories of two teenage girls-an American and an Okinawan-whose lives are connected across 70 years by the shared experience of both profound loss and renewal. Luz, a contemporary U.S. Air Force brat, lives with her no-nonsense sergeant mother at Kadena Air Base. Luz's older sister, her best friend and emotional center, has died in the Afghan war. Unmoored by her death, unable to lean on her mother, Luz contemplates taking her own life. In l945, Tamiko has lost everyone-the older sister she idolized and her entire family-and finds herself trapped between the occupying Japanese and the invading Americans whom she has been taught are demons that live to rape. On an island where the spirits of the dead are part of life and the afterworld reunites you with your family, suicide offers Tamiko the promise of peace. As Luz tracks down the story of her own Okinawan grandmother, she discovers that the ancestral spirits work as readily to save her as they do to help Tamiko find a resting place. And as these two stories unfold and intertwine, we see how war and American occupation have shaped and reshaped the lives of Okinawans","torrent":{"xt":"urn:btih:be1614f0f1211fd9bb026b56f28ae89028d7b8d0","amp;dn":"Sarah+Bird-Above+the+East+China+Sea++A+Novel","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be1614f0f1211fd9bb026b56f28ae89028d7b8d0","infoHashBuffer":{"type":"Buffer","data":[190,22,20,240,241,33,31,217,187,2,107,86,242,138,232,144,40,215,184,208]},"announce":[],"urlList":[]}}