{"title":"Balloon Paradise v2.6.0 mod","uid":13972754,"size":72091534,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:bea24eaff01ea429b30ca913984774b9f2732fdd&amp;dn=Balloon+Paradise+v2.6.0+mod&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tiropitaki","files":1,"time":1458626723,"description":"Ready to start matching and popping some balloons? Balloon Paradise is a colorful and exciting match 3 puzzle game that takes place in a world high above the clouds! Swap and match shiny balloons and unleash fantabulous power-ups as you work to save the sky city of Floatopia!\r\n\r\nBelle's amazing adventure has taken her to a world she never knew existed. Far above the land, hidden by the clouds, is a city made entirely out of balloons. A great gust of wind has stirred up trouble in this beautiful world, mixing up all of the colors and causing parts of the city to disappear! Only Belle can put things in order, and she's got just the match 3 skills to do it!\r\n\r\nTravel to amazing new worlds as you help Belle by matching balloons one group at a time. Solve puzzles to get special power-ups that can pop tons of balloons at once, sending them back to Floatopia in a great flash of fun!\r\n\r\nFeatures:\r\n* Restore a magical city floating high in the sky.\r\n* Match and pop colorful balloons in tons of different patterns.\r\n\r\nWhat’s new:\r\nEaster comes to the clouds with a brand new update for Balloon Paradise!\r\nSavor the season of spring with bright new graphics, festive music, Easter egg power-ups, &amp; 15 brand\r\nnew levels, all ready to download and enjoy! Paint the skies lavender, pink, orange and pastel as you\r\nmatch balloons &amp; eggs with Belle in the sky. Work your way through new challenges using brand new\r\nitems created just for the spring holiday!\r\nCelebrate Easter with a smile. Download Balloon Paradise now and start matching!\r\n\r\nWhat's in the mod:\r\nUnlimited money\r\n\r\nRequires Android OS 4.0.3 and up","torrent":{"xt":"urn:btih:bea24eaff01ea429b30ca913984774b9f2732fdd","amp;dn":"Balloon+Paradise+v2.6.0+mod","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bea24eaff01ea429b30ca913984774b9f2732fdd","infoHashBuffer":{"type":"Buffer","data":[190,162,78,175,240,30,164,41,179,12,169,19,152,71,116,185,242,115,47,221]},"announce":[],"urlList":[]}}