{"title":"BuildBox 1.2.2 557 Cracked Make game for any platform","uid":13880759,"size":123732209,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bf065b8814ff06ff23f61de97a3caaa5b2469b98&amp;dn=BuildBox+1.2.2+557+Cracked+Make+game+for+any+platform+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":5,"time":1458156101,"description":"Make amazing games and publish them everywhere. No coding required. Buildbox is a breakthrough game creation experience. Creating games is as easy as dropping images into the software, making changes to their properties and hitting play.\r\n\r\nEvery tool you need to complete your game is included inside Buildbox. You have access to complete management of your assets, integrated level editor, game menu system, advanced ad and in app purchase solution, font editor, gameplay settings and more.\r\n\r\nWith Buildbox it is simple\r\nWe set out to make creating games as easy as making a powerpoint presentation. During the development of Buildbox we didn’t study complex user experiences of design software or game creation tools, instead we focused on making things so intuitive, you wouldn’t need a manual.\r\n\r\nYou’ll have everything you need at your fingertips. To bring a new character, enemy, object, platform, decoration, power-up, effect or background into your game, you simply drag and drop it into the level editor. Now you’ll be able to move the object around, duplicate it and change all of it’s properties. Buildbox makes it simple.\r\n\r\nAnyone Can Create Games\r\nFor the first time, anyone can make games without having a technical bone in their body. Buildbox lets you make games as easy as a powerpoint presentation.\r\n\r\nBuild new gameplay types\r\nUsing Buildbox’s infinity engine you can control real world physics and gameplay by moving sliders. Make classic game styles like platformers or build something totally unique.\r\n\r\nAdvanced Monetization Options\r\nWith Buildbox you have full control over in app purchases and the ability to show ads from over 9 different top tier ad companies including industry favorites like Chartboost.\r\n\r\nBuild Once, Play Anywhere\r\nOnce you finish your game, instantly export it to over a dozen different platforms. Have your game on dozens of app stores, on Mac, Windows, iPhone, iPad, Android, Amazon Fire Phone, Amazon TV, OUYA and more.\r\n\r\nSpecial Effects and Power Ups\r\nQuickly create cool indie effects with lighting and trails. Easily add a multitude of power-ups to your game like invincibility, coin magnets, kill all enemies and more.\r\n\r\n Version 1.2.2:\r\n\r\n    added: enable keybord shortcuts for zoom (cmd+/cmd-)\r\n    added: button for link out URL\r\n    updated: iOS Admob SDK to 7.2.2\r\n    fixed: text/label misalign (old files need to refresh font)\r\n    fixed: unselectable background\r\n    fixed: joystick/accelerometer\r\n    fixed: game over delay\r\n    fixed: various crashes\r\n    fixed: various issues with sound not playing\r\n\r\nVersion with activation","torrent":{"xt":"urn:btih:bf065b8814ff06ff23f61de97a3caaa5b2469b98","amp;dn":"BuildBox+1.2.2+557+Cracked+Make+game+for+any+platform+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf065b8814ff06ff23f61de97a3caaa5b2469b98","infoHashBuffer":{"type":"Buffer","data":[191,6,91,136,20,255,6,255,35,246,29,233,122,60,170,165,178,70,155,152]},"announce":[],"urlList":[]}}