{"title":"Folder Lock 7.5.2 FINAL + Serial=DxNL41=","uid":13769282,"size":9525415,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c07b1e35253c49e5dfbfdbbf4b632bfdeffe1fb9&amp;dn=Folder+Lock+7.5.2+FINAL+%2B+Serial%3DDxNL41%3D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DxNL41","files":1,"time":1457280301,"description":"Folder Lock is a full suite solution letting you keep your personal files encrypted and locked, while keeping an automatic and real-time backup of encrypted files to an online storage. It also offers portable security for USB drives and CDs/DVDs. Folder Lock also lets you lock files, folders and drives; save your personal information in Wallets; shred files and clean your Windows History. Folder Lock offers 256-bit AES on-the-fly encryption as well as syncing of encrypted files to an online storage. No need to decrypt or manually backup your files. You can later restore files at any time, on any computer. Lockers can also be converted to executables using the 'Protect USB/CD' feature that allows you to keep your encrypted files wherever you go in USB drives or CDs and DVD or convert your files and folders to encrypted ZIP files for email attachments.\r\n\r\nFurthermore, if you want to protect your files without encrypting them, you can also lock your files, folders and drives on your PC from access and visibility. You can also create Encrypted Wallets to save personal information like Credit Cards, Bank Accounts and Business Cards. You can also Shred files, folders, drives and empty hard drive space. You can also clean Windows usage history. Additionally, Folder Lock comes with additional security settings unheard before. You can activate password security and restrict access to different parts of the application using an admin level master password. You can run the application in complete stealth using the Stealth Mode feature. You can also catch and perform actions on repetitive hack attempts and on basis of incorrect password logs and you can set automatic duration based protection for your data security, so you know that your stuff is no longer accessible to anyone else when you're away from your PC. Folder Lock works under all flavors of 32-bit and 64-bit versions of Windows 8/7/Vista/XP and later.\r\n\r\nNew Features in Folder Lock:\r\n\r\nLock files &amp; folders\r\nHide your private images, documents &amp; videos with click of a button.\r\n\r\nEncrypt your files\r\nEncrypt confidential files &amp; folders in Lockers on-the-fly. Lockers are portable.\r\n\r\nBackup Lockers\r\nBackup and sync your encrypted files in Lockers securely to secure cloud.\r\n\r\nPortable Lockers\r\nCreate portable self-executable Lockers in USB Drives, CDs/DVDs, Emails.\r\n\r\nMake Wallets\r\nMake digital wallets to securely save real-life Cards like Credit Cards and SSN.\r\n\r\nShred files\r\nPermanently delete files on your computer so they are unrecoverable.\r\n\r\nHistory Clean\r\nClean Windows History and tracks of PC activity and redundant files on your PC.\r\n\r\nSettings\r\nPassword Security, Stealth Mode, Hack Attempt Monitoring &amp; Auto Protect","torrent":{"xt":"urn:btih:c07b1e35253c49e5dfbfdbbf4b632bfdeffe1fb9","amp;dn":"Folder+Lock+7.5.2+FINAL+%2B+Serial%3DDxNL41%3D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c07b1e35253c49e5dfbfdbbf4b632bfdeffe1fb9","infoHashBuffer":{"type":"Buffer","data":[192,123,30,53,37,60,73,229,223,191,219,191,75,99,43,253,239,254,31,185]},"announce":[],"urlList":[]}}