{"title":"[Clips4Sale / Taboo-Fantasy] Claire (Teasing Daddys Cock) 480p [","uid":13751576,"size":133949030,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:c18cd2304ecfdfb05dcbf332d0701137180f3ed8&amp;dn=%5BClips4Sale+%2F+Taboo-Fantasy%5D+Claire+%28Teasing+Daddys+Cock%29+480p+%5B&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ImgSnaps","files":1,"time":1457160526,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/yuM\r\n \nhttp://imgsnaps.com/image/yug\r\n\r\nIt's Exam time at Claire's School....and She is worried about a big test She has the next day. The test, is in Her Sex-Ed class.....and it is a test on &quot;Cock-Teasing&quot;. Her Mom tells Her that when She was in High School, She got straight A's in Cock-Teasing....and offers to help Claire. According to Mom.../the best way to prepare for a test on Cock-Teasingis to practice on a real cock. Since the only cock available is Dad's......Mom calls Dad into Claire's room, and tells him what the situation is. Although Dad is shocked at the request.....he reluctantly agrees to participate....since it is for Claire's education. Mom tells Dad to take off his pants....and lie down. Mom shows Claire how to make a boy's cock hard...and to keep it under full Female control. The next part of the Cock-Teasing lesson is....denying orgasm. Mom instructs Claire to Jerk Her Father up to the edge of ejaculation.....and then put Her thumb over his p-hole to prevent the semen from escaping. Claire obediently Jerks Her Dad's cock....and when the Girls sense he is about to cum...they both cover up his p-hole to stop the sperm from releasing. Dad flails out violently against the Girls....and tries to finish himself off. Mom gets angry....and tells Claire that they must tie Dad down in order to continue. The Girls tie him down....and with his arms and hands immobilized.....the Cock-Teasing continues. Claire skillfully keeps Her Dad right on the edge of ejaculation....driving him crazy....and Mom whispers something in Claire's ear....which Dad can't hear. The Girls giggle....and then both Girls Jerk his cock faster and faster....and when they sense that ejaculation is imminent...both Girls immediately release the cock....and watch in amusement as the cock twitches painfully through a touchless, abandoned Ruined Orgasm!!! Dad screams in frustration and agony as his cock spurts semen everywhere...but his hands are tied!!! After the Girls finish laughing at the pain and torture they have caused....Mom assures Claire that She should get an A in Cock-Teasing!!","torrent":{"xt":"urn:btih:c18cd2304ecfdfb05dcbf332d0701137180f3ed8","amp;dn":"%5BClips4Sale+%2F+Taboo-Fantasy%5D+Claire+%28Teasing+Daddys+Cock%29+480p+%5B","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c18cd2304ecfdfb05dcbf332d0701137180f3ed8","infoHashBuffer":{"type":"Buffer","data":[193,140,210,48,78,207,223,176,93,203,243,50,208,112,17,55,24,15,62,216]},"announce":[],"urlList":[]}}