{"title":"T.G.Interior.Design.Challenge-S03--BBC-2016-w.subs.468p","uid":13829888,"size":10673300856,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c399c01fd82b2175e49e66b5bd462a9aa64f0a7b&amp;dn=T.G.Interior.Design.Challenge-S03--BBC-2016-w.subs.468p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"uggauga","files":33,"time":1457734669,"description":"\nThe Great Interior Design Challenge - Series 3\r\n\r\nThe search for Britain's best amateur interior designers. Working in a variety of architectural styles, the contestants have three days to impress both the judges and the homeowners.\r\n\r\nBBC (2016) - 15+1 Episodes\r\n\r\n_______________________________________\r\n\r\n832x468 resolution\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - enjoy !!\r\n_______________________________________\r\n\r\n\r\nConverted Leisure Centre\r\nIn the first round of the first heat, the group of amateurs taking on the design challenge are youth worker Jane, actress Sharon, doggie day carer Holly and ex-textiles salesman Frankie. They must transform a bedroom each in a modernist former leisure centre in south London - one of presenter and architectural historian Tom Dyckhoff's favourite buildings in the UK.\r\n\r\nWeatherboard Cottages\r\nThe remaining designers are out to impress, working in Kentish weatherboard cottages.\r\n\r\nScottish Castle\r\nThis design showdown takes place at a Scottish castle, now converted into apartments.\r\n\r\nThatched Village\r\nThe second heat begins. Another group of amateur designers compete across three knock-out rounds for one place in the quarter-final. They are engineering manager Rob, DIY store worker Angelica, ex-visual merchandiser Sarah and textiles lecturer Lucy. They are in the beautiful thatched village of Briantspuddle in Dorset - an unusual Edwardian experiment that presenter and architectural historian Tom Dyckhoff takes a closer look at.\r\n\r\nGeorgian Terrace\r\nThe three remaining designers work on a smart Georgian terrace in Bath.\r\n\r\nTimber-Framed Houses\r\nThe remaining two designers transform tiny bedrooms in medieval timber-framed houses.\r\n\r\nPeak District\r\nThe third heat begins. In the first of three knockout rounds, a group of four more amateur interior designers start their bid to win a place in the quarter-final, transforming cottages in the beautiful village of Tissington in the Peak District. They are sales assistant Jamie, art director Rachel, garden designer Sarah and photographer Lily.\r\n\r\nHalf Houses\r\nThree designers take on the demanding task of redesigning kitchens on a tight budget.\r\n\r\nModern Riverside\r\nTwo designers must transform attic bedrooms in high-end riverside properties in Marlow.\r\n\r\nSelf Build\r\nIt's the start of the fourth and final heat. Our last group of wannabe designers compete across three challenges to win one place in the quarter-final. This time they transform a bedroom each in an unusual self-build estate in south London. Hoping to fill the last spot in the quarter-final are industrial textile weaver Craig, personal assistant Nardia, furniture restorer Talie and children's author and illustrator Anne.\r\n\r\nBournville\r\nThree designers must each transform a reception room in the model village of Bournville.\r\n\r\nFarm Houses\r\nIn the last round of the heats, two designers must each transform a farmhouse kitchen.\r\n\r\nCoastal Cottages\r\nThe last four designers redesign a sitting room each and face a team challenge.\r\n\r\nMedieval Terrace\r\nThe three designers take on a sitting room each in a medieval terrace in Wells.\r\n\r\nStately Home\r\nThe final two designers take on three rooms each in a grand stately home in Sussex.\r\n\r\nUltimate Secrets\r\nIn this special programme, we bring together the ultimate rules of design - room by room. Across three series of The Great Interior Design Challenge, our designers have come up with cost-cutting, ingenious ideas about how to get a look for less, and they are all here.\r\nWe also have some insider techniques for a better home used by our judges - Sophie Robinson and Daniel Hopwood - plus design secrets from the guest judges featured across the series - interior and architectural designer Oliver Heath, designer Orla Kiely and iconic interior designer Kelly Hoppen.\r\nWe have broken down the home into five key rooms and compiled our very own step-by-step guide on how to make the most of each one of them. Meanwhile, presenter and architectural historian Tom Dyckhoff gives his own historic tour of the house - explaining how our homes have shaped up over the years","torrent":{"xt":"urn:btih:c399c01fd82b2175e49e66b5bd462a9aa64f0a7b","amp;dn":"T.G.Interior.Design.Challenge-S03--BBC-2016-w.subs.468p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c399c01fd82b2175e49e66b5bd462a9aa64f0a7b","infoHashBuffer":{"type":"Buffer","data":[195,153,192,31,216,43,33,117,228,158,102,181,189,70,42,154,166,79,10,123]},"announce":[],"urlList":[]}}