{"title":"Timothy Wilde Mysteries by Lyndsay Faye (Books 1, 2 &amp; 3)","uid":14014729,"size":1972637,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c45ebfdc4bb31aab4320681ce0ab7bac95f63787&amp;dn=Timothy+Wilde+Mysteries+by+Lyndsay+Faye+%28Books+1%2C+2+%26amp%3B+3%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"PirateBook","files":3,"time":1458859105,"description":"Lyndsay Faye moved to Manhattan in 2005 to audition for work as a professional actress; she found her days more open when the powers that be elected to knock her day-job restaurant down with bulldozers. Her first novel Dust and Shadow.\r\n\r\nHer second and third novels, The Gods of Gotham and its sequel Seven for a Secret, follow ex-bartender Timothy Wilde as he navigates the rapids of his violently turbulent city, his no less chaotic elder brother Valentine Wilde, and the perils of learning police work in a riotous and racially divided political landscape.\r\n\r\nGenre: Fiction, Mystery\r\n\r\n#1 - The Gods of Gotham\r\n\r\n1845. New York City forms its first police force. The great potato famine hits Ireland. These two seemingly disparate events will change New York City. Forever.\r\n\r\nTimothy Wilde tends bar near the Exchange, saving every dollar and shilling in hopes of winning the girl of his dreams. But when his dreams literally incinerate in a fire devastating downtown Manhattan, he finds himself disfigured, unemployed, and homeless. His older brother obtains Timothy a job in the newly minted NYPD, but he is highly skeptical of this untested &quot;police force.&quot; And he is less than thrilled that his new beat is the notoriously down-and-out Sixth Ward-at the border of Five Points, the world's most notorious slum.\r\n\r\nOne night while returning from his rounds, heartsick and defeated, Timothy runs into a little slip of a girl—a girl not more than ten years old—dashing through the dark in her nightshift . . . covered head to toe in blood.\r\n\r\nTimothy knows he should take the girl to the House of Refuge, yet he can't bring himself to abandon her. Instead, he takes her home, where she spins wild stories, claiming that dozens of bodies are buried in the forest north of 23rd Street. Timothy isn't sure whether to believe her or not, but, as the truth unfolds, the reluctant copper star finds himself engaged in a battle for justice that nearly costs him his brother, his romantic obsession, and his own life.\r\n\r\n#2 - Seven for a Secret\r\n\r\nSix months after the formation of the NYPD, its most reluctant and talented officer, Timothy Wilde, thinks himself well versed in his city’s dark practices — until he learns of the gruesome underworld of lies and corruption ruled by the &quot;blackbirders&quot;, who snatch free Northerners of color from their homes, masquerade them as slaves, and sell them South to toil as plantation property. The abolitionist Timothy is horrified by these traders in human flesh. But in 1846, slave catching isn’t just legal — it’s law enforcement.\r\n\r\nWhen the beautiful and terrified Lucy Adams staggers into Timothy’s office to report a robbery and is asked what was stolen, her reply is, &quot;My family&quot;. Their search for her mixed-race sister and son will plunge Timothy and his feral brother, Valentine, into a world where police are complicit and politics savage, and corpses appear in the most shocking of places. Timothy finds himself caught between power and principles, desperate to protect his only brother and to unravel the puzzle before all he cares for is lost.\r\n\r\n#3 - The Fatal Flame\r\n\r\nNo one in 1840s New York likes fires, copper star Timothy Wilde least of all. After a blaze killed his parents and another left him with a terrible scar, he has avoided flames of all kinds. So when a seamstress turned arsonist threatens Robert Symmes, a corrupt tycoon high in the Tammany Hall ranks, Timothy isn’t thrilled that Symmes consults him. His dismay escalates when his audacious and charismatic older brother, Valentine, himself deeply politically entrenched, decides to run against the incumbent, who they suspect is guilty of assault and far darker crimes. Immediately after his brother’s courageous declaration, Timothy finds himself surrounded by powerful enemies who threaten to harm those he cares about most","torrent":{"xt":"urn:btih:c45ebfdc4bb31aab4320681ce0ab7bac95f63787","amp;dn":"Timothy+Wilde+Mysteries+by+Lyndsay+Faye+%28Books+1%2C+2+%26amp%3B+3%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c45ebfdc4bb31aab4320681ce0ab7bac95f63787","infoHashBuffer":{"type":"Buffer","data":[196,94,191,220,75,179,26,171,67,32,104,28,224,171,123,172,149,246,55,135]},"announce":[],"urlList":[]}}