{"title":"Hookup Hotshot: You Gotta Have Guts","uid":14069593,"size":1203548742,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c4d76f681ea7eb9da862757678ed8d64a9a9a847&amp;dn=Hookup+Hotshot%3A+You+Gotta+Have+Guts&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hunter534","files":1,"time":1459155309,"description":"At the Hookup Hotshot House, girls walk in off the Internet, and never leave the same! It's not easy going on a date with Bryan Gozzling: things always seem to go kinda rough. Watch four cuties do their very best to keep up! Aria Alexander comes over after school and gets fucked sloppy! Violet Monroe gets her asshole stretched and fucked. Anna DeVille skips church and decides to get fucked ass-to-mouth instead. Cute teen Joseline Kelly gets turned into an adorable, gooey mess! Tattooed pickup artiste Bryan Gozzling uses only a smart phone and his powers of persuasion to bring sexy young ladies home for impromptu fuck dates. In 'Hookup Hotshot: You Gotta Have Guts', these adventurous girls are eager to meet a strange dude and submit to ferocious banging, slobbery face fucking, lewd toys and cum facials! Pigtailed cutie Aria Alexander spits gooey gag spit all over herself during a nasty throat invasion and fierce pussy pounding. Pale, gorgeous redhead Violet Monroe enjoys a cuddly hook-up that becomes intense and aggressive: Violet gets ass-fucked, choked and stuffed with an inflatable butt plug until Bryan spurts thick jizz right in her eye! Petite college slut Anna de Ville takes a ferocious anal banging and sucks dick ass-to-mouth, until her rectum is red and gaping and her pretty face is covered in spit and splooge. All-natural Joseline Kelly chokes on Bryan's dick in a session of pussy-to-mouth perversion that leaves her splattered with cum.\r\n\r\nCast: Joseline Kelly, Anna Deville, Bryan Gozzling, Anna De Ville, Aria Alexander, Violet Monroe\r\n\r\nCOVER+SCEENSHOT:\r\n \nhttp://photo-up.info/img-56f8d522363c9.html \r\n \nhttp://photo-up.info/img-56f8d52804d81.html","torrent":{"xt":"urn:btih:c4d76f681ea7eb9da862757678ed8d64a9a9a847","amp;dn":"Hookup+Hotshot%3A+You+Gotta+Have+Guts","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4d76f681ea7eb9da862757678ed8d64a9a9a847","infoHashBuffer":{"type":"Buffer","data":[196,215,111,104,30,167,235,157,168,98,117,118,120,237,141,100,169,169,168,71]},"announce":[],"urlList":[]}}