{"title":"Lost - Seasons 1 and 2 - Repaired","uid":13743555,"size":10362350950,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c6cbdce3914d0ee56598a36e59da2b9289c32d51&amp;dn=Lost+-+Seasons+1+and+2+-+Repaired&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":173,"time":1457100060,"description":"Lost \r\n\r\nUser Score 9.1 \r\nUniversal acclaim \r\nbased on 639 Ratings \r\n\r\n\r\n\r\n\r\nStarring: Sam Anderson, Daniel Dae Kim, Jorge Garcia \r\n\r\n\r\nSummary: \r\n\r\nAfter Oceanic Air Flight 815 tears apart in mid-air and crashes on a Pacific island on September 22nd 2004, its survivors are forced to find inner strength they never knew they had in order to survive. But they discover that the island holds many secrets, including a mysterious smoke monster, polar bears, housing with electricity and hot &amp; cold running water, a group of island residents known as &quot;The Others,&quot; and a mysterious man named Jacob. The survivors also find signs of those who came to the island before them, including a 19th century sailing ship called The Black Rock and the ruins of an ancient statue, as well as bunkers belonging to the DHARMA Initiative -- a group of scientific researchers who inhabited the island in the recent past. Lost has won a Golden Globe, 9 Saturn Awards and 8 Emmy awards. Collapse \r\nGenre(s): Drama, Action &amp; Adventure, Fantasy, Suspense, Science Fiction \r\n\r\n\r\nLOST: SEASON 1 / 26 NOV 2008 \r\nLOST FLASHBACK: SEASON 1 REVIEW \r\nShare. We wrap up our look back at the first year with an overall review of the entire season. \r\n\r\nBY CHRIS CARABOTT For those of you who watched Lost: Season 1 when it originally aired, I can safely tell you, it is as good as you remember it being. For those that still haven't jumped on board the Lost bandwagon – what the hell are you waiting for? Lost Season 1 sets the stage for what is considered by many to be one of the best sci-fi mysteries currently on television and it does a fantastic job of introducing the vast array of characters that inhabit this exciting world. The entire first season is handled like one long introduction, barely scratching the surface of what the universe has to offer. There is plenty of care taken in developing each of the characters and by the conclusion of the season you'll find yourself enthralled in an engaging sci-fi mystery. \r\n\r\nLost Season 1 succeeds first and foremost in character development – I can't stress this enough. Throughout my reviews over the course of this season I've used the term 'character study' a few times to describe various episodes. Lost is about relationships and before we can understand the dynamic behind the various relationships that develop over the course of a season, we need to understand what motivates these characters. This shows approach of having an individual episode focus on a single character through flashback, while formulaic, is a brilliant decision. It kind of reminds me of the layers of a cake, and the backstory to each of these survivors is the foundation","torrent":{"xt":"urn:btih:c6cbdce3914d0ee56598a36e59da2b9289c32d51","amp;dn":"Lost+-+Seasons+1+and+2+-+Repaired","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6cbdce3914d0ee56598a36e59da2b9289c32d51","infoHashBuffer":{"type":"Buffer","data":[198,203,220,227,145,77,14,229,101,152,163,110,89,218,43,146,137,195,45,81]},"announce":[],"urlList":[]}}