{"title":"The Hero's Walk by Anita Rau Badami","uid":14014697,"size":2124042,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c6eb22e0c6c4bcb18fa28e219ce3b276a4f07854&amp;dn=The+Hero%27s+Walk+by+Anita+Rau+Badami+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PirateBook","files":1,"time":1458858647,"description":"The Hero's Walk, the second novel by Anita Rau Badami, is a big, intimate book, the kind that seldom strays beyond the doors of a single residence. Set in the sweltering streets of Toturpuram, a small city on the Bay of Bengal, The Hero's Walk, which won the 2001 Commonwealth Writers Prize for best book in Canada and the Caribbean, explores the troubled life of Sripathi Rao, an unremarkable, middle-aged family man and advertising copywriter.\r\n\r\nAs The Hero's Walk opens, Sripathi's life is already in a state of thorough disrepair. His mother, a domineering, half-senile octogenarian, sits like a tyrant at the top of his household, frightening off his sister's suitors, chastising him for not having become a doctor, and brandishing her hypochondria and paranoia with sinister abandon. \r\n\r\nIt is Sripathi's children, however, who pose the biggest problems: Arun, his son, is becoming dangerously involved in political activism, and Maya, his daughter, broke off her arranged engagement to a local man in order to wed a white Canadian. \r\n\r\nSripathi's troubles come to a head when Maya and her husband are killed in an automobile accident, leaving their 7- year-old daughter, Nandana, without Canadian kin. Sripathi travels to Canada and brings his granddaughter home, while his family is shaken by a series of calamities that may, eventually, bring peace to their lives. --Jack Illingworth\r\n\r\nGenre: Fiction, General, Cultural","torrent":{"xt":"urn:btih:c6eb22e0c6c4bcb18fa28e219ce3b276a4f07854","amp;dn":"The+Hero%27s+Walk+by+Anita+Rau+Badami+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6eb22e0c6c4bcb18fa28e219ce3b276a4f07854","infoHashBuffer":{"type":"Buffer","data":[198,235,34,224,198,196,188,177,143,162,142,33,156,227,178,118,164,240,120,84]},"announce":[],"urlList":[]}}