{"title":"King of the Royal Mounted (1940) Old Time Serial (OTS)","uid":13636838,"size":8821792852,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c73d25feb33d96628168c3906bdb39896f438dea&amp;dn=King+of+the+Royal+Mounted+%281940%29+Old+Time+Serial+%28OTS%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MikeyMoMo","files":59,"time":1456088119,"description":"The time -- 1940.  The place -- Canada.  The subject -- Black and White Serial.  The medium -- 2 DVDs full of Tom Merritt and the RCMP Mounties.\r\n\r\nPLEASE CONTINUE TO SEED as long as possible.  If you like this, others will too and I don't have unlimited bandwidth.  I need help keeping these seeded!!\r\n\r\nCanadian Tom Merritt has discovered a substance, Compound X, that will cure infantile paralysis, which he extracts from a mine at Caribou, Canada. A country at war with Canada (unnamed because while Canada and the British Empire were at war with Germany, the USA &quot;officially&quot; wasn't in 1940) discovers that Compound X also contains magnetic properties which will make their mines effective against the British fleet, and dispatch one of their intelligence officers, John Kettler, to work undercover to ensure a steady stream of Compound X for the Fatherland. RCMP Major Ross King is killed in a fray against Kettler's henchmen, and his son, RCMP Sergeant Dave King continues on in his place in command of the Mountie post. The foreign agents open a &quot;sham&quot; sanitarium, supposedly to help paralysis victims, but actually to ship the gathered quantities of Compound X abroad to their warring country. Sergeant King discovers the fraud and exposes &quot;Dr. Shelton&quot;, the sham head of the hospital. The Mounties also secure some fuse caps which will provide proof that Kettler and his men are saboteurs. In an effort to recover the fuse caps, the enemy agents kidnap Linda Merritt, sister of RCMP Corporal Tom Merritt,Jr.. King and the Mounties eventually put an end to the enemy agents in chapter 12, &quot;Code of the Mounted&quot;, but not without a great personal sacrifice by one of their own.\r\n- Written by Les Adams &lt;  &gt;","torrent":{"xt":"urn:btih:c73d25feb33d96628168c3906bdb39896f438dea","amp;dn":"King+of+the+Royal+Mounted+%281940%29+Old+Time+Serial+%28OTS%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c73d25feb33d96628168c3906bdb39896f438dea","infoHashBuffer":{"type":"Buffer","data":[199,61,37,254,179,61,150,98,129,104,195,144,107,219,57,137,111,67,141,234]},"announce":[],"urlList":[]}}