{"title":"Various-The Easybeats to AC-DC The Story of Aussie Rock","uid":13700582,"size":3973947576,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cbd4498afde92440e136db2c7d39020462fdd7c6&amp;dn=Various-The+Easybeats+to+AC-DC+The+Story+of+Aussie+Rock&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GRNS3","files":13,"time":1456768612,"description":"Here is another nice bootleg. Check my account for more classic bootlegs.\r\n\r\nPlease enjoy, share with friends and please seed :)\r\n\r\n\r\nThe Easybeats to AC/DC\r\nThe Story of Aussie Rock\r\nBroadcast BBCFour on Friday, February 12, 2016\r\n\r\n\r\nBBCFour PCTV DVB-T TS capture&gt;Authored with Magix MEP.\r\n\r\nA Documentary split into 12 chapters:\r\nRun time:- 59:28\r\n\r\nSome words from the BBC:\r\nA film about the sound of Australian rock and the emergence of one of the world's greatest rock bands - AC/DC, or Acca Dacca as they are known in Australia, and the legendary music company, Albert Music (Alberts) that helped launched them on to the global rock scene.\r\nThrough the 1960s, 70s and 80s, Alberts created a house of hits in Australia that literally changed the sound of Australian popular music.\r\nIt started with the Easybeats and their international hit Friday On My Mind back in the 60s. In the 1970s when Australia was in the midst of a deep recession, a rough and ready pub rock sound emerged, characterised by bands like Rose Tattoo who were promoted by family-run company, Alberts. The raw power and fat guitar sound that characterised Aussie rock was pioneered by the Alberts and took Australia and the world by storm.\r\nThe sound of Aussie rock really exploded when the Alberts, a well-to-do family from the Sydney suburbs, joined forces with the Youngs, a Glasgow family who had emigrated to Australia. The result was AC/DC.\r\nThe documentary tells the story of how brothers Angus and Malcolm Young were produced by their older brother George and fellow Easybeats member Harry Vanda. Vanda and Young produced the band at Albert Studios and they were soon joined by the wild and charismatic lead singer Bon Scott.\r\nHead of Alberts was Ted Albert - a quietly confident risk taker. He backed AC/DC for many years with rock-solid conviction when their type of music and fashion seemed completely at odds with a UK and US music scene dominated by punk. Then, in 1980, AC/DC's Back in Black album was a massive success around the world and the rest is history. The film retraces the band's explosion in popularity, the relentless touring and the tragic death of Bon Scott.\r\nEven after Bon's death, and with the addition of Brian Johnson, the band went from strength to strength and remain hugely popular and one of the world's most legendary bands. Today, the Albert family remains a potent force in Australian music.\r\n\r\n\r\nDVD VOB format\r\nMPEG-2Program Stream &lt;&lt; (1 vid, 1 aud)\r\nSys Bitrate 10080 kb/s VBR 8394 kbps I/L TFF\r\nPAL 16:9\r\nMPEG-1 Layer 2 0xc0:48000Hz 256 kb/s tot ,\r\nStereo.\r\n\r\n\r\n\r\nPlay It LOUD!\r\n\r\nEnjoy","torrent":{"xt":"urn:btih:cbd4498afde92440e136db2c7d39020462fdd7c6","amp;dn":"Various-The+Easybeats+to+AC-DC+The+Story+of+Aussie+Rock","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbd4498afde92440e136db2c7d39020462fdd7c6","infoHashBuffer":{"type":"Buffer","data":[203,212,73,138,253,233,36,64,225,54,219,44,125,57,2,4,98,253,215,198]},"announce":[],"urlList":[]}}