{"title":"Microsoft Virtual Academy - Querying with Transact-SQL.iso","uid":14052449,"size":2809458688,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:cf084cb6e0ed9e126beef8aca55c5e7e4a89a8fe&amp;dn=Microsoft+Virtual+Academy+-+Querying+with+Transact-SQL.iso&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"4MeToU","files":1,"time":1459069057,"description":"Do you have a solid Transact-SQL foundation? This query language, also known as T-SQL, is used to work with data in SQL Server and Azure SQL Database, and is a fundamental skill for aspiring database professionals and application developers.\r\n\r\nExplore T-SQL in a series of self-paced modules which include lectures, demos, hands-on labs, and self-assessments. Find out how to use T-SQL to retrieve, insert, update, and delete data in a database. Learn about table expressions, grouping sets, error handling, and more. If you're studying for Exam 70-461, this course can help you prepare for it.\r\n\r\n(NOTE: Download course lab files.)\r\n\r\nInstructors | Graeme Malcolm - Microsoft Senior Content Developer, Geoff Allix - Content Master Principal Technologist\r\nCourse Introduction\r\n\r\nLearn about the goals of the course and how to set up an Azure SQL Database environment for the labs that you will complete during subsequent modules.\r\nIntroduction to Transact-SQL\r\n\r\nFind out how to set up a sample database in Microsoft Azure SQL Database to use in the supplementary labs for this course. Then, learn how to use the SELECT statement in Transact-SQL to create basic queries that return data from tables in a database.\r\nQuerying Tables with SELECT\r\n\r\nBuild on the basic SELECT syntax discussed in the previous module to learn how to sort and filter query results with the ORDER BY and WHERE clauses.  \r\nQuerying Multiple Tables with Joins\r\n\r\nExplore the concept of joins in relational database queries, and then hear how to implement inner, outer, cross, and self joins by using the JOIN clause. \r\nUsing Set Operators\r\n\r\nLearn how to combine sets of data returned by queries by using the UNION operator.\r\nUsing Functions and Aggregating Data\r\n\r\nGet to know commonly used built-in functions, and find out how to use them. Learn to use aggregate functions to summarize data, and work with the GROUP BY clause to retrieve grouped aggregations.\r\nUsing Subqueries and APPLY\r\n\r\nGet the details on including subqueries within a query, and see how to work with correlated subqueries and the APPLY operator to use the results from one query in another.   \r\nUsing Table Expressions\r\n\r\nLearn various techniques that can be used to create tabular structures in Transact-SQL, including views, temporary tables, table variables, table-valued functions, and common table expressions (CTEs).\r\nGrouping Sets and Pivoting Data\r\n\r\nFind out how to use the GROUPING SET subclause of the GROUP BY clause to specify multiple groupings in a single query. Then, see how to use the PIVOT and UNPIVOT operators to switch the orientation of data between column-oriented and row-oriented.\r\nModifying Data\r\n\r\nGet the details on modifying data in tables by using the INSERT, UPDATE, and DELETE statements.\r\nProgramming with Transact-SQL\r\n\r\nLearn to create Transact-SQL scripts that include programmatic constructs, such as conditional logic and loops.  \r\nError Handling and Transactions\r\n\r\nFind out how to create Transact-SQL code that includes error handling. Learn about the concept of a transaction and how to implement explicit transactions in Transact-SQL code.   \r\nRecommended Resources &amp; Next Steps\r\n\r\nTake this opportunity to learn more about Transact-SQL, at your own pace.\r\nLearn\r\n\r\n    00 | Course Introduction\r\n    01 | Introduction to Transact-SQL\r\n    02 | Querying Tables with SELECT\r\n    03 | Querying Multiple Tables with Joins\r\n    04 | Using Set Operators\r\n    05 | Using Functions and Aggregating Data\r\n    06 | Using Subqueries and APPLY\r\n    07 | Using Table Expressions\r\n    08 | Grouping Sets and Pivoting Data\r\n    09 | Modifying Data\r\n    10 | Programming with Transact-SQL\r\n    11 | Error Handling and Transactions\r\n    Recommended Resources &amp; Next Steps\r\n\r\nPrerequisites\r\nNone\r\n\r\n\r\nTime requirements, modules, assessments and points for this course:\r\n7 hours* 13 modules 11 assessment\r\n*Excluding labs, knowledge checks and assessments","torrent":{"xt":"urn:btih:cf084cb6e0ed9e126beef8aca55c5e7e4a89a8fe","amp;dn":"Microsoft+Virtual+Academy+-+Querying+with+Transact-SQL.iso","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf084cb6e0ed9e126beef8aca55c5e7e4a89a8fe","infoHashBuffer":{"type":"Buffer","data":[207,8,76,182,224,237,158,18,107,238,248,172,165,92,94,126,74,137,168,254]},"announce":[],"urlList":[]}}