{"title":"Warehouse 13 - Season 5 - Episodes 1 thru 6","uid":14074761,"size":10776020560,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d0658a7df1a00119efca3e7a8a930b71fc1dee62&amp;dn=Warehouse+13+-+Season+5+-+Episodes+1+thru+6&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":15,"time":1459204778,"description":"Description\r\nWarehouse 13 - Season 5 - Episodes 1 thru 6\r\n\r\nimage\r\n\r\n\r\nOn May 16, 2013, it was announced that Warehouse 13 was renewed for a fifth and final season of six episodes to air in 2014. Filming in the Toronto area began on June 24, 2013,[2] and concluded on August 31, 2013.[3]\r\nEpisodes\r\nNo. in\r\nseries No. in\r\nseason Title Directed by Written by Original air date U.S. viewers\r\n(million)\r\n59 1 &quot;Endless Terror&quot; Jack Kenny Jack Kenny April 14, 2014 1.17[4]\r\n\r\nParacelsus takes control of Warehouse 13, intent on recreating the entire world in his image. Pete and Myka must follow him back through time to 1541 and prevent him from killing the Regents and becoming the permanent master of the Warehouses.\r\nArtifacts: Theodosius of Bithynia's sundial, Karl Schwarzschild's pocket watch, Pierre-Simon Laplace's telescope, arrow of Achilles, Louis XIV's silverware, Joan of Arc's helmet, Sargon the Great's mirrors, William Bleckwenn's stethoscope, Al Capone's dual Tommy guns, stick grenade from Hitler's bunker, African elephant tusk, Black Bart's Cannon, World War II Tessen fan, Lewis Carroll's mirror, spine of the Saracen, Chester Moore Hall's achromatic lens, Orville Wright's aviator goggles, H.G. Wells' time machine, The Duke of Exeter's daughter torture rack spindle, after-image mirror and the scalpel\r\n60 2 &quot;Secret Services&quot; Robert Duncan McNeill Bob Goodman April 21, 2014 1.15[5]\r\n\r\nPete and Myka investigate a series of victims drowning and run into a pair of Secret Service agents.\r\nArtifacts: Bronze baby shoes, Alfred Dreyfus' sword hilt, Frances Farmer's music box, Joseph Pilates' resistance bands, Oliver Sacks' record player, silver necklace from the Atacama Desert mines\r\n61 3 &quot;A Faire to Remember&quot; Matt Birman Holly Harold April 28, 2014 1.08[6]\r\n\r\nPete and Steve search for a dangerous artifact at a Renaissance fair, while Claudia takes a risk to revive her sister from a coma.\r\nArtifacts: Mother Shipton's Cards, Bob Dylan's Bus Pass, Alessandro Volta's pail\r\n62 4 &quot;Savage Seduction&quot; Jack Kenny Diego Gutierrez May 5, 2014 0.90[7]\r\n\r\nPete, Myka and Artie try to help Pete's ex-girlfriend Kelly Hernandez when her grandmother gets trapped inside a telenovela, but things go awry when they all end up as characters in the soap opera. Meanwhile, a strange accident at a university leads Claudia and Steve to discover an artifact that literally duplicates its users.\r\nArtifacts: telenovela brooch prop, Edna St. Vincent Millay's two-ended candle, Harvey Korman's cufflinks\r\n63 5 &quot;Cangku Shisi&quot; Michael McMurray Benjamin Raab &amp; Deric A. Hughes May 12, 2014 0.85[8]\r\n\r\nValda tries to move the warehouse to China and uses Claudia's comatose sister Claire as a puppet caretaker.\r\nArtifacts: Sir William Edward Parry's frozen statue, Albert Butz's glasses, Oliver Sacks' record player, Chuck Yeager's copy of Melvin Rixton's The Wandering Cowboy record, Charles Atlas's workout trunks, Hiram Abiff's setting maul, The Mason's Compass, The Mason's Square, Julius Wilbrand's buttons, Silly String, Louis XIV's Versailles's Forks. Artifacts seen during the transfer to WH14: The Washington Monument and The CN Tower from Canada. Information on Mrs. Frederic is also revealed - she became the caretaker of Warehouse 13 after her sister was killed in the Great Fire Of Attleboro, MA. (1898).\r\n64 6 &quot;Endless&quot; Jack Kenny John-Paul Nickel May 19, 2014 1.13[9]\r\n\r\nThe team struggles with the news that Warehouse 13 will be moving to a new host country. Meanwhile, they explore a series of flashbacks that builds into the eternal emotions of the Warehouse itself.\r\nArtifacts: Harriet Tubman's thimble, Jack the Ripper's lantern, King Arthur's Round Table, marquee for 42nd Street from the Mark Strand Theatre, Thomas Wedgwood's champagne glass, Louis XIV's silverware forks, Japanese five-tailed fox statue, H.G. Wells' shrink ray, Busby Berkeley's flask, Goodman's beggar tin pan, a clock, Barack Obama's basketball","torrent":{"xt":"urn:btih:d0658a7df1a00119efca3e7a8a930b71fc1dee62","amp;dn":"Warehouse+13+-+Season+5+-+Episodes+1+thru+6","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0658a7df1a00119efca3e7a8a930b71fc1dee62","infoHashBuffer":{"type":"Buffer","data":[208,101,138,125,241,160,1,25,239,202,62,122,138,147,11,113,252,29,238,98]},"announce":[],"urlList":[]}}