{"title":"Stargate SG-1 - Season 02 - Episodes 1 thru 11","uid":14089833,"size":7645606407,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d1661a768ce8e20dc6e8fbbd5d8b6307e3763827&amp;dn=Stargate+SG-1+-+Season+02+-+Episodes+1+thru+11&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":38,"time":1459291539,"description":"Stargate SG-1 Season One Episode Guides\r\n1.01 &quot;Children Of The Gods Part 1&quot;\r\nWhen the SGC is attacked by an alien with glowing eyes, Col. Jack O'Neill is recalled from retirement to lead a second team through to Abydos: his mission to retrieve Dr. Daniel Jackson. Daniel's discovery of a cartouche leads astrophysicist Capt. Carter to realize an entire network of Stargates could exist, leading to millions of worlds.\r\n\r\nGuide | Transcript | Wallpapers | Screencaps\r\n101eg.jpg\r\n1.02 &quot;Children Of The Gods Part 2&quot;\r\nWhen Sha're and Skaara are kidnapped, Jack returns with Daniel to Earth where a new team is formed to battle the alien threat: SG-1. They go through to another world, home to Apophis, an alien parasite like Ra. Sha're and Skaara are taken as hosts while the members of SG-1 are rescued by the most unlikely ally: Apophis' First Prime Teal'c.\r\n\r\nGuide | Transcript | Wallpapers\r\n102eg.jpg\r\n1.03 &quot;The Enemy Within&quot;\r\nWith the SGC under attack by Apophis, Maj. Kawalsky is forced to battle a larval Goa'uld for control of his mind. Daniel Jackson and Jack O'Neill attempt to communicate with the Goa'uld to no avail. It claims Kawalsky's body for its own. The major elects to undergo life-threatening surgery to remove the Goa'uld and appears to make a full recovery.\r\n\r\nGuide | Transcript\r\n103eg.jpg\r\n1.04 &quot;Emancipation&quot;\r\nOn the planet of Simarka, where the fierce Mongolian race of Shavadai mistreat their oppressed females, Sam Carter is kidnapped and sold to a brutal warlord. When her escape attempt fails, Carter challenges the Shavidai's misogynous ways in a battle of wits and wills which may bring women equality or end in her own death.\r\n\r\nGuide | Transcript\r\n104eg.jpg\r\n1.05 &quot;The Broca Divide&quot;\r\nReturning from a planet with both a civilized and a primitive side, the SG-3 marines and all but two members of the SG-1 team become infected with a virus which rapidly spreads throughout the SGC. Violence breaks out everywhere as personnel regress to an aggressive primitive state. Can Teal'c and Daniel Jackson find the cause?\r\n\r\nGuide | Transcript\r\n105eg.jpg\r\n1.06 &quot;The First Commandment&quot;\r\nThe SG-1 team is sent after an SG team which has failed to return from a mission. They find that their captain, Jonas Hanson, Sam Carter's ex-fiancé, having been treated as a god by the fearful, primitive locals, is drunk with power and tyrannizing them. Can Carter and the team overcome Hanson before he kills them all?\r\n\r\nGuide | Transcript\r\n106eg.jpg\r\n1.07 &quot;Cold Lazarus&quot;\r\nA strange crystal strikes down O'Neill, replacing him with a double that returns with the SG-1 team to Earth to find the cause of O'Neill's private grief—his son's death. But the crystalline entity double is dangerously unstable as O'Neill's bewildered wife Sara soon discovers. Can O'Neill return to the SGC in time to save everyone and prevent chaos?\r\n\r\nGuide | Transcript\r\n107eg.jpg\r\n1.08 &quot;The Nox&quot;\r\nWhen a planned ambush against Apophis goes disastrously wrong, resulting in fatalities among the SG-1 team, the peace-loving Nox restore them to life. But while these gentle people can bring back the dead, can they resist the deadly technology of Apophis and his Jaffa? The attempts of SG-1 to defend the Nox make matters worse.\r\n\r\nGuide | Transcript\r\n108eg.jpg\r\n1.09 &quot;Brief Candle&quot;\r\nOn the mysterious planet Argos, the beautiful Kynthia seduces Jack O'Neill into marriage. As a result of their liaison, Jack is condemned to an Argosian lifespan of only a hundred days. As he ages rapidly and his health fails, will his team succeed in their frantic search for a cure? Jack's bitterness changes the peaceful Argosians forever.\r\n\r\nGuide | Transcript\r\n109eg.jpg\r\n1.10 &quot;Thor's Hammer&quot;\r\nLooking for allies against the Goa'uld, the SG-1 team gates through to Cimmeria, home of the legendary Norse gods. Teal'c and Jack O'Neill are transported to the underground labyrinth caves of the vicious creature Unas. Can Daniel Jackson and Carter rescue them? They must enlist the aid of the fearful Kendra, once host to a Goa'uld.\r\n\r\nGuide | Transcript\r\n110eg.jpg\r\n1.11 &quot;The Torment Of Tantalus&quot;\r\nDaniel Jackson discovers that in 1945, a brilliant young professor went through the Stargate, never to return. Together with his fiancee, Catherine Langford, SG-1 discovers the now aged Ernest Littlefield trapped in a decaying castle. With Daniel captivated by Ernest's amazing discoveries, the others race against time to get them all home","torrent":{"xt":"urn:btih:d1661a768ce8e20dc6e8fbbd5d8b6307e3763827","amp;dn":"Stargate+SG-1+-+Season+02+-+Episodes+1+thru+11","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1661a768ce8e20dc6e8fbbd5d8b6307e3763827","infoHashBuffer":{"type":"Buffer","data":[209,102,26,118,140,232,226,13,198,232,251,189,93,139,99,7,227,118,56,39]},"announce":[],"urlList":[]}}