{"title":"Practical Guide to Polyethylene","uid":13930835,"size":2376728,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d35b0b0a06e079724ad2c432255bcac3ede69855&amp;dn=Practical+Guide+to+Polyethylene&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1458419532,"description":"ISBN 1-85957-493-9\r\n\r\nPolyethylene is probably the most commonly used polymer in everyday life. It is the polymer that is used to make grocery bags, shampoo bottles, children's toys, and even bullet-proof vests. This Practical Guide provides information about every aspect of polyethylene production and use in a reader-friendly form. It discusses the advantages and disadvantages of working with polyethylene, offering practical comment on the available types of polyethylene, properties and in-service performance, and processing.\r\n\r\nThe Practical Guide begins with general background to the polyethylene family, with price, production and market share information. It describes the basic types of polyethylene including virgin &amp; filled polyethylene, copolymers, block and graft polymers and composites, and reviews the types of additives used in polyethylene.Polyethylenes offer a wide range of properties due to differences in structure and molecular weight, and the Practical Guide gives the low down on the properties, including, amongst others, rheological, mechanical, chemical, thermal, and electrical properties.\r\n\r\nDesign of a polymeric product for a certain application is a complex task, and this is particularly true for polyethylene with its variety of forms and available processing methods. This Practical Guide describes the processing issues and conditions for the wide range of techniques used for polyethylene, and also considers post-processing and assembly issues. It offers guidance on product design and development issues, including materials selection.\r\n\r\nThe Practical Guide to Polyethylene is an indispensable resource for everyone working with this material","torrent":{"xt":"urn:btih:d35b0b0a06e079724ad2c432255bcac3ede69855","amp;dn":"Practical+Guide+to+Polyethylene","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d35b0b0a06e079724ad2c432255bcac3ede69855","infoHashBuffer":{"type":"Buffer","data":[211,91,11,10,6,224,121,114,74,210,196,50,37,91,202,195,237,230,152,85]},"announce":[],"urlList":[]}}