{"title":"BitScramble 3.2 - file encryption software","uid":14041026,"size":257844,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d3bda86b1bfb2482db41472cea335b09f6b9af8e&amp;dn=BitScramble+3.2+-+file+encryption+software&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Cy1on","files":2,"time":1459023761,"description":"BitScramble - FREEWARE 2016 (ver. 3.2)\r\n\r\nBitScramble is a file encryption software for Windows. Please DO NOT LOOSE your password after encryption.\r\nBitScramble will not store your password to anywhere nor does not leave any trace of itself in the system.\r\nThe longer password you give, the more secure the encryption will be.\r\n\r\n.NET 3.0 required or higher.\r\nNo installation needed, just run the application.\r\n\r\n\r\nHOW TO USE:\r\n\r\nRun the application. Open folder where your files are. All files are shown in the list. Enter password and encrypt/decrypt files individually or all of them.\r\nYou can also encrypt/decrypt files to another location, this maintains original copy.\r\n\r\n\r\nWARNING:\r\n\r\n\r\n- DO NOT LOOSE/FORGET YOUR PASSWORD!!!\r\n- YOU will take full responsibility for using this application!\r\n- Read only files will NOT be encrypted/decrypted.\r\n- Please DO NOT rename encrypted file names! IF you do, the real file name is lost but the file itself can still be decrypted.\r\n- There is NO connection between YOUR password and encrypted file names! File names are encrypted with different logic and may be quite easy to crack.\r\n- Editing encryped files with any other application (notepad for example), will most likely result that the file cannot be recognized as encryped file by bitscramble and therefore cannot be decrypted!\r\n- Opening folder with large amount of subfolders &amp; files might slow down the application before the list is shown, be patient...\r\n\r\n\r\nI developed this application as a hobby and I have been using it for years and now shareing with anyone who is interested.\r\nI recommend keeping this application in a separate flash drive so only YOU can open folders with encrypted files and see the real file names.\r\nPlease give your feedback, suggestions or any bugs you might find...\r\n\r\n\r\n\r\n\r\nEnjoy!","torrent":{"xt":"urn:btih:d3bda86b1bfb2482db41472cea335b09f6b9af8e","amp;dn":"BitScramble+3.2+-+file+encryption+software","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3bda86b1bfb2482db41472cea335b09f6b9af8e","infoHashBuffer":{"type":"Buffer","data":[211,189,168,107,27,251,36,130,219,65,71,44,234,51,91,9,246,185,175,142]},"announce":[],"urlList":[]}}