{"title":"Warehouse 13 - Season 1 - Episodes 1 thru 6","uid":13897760,"size":9426798905,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d44e0764855deed2c607e2596083e5ffacdbcacc&amp;dn=Warehouse+13+-+Season+1+-+Episodes+1+thru+6&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":22,"time":1458254163,"description":"In the beginning of season one, Pete and Myka, two secret service agents who were protecting the president, were transferred against their will to the remote Badlands Wilderness in South Dakota. There they were given a job at Warehouse 13 to protect and retrieve various talisman artifacts around the world under the supervision of Dr. Arthur &quot;Artie&quot; Nielsen. At first Pete and Myka were reluctant to be partners, but during the season they grew closer. At the beginning of season one there was a breach in Warehouse 13's computer system which turned out to be caused by Claudia Donovan, who wanted Artie to help her bring her brother back from interdimensional limbo where he was trapped. After they saved Joshua, Mrs. Frederic wanted Artie to either hire Claudia, or &quot;deal with&quot; her, since she knew too much about Warehouse 13. However, Artie was reluctant to hire her until Leena convinced him that it would be better for Claudia to work at the Warehouse.\r\n\r\nOver the course of season one, Artie's former partner, MacPherson, returned and dug up Artie's past. Myka and Pete learned of Artie's criminal record, but that he had changed his name and joined the Warehouse. Later it is revealed that MacPherson has been using Leena to steal items from the Warehouse so he can sell them to buyers around the world, until he is eventually caught by Pete, Myka, and Artie and then taken to the Warehouse to be bronzed. He uses Leena again, though, to reverse his bronzing, while using Harriet Tubman's thimble to frame Claudia, and he escapes.\r\n\r\n\r\n1 \t1 \t&quot;Pilot&quot; \t\r\n\r\nSecret Service agents Peter Lattimer (Eddie McClintock) and Myka Bering (Joanne Kelly) are reassigned by the mysterious Mrs. Frederic (C. C. H. Pounder) to a top-secret facility in South Dakota. Now reluctantly joining the quirky Artie Nielsen (Saul Rubinek) as &quot;gatherers and protectors&quot; of empowered and potentially dangerous objects, Lattimer and Bering investigate a report of domestic abuse in Iowa and discover a small town lawyer (Sherry Miller) who is channeling Lucrezia Borgia.\r\n\r\n\r\n2        2      &quot;Resonance&quot;\r\n\r\nA string of bank robberies in Chicago puts Pete and Myka on the search for a very soothing song, while Artie probes a security breach in Warehouse 13.\r\nArtifact: Eric Marsden's Unreleased 45 R.P.M. Record, Steampunk Password Cracker, Still Camera, Lewis Carroll's Mirror\r\n\r\n\r\n3 \t3 \t&quot;Magnetism&quot; \t\r\nAfter recovering a guillotine in Paris, Pete and Myka seek an inhibition-releasing artifact in the fictional town of Unionville, Colorado. The village used for filming was the actual village of Unionville, Ontario, Canada. Meanwhile Artie, refusing Leena's (Genelle Williams) help, probes the strange energy surges plaguing Warehouse 13.\r\nArtifact: James Braid's Chair.\r\n\r\n\r\n4 \t4 \t&quot;Claudia&quot; \t\r\n\r\nArtie gets kidnapped by the source of the warehouse's security breach, Claudia Donovan (Allison Scagliotti). She enlists Artie to help right a wrong from their past; this is the introduction of Claudia's older brother Joshua.\r\nArtifact: Rheticus's Compass.\r\n\r\n\r\n5 \t5 \t&quot;Elements&quot; \t\r\n\r\nA thief steals a sculpture with the help of a Native American artifact, and the investigation leads Pete and Myka to discover a sacred place that they deem worthy of protection. Claudia sneaks into the team to protect herself from the organization's &quot;consequences&quot; for her actions.\r\n\r\n\r\n6 \t6 \t&quot;Burnout&quot; \t\r\n\r\nWhile investigating the site of a presumed gas explosion, Pete and Myka are shocked to discover the body of another Warehouse agent. Things get even more complicated when the artifact they're hunting attaches itself to Pete's spine. It causes him to channel dangerous amounts of electricity and makes him very, very angry and dangerous. This is the introduction of Rebecca St. Claire, a former Warehouse agent, played by Roberta Maxwell.\r\nArtifact: Spine of the Saracen","torrent":{"xt":"urn:btih:d44e0764855deed2c607e2596083e5ffacdbcacc","amp;dn":"Warehouse+13+-+Season+1+-+Episodes+1+thru+6","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d44e0764855deed2c607e2596083e5ffacdbcacc","infoHashBuffer":{"type":"Buffer","data":[212,78,7,100,133,93,238,210,198,7,226,89,96,131,229,255,172,219,202,204]},"announce":[],"urlList":[]}}