{"title":"[NubileFilms NubilesNetwork] Alexa Grace (Full Of Grace 29.03.16","uid":14089328,"size":395387795,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:d59773bd2be513f6d2a14a45815b47e7f89d80fd&amp;dn=%5BNubileFilms+NubilesNetwork%5D+Alexa+Grace+%28Full+Of+Grace+29.03.16&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"distinc","files":1,"time":1459287758,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=390448715\r\n \nhttp://imagedisco.net/?g=3616759954\r\n\r\n\r\n\r\nDescription:\r\n\r\nActress Name: Alexa Grace\r\nName movie: Full Of Grace\r\nSubsites and site: NubileFilms.com / NubilesNetwork.com\r\n\r\nProduction year: 2016\r\nGenre: Small Boobs, Shaved Pussy, Tall Girls, Blonde, Long hair, Lingerie, Hardcore, Thongs, Girl-Boy, Blowjob, Pussy Licking\r\nDuration: 00:22:54\r\n\r\nDescription:\r\nWearing just a thong and a sheer camisole, Alexa Grace struts up to Van Wylde and lets him know with a deep kiss that she's ready for the pleasure that only he can give. Van is happy to rise to the challenge, and soon Alexa has crawled into his lap so that they can make out while he pulls her thong aside to rub her creamy bald pussy in a preview of things to come.\r\n\r\nPushing Alexa back onto the couch, Van once again gets her thong out of the way so that he can dive in with his eager lips and tongue. Once he starts eating out Alexa's creamy snatch, he settles in for an extended pussy licking that only pauses when he decides to roll Alexa's thong down her legs. Thanks to his efforts, the magic of Van's tongue leaves the blonde coed gasping her approval.\r\n\r\nNever one to leave her lover unsatisfied, Alexa takes the first opportunity to get Van's pants off so that his rock hard cock springs free. The moment Van's dick pops out, Alexa eagerly takes him into her mouth. She starts out guiding her treat with her hands, but soon she has started working Van's stiffie with just her mouth so that he can pump his hips to fuck her mouth.\r\n\r\nWhen Alexa can not stand another moment without having her pussy pounded, she stands up and peels off her lingerie. Nude, she climbs into Van's lap and slides down until he is fully inside of her. Leaning forward so that she can lock eyes with her lover, Alexa gradually starts moving her hips while enjoying the intimate fullness. They take their time, reveling in the closeness until Alexa is ready to pick up the pace.\r\n\r\nReady to switch things up, Alexa climbs off of Van and then settles down on the couch on her knees so that she is supported by the couch's back. Van can take a hint, so he arranges himself behind his lovely coed to enter her from behind. His strokes are firm and long, delivering exactly the friction that Alexa craves. Soon they have settled into a rhythm that hits all the right spots for Alexa so that she explodes in passion.\r\n\r\nFlipping onto her side, Alexa cuddles up to Van so that he can spoon with her while continuing to pump her pussy. With Van's strong hands squeezing her small tits and his cock ramming in and out of her twat, Alexa can not hold back her screams of ecstasy. It's not long before her whole body is quivering with completion.\r\n\r\nKnowing that Van has brought her off twice but has not cum himself, Alexa dedicates herself to helping him finish. She uses her hands and mouth to their best potential, stroking and sucking until Van delivers a hot load of cum for Alexa to suck clean. As a reward for her hard work, Van urges Alexa up onto the top of the couch so that he can spend a few more moments lapping at her pussy to drive her to one final climax that leaves her fully sated.\r\n\r\nVideo Quality: SiteRip\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 960x540 23.976fps 2186kbps\r\nAudio: AAC 44100Hz stereo 109kbps","torrent":{"xt":"urn:btih:d59773bd2be513f6d2a14a45815b47e7f89d80fd","amp;dn":"%5BNubileFilms+NubilesNetwork%5D+Alexa+Grace+%28Full+Of+Grace+29.03.16","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d59773bd2be513f6d2a14a45815b47e7f89d80fd","infoHashBuffer":{"type":"Buffer","data":[213,151,115,189,43,229,19,246,210,161,74,69,129,91,71,231,248,157,128,253]},"announce":[],"urlList":[]}}