{"title":"PTSD Paid To Suck Dick (NEW 2016 Desperate Pleasure) [Split Scen","uid":13926711,"size":831148054,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d70d83b3170762eaed8afa199286719d43380554&amp;dn=PTSD+Paid+To+Suck+Dick+%28NEW+2016+Desperate+Pleasure%29+%5BSplit+Scen&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Programsmith","files":4,"time":1458386600,"description":"gallery and description:\r\n\r\n \nhttp://imageview.me/viewer.php?file=8nhox2135p.jpg\r\n \nhttp://imageview.me/viewer.php?file=nwmk6iuyc3.jpg\r\n \nhttp://imageview.me/viewer.php?file=133bd0zkd7.jpeg\r\n \nhttp://imageview.me/viewer.php?file=im32y5tszc.jpeg\r\n\r\n\r\nReleased: 2016\r\nCountry: USA\r\nStudio: Desperate Pleasures\r\nGenre: Blowjobs, Handjobs, Cumshots\r\nDuration: 1 hrs. 40 mins.\r\n\r\nStarring: Lauren Phillips, Jenna J. Foxx, Anastasia Rose, Zoey Carter.\r\n\r\nDescription: Every woman has a price and we love finding it! When you're at a porn convention with very little time the best way to relax is a nice sloppy blowjob from a pornstar and there no shortage of chics you can pay to suck dick !! Lauren Phillips - During AVN show, Phil ran into Lauren on the floor. They seemed to hit it off pretty well. He told me he wanted to have some fun with her so I told him he could use the room. Needless to say things went exactly as planned. Phil took her up to the room and after a nice oral session he blew his load all over her massive tits. Jenna J. Foxxx - I ran into Jenna at the booth and she looked soo hot I almost blew my load right there. Jenna was more than willing to join the PTSD ranks. The minute my cock was out she sucked like there was no tomorrow. I even got to fuck her massive tits for a bit. It did not take long for me to cover her DD's in a big load. Anastasia Rose - I was leaving for the airport when Anna hit me up for a ride. On the way there she told me she lost most of her money gambling. Not one to leave a damsel in distress I offered her a few bucks to blow me. Anna agreed and man it was so intense getting her to suck me while the crew and the driver watched. Zoey Carter - My assistant told me she had a few unexpected expenses and wanted to get PTSD too. Obviously, I could not say no. Zoey teased and sucked my cock and kept me on edge for over 20 minutes before I gave her a hot oral creampie. I wonder who's gonna get Paid To Suck Dick next?","torrent":{"xt":"urn:btih:d70d83b3170762eaed8afa199286719d43380554","amp;dn":"PTSD+Paid+To+Suck+Dick+%28NEW+2016+Desperate+Pleasure%29+%5BSplit+Scen","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d70d83b3170762eaed8afa199286719d43380554","infoHashBuffer":{"type":"Buffer","data":[215,13,131,179,23,7,98,234,237,138,250,25,146,134,113,157,67,56,5,84]},"announce":[],"urlList":[]}}