{"title":"Lesbian Adventures 10: Strap-On Specialists","uid":13942847,"size":907575979,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d8113efcd5c5565db102df20a0762966bc21c61c&amp;dn=Lesbian+Adventures+10%3A+Strap-On+Specialists&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hunter534","files":1,"time":1458479790,"description":"In this installment of Strap-On Specialists, older women show younger girls how strap-on sex can bring them even more intense orgasms. Lesbian Adventures # 10: Strap-On Specialists porn Eccentric human sexuality professor Nina Hartley breaks in her new teaching assistant, Sara Luvv, by showing the young girl how lots of oral sex and strap on penetration are a recipe for success. Lesbian Adventures # 10: Strap-On Specialists DVD video Bratty Janice Griffith loathes her mom's girlfriend Aiden Starr, and after Aiden catches Janice making fun of her, the older woman uses her strap on to teach Janice a valuable lesson in respect. Lesbian Adventures # 10: Strap-On Specialists movie Karlee Grey comes home from school early and finds stepmom Mercedes wearing a strap on. Lesbian Adventures # 10: Strap-On Specialists adult DVD After Mercedes explains to Karlee that the strap on was meant as a surprise for her husband, she shows the teen that strap on sex is perfectly natural. Lesbian Adventures # 10: Strap-On Specialists buy Finally, building contractor Dana Vespoli is dismayed to find her clients are not home, instead leaving their spoiled daughter Aria Alexander to oversee everything. Lesbian Adventures # 10: Strap-On Specialists porn Dana goes head to head with the young girl, finishing off with a strap on surprise.\r\n\r\nCast: Nina Hartley, Sara Luvv, Dana Vespoli, Aiden Starr, Mercedes Carrera, Janice Griffith, Karlee Grey, Aria Alexander\r\n\r\nCOVER+SCEENSHOT:\r\n \nhttp://photo-up.info/img-56ee9457635a1.html \r\n \nhttp://photo-up.info/img-56ee9479f17c7.html","torrent":{"xt":"urn:btih:d8113efcd5c5565db102df20a0762966bc21c61c","amp;dn":"Lesbian+Adventures+10%3A+Strap-On+Specialists","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8113efcd5c5565db102df20a0762966bc21c61c","infoHashBuffer":{"type":"Buffer","data":[216,17,62,252,213,197,86,93,177,2,223,32,160,118,41,102,188,33,198,28]},"announce":[],"urlList":[]}}