{"title":"Jon Hein - Fast Food Maniac: From Arby's to White Castle","uid":13859865,"size":153886008,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d92e864a5f809a7df2ee824a0e1a6ca7f85196cc&amp;dn=Jon+Hein+-+Fast+Food+Maniac%3A+From+Arby%27s+to+White+Castle&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Dr.Soc","files":1,"time":1458024741,"description":"Jon Hein, &quot;Fast Food Maniac: From Arby's to White Castle, One Man's Supersized Obsession with America's Favorite Food&quot;\r\nISBN: 0553418033 | 2016 | EPUB | 288 pages | 147 MB\r\n\r\n\r\nThe beloved personality from The Howard Stern Show celebrates American fast food, exploring the history and secret menu items of both national and regional chains, ranking everything from burgers and fries to ice and mascots, and offering his own expert tips on where to go and what to order. \r\n\r\nJon Hein is the ultimate fast food maniac, and in this book he draws on his extensive knowledge of, and love for, both nationwide chains and regional gems, from McDonald’s and KFC to In-N-Out Burger and Carvel. He digs into their origin stories; reveals secret menu items; includes best lists for everything from fried chicken and shakes to connoisseur concerns such as straws and biscuits; takes a nostalgic look back at the best giveaways, slogans, and uniforms; and even provides a battle-tested drive-thru strategy. With behind-the-counter looks at places like the Dunkin' Donuts headquarters and Nathan's original hot dog stand, Fast Food Maniac is the definitive, cross-country guide to some of America's best-loved guilty pleasures","torrent":{"xt":"urn:btih:d92e864a5f809a7df2ee824a0e1a6ca7f85196cc","amp;dn":"Jon+Hein+-+Fast+Food+Maniac%3A+From+Arby%27s+to+White+Castle","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d92e864a5f809a7df2ee824a0e1a6ca7f85196cc","infoHashBuffer":{"type":"Buffer","data":[217,46,134,74,95,128,154,125,242,238,130,74,14,26,108,167,248,81,150,204]},"announce":[],"urlList":[]}}