{"title":"The Upperfloor--tUF-39656 Charlotte Cross, Nikki Knightly, Aiden","uid":13683660,"size":3763870578,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d9a9426ced1e424b0f18973611e53b9ffb1e7356&amp;dn=The+Upperfloor--tUF-39656+Charlotte+Cross%2C+Nikki+Knightly%2C+Aiden&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":86,"time":1456526584,"description":"\nHot Slave Girls Degraded, Fisted &amp; Fucked\r\n\r\nFeb 26, 2016 - Performers: Aiden Starr ,  Bill Bailey ,  Nikki Knightly  and  Charlotte Cross \r\n\r\n\r\nMed, Hi and HD MP4 + Pics.\r\n\r\n\r\nTwo pieces of fine slave flesh are up for consideration. On hand we have busty blond powerhouse dominatrix Aiden Star to run these sluts through the ringer and decide who should join the sex slave stock for good. The swinger party is packed with gorgeous women playing with their dominants and submissives. Meanwhile good girl Charlotte Cross and nymphomaniac Nikki Knightly are tied tightly to a post and made to choke on cock and lick ass while interrogated. Once Aiden has the answers she is looking for both slaves are made to cum for the crowd's amusement. \r\n\r\nSecond trial of the evening finds the ladies tied with their legs back and hands latched down to a box in tight rope bondage. Unable to get away, they are punished and fucked in turn with hard cocks, vibrators, electrical shockers, and a pile of canes. Both ladies beg for punishment and pleasure until the whole scene devolves into a fuck pile with Aiden cumming on top. \r\n\r\nSo far both slave wannabes are neck in neck, so The Upper Floor classic is deployed: The Tray Test. Both slaves are handed their object of desire, a slave collar, and told to the hold the trays until one of them must drop it from physical exhaustion. To make the game more fun vibrators are attached to both their dripping wet pussies, and they are made to cum uncontrollably for the laughing audience. Both ladies quiver in agony, pushing their athletic abilities and self control until one drops. \r\n\r\nOnce the new slave girl had won her collar she is rewarded with a rough fucking with a hard cock while the loser gets strap on plowed and has Aiden sit on her loser face. The night ends with fisting, squirting, and lot of hot cum swapped. Well done ladies. \r\n\r\nScreens \nhttp://www.theupperfloor.com/site/shoot.jsp?shootId=39656\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n20 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:d9a9426ced1e424b0f18973611e53b9ffb1e7356","amp;dn":"The+Upperfloor--tUF-39656+Charlotte+Cross%2C+Nikki+Knightly%2C+Aiden","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9a9426ced1e424b0f18973611e53b9ffb1e7356","infoHashBuffer":{"type":"Buffer","data":[217,169,66,108,237,30,66,75,15,24,151,54,17,229,59,159,251,30,115,86]},"announce":[],"urlList":[]}}