{"title":"Ben Dover - The British Connection (1997)","uid":13769046,"size":2447386411,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:dba9dc8acc0f60e1dc7b802da4ecb9a90755da91&amp;dn=Ben+Dover+-+The+British+Connection+%281997%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Rantlercat","files":1,"time":1457276831,"description":"In mp4 format optimised for iTunes and AppleTV, with metadata.\r\n\r\nHardcoded Dutch subtitles.\r\n\r\n------\r\n\r\nFirst on Ben's list is Jackie a naive 18 year old brunette who is met at one of London's busiest train stations by Ben and his friends, Omar and Valentino. Jackie gives in to Ben's chat and soon afterwards is eagerly taking Omar's enormous black cock up her ass, with Valentino's monster cock in her pussy and Ben's massive cock in her mouth!\r\n\r\n Next Ben meets up with Vanessa, an 18 year old temptress who admits to never having had a good fuck. Ben soon obliges! Ben gives Vanessa the afternoon of a lifetime as she takies two cocks in her tight little pussy at the same time!\r\n\r\n Next on Ben's agenda is Jessica, a 18+ reporter, who came to interview Ben and super Mario in their hotel room, however, the lovely reporter doesn't get the opportunity to ask too many questions before Super Mario and Ben fill up her mouth with cock and cover her face with in cum!\r\n\r\n Last but not least is Charlotte, a randy redhead who works in a scrap yard. The buxom beauty is hard at work when the boys track her down and expertly persuade her to bend over, drop her knickers and welcome Super Mario's hard dick up her ass!\r\n It's more real raw raunch from Ben Dover, the Prince of tease and sleaze!","torrent":{"xt":"urn:btih:dba9dc8acc0f60e1dc7b802da4ecb9a90755da91","amp;dn":"Ben+Dover+-+The+British+Connection+%281997%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dba9dc8acc0f60e1dc7b802da4ecb9a90755da91","infoHashBuffer":{"type":"Buffer","data":[219,169,220,138,204,15,96,225,220,123,128,45,164,236,185,169,7,85,218,145]},"announce":[],"urlList":[]}}