{"title":"[Fake Hospital] Mar 18, 2016 Luke (Nurse fucked hard by patient","uid":13941925,"size":996776293,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:ddc81290e07423f8917040b1466e1fa5239eb426&amp;dn=+%5BFake+Hospital%5D+Mar+18%2C+2016+Luke+%28Nurse+fucked+hard+by+patient&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LucasCar","files":1,"time":1458470082,"description":"My boyfriend is away at the moment working abroad. I was in the middle of taking a couple of saucy selfies to send him when a patient walked in without knocking! How rude! Being a consummate professional though, I ran back over my desk and saw to him immediately, even though he was here to see the doctor. We went over his problem, he was having bad back pain after an accident at work. I thought it would be best to take a closer look. I went round to him and removed his shirt. He was covered in tattoos! I LOVE tattoos! It instantly remind me of all my past lovers, something I always look out for! Anyway, as I was rubbing him down, I was getting hornier and hornier! I started to kiss him gently, he didnt quite know what to do! But I just showed him what would really make him forget about his back trouble. I whipped off my outfit, went down on my knees and started playing with then sucking his dick! Oh my God it was so amazing! But I didnt want him to have all the fun, I wanted him to lick my wet pussy! I got on the examination table and let him get to it! Not long after I was ready for him to fuck me! He got up and thrust his cock deep inside me! This guy had a lot of energy to burn! I got up, ran over to the desk and bent over. An invitation I know he wont be able to resist! He fucked me so hard, pounding his dick in to my pussy! I even let him choose where he wanted to cum.\r\n \nhttp://naughtyimage.com/img-56ee6d81854a8.html\r\n \nhttp://naughtyimage.com/img-56ee6d863754f.html","torrent":{"xt":"urn:btih:ddc81290e07423f8917040b1466e1fa5239eb426","amp;dn":"+%5BFake+Hospital%5D+Mar+18%2C+2016+Luke+%28Nurse+fucked+hard+by+patient","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddc81290e07423f8917040b1466e1fa5239eb426","infoHashBuffer":{"type":"Buffer","data":[221,200,18,144,224,116,35,248,145,112,64,177,70,110,31,165,35,158,180,38]},"announce":[],"urlList":[]}}