{"title":"Boobtown (1995) (US)","uid":14011905,"size":406190242,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e00ca18598d68935420ae1852dc954244ca0225b&amp;dn=Boobtown+%281995%29+%28US%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"distinc","files":1,"time":1458837712,"description":".......:::Screenshots:::.......\r\n\r\n\r\n \nhttp://imagedisco.net/?v=485047182\r\n \nhttp://imagedisco.net/?g=8135055932\r\n\r\nSteven St. Croix has the gorgeous Taylor Hayes for a girlfriend - but he's still not happy! Insane, you would say? Certainly-but that's what happens when a man can't get the image of huge, bouncing breasts out of his mind. Fortunately for Steve he meets up with a man of dubious magical powers (Tom Byron) who gives him a very special pair of sunglasses. Once on, the glasses transport Steve to a miraculous land of massive mammaries – and the chicks attached to them. You know the old saying, &quot;Watch what you wish for - you might just get it&quot;? Yeah, well, Steve gets his wish - in more ways than one!\r\n\r\n\r\nSteven St. Croix's obsession with huge tits forces him toward a life of quiet desperation -- his natural-breasted girlfriend (Taylor Hayes) just can't embody his dream. Jacking off to a porn loop featuring Nicole London and Olivia provides relief when Olivia rams a vibe up Nicole's asshole.\r\nTom Byron provides the answer to Steven's desires; a pair of magic shades that'll transport him to Boobtown, where all the women have mammoth manmades. Sexual highlights? There are no bad scenes, but Taylor Hayes' separate trysts with St. Croix and Byron are standouts; what a b.j. technique she's got!\r\nWhen the girls of Boobtown decide they want &quot;small tits&quot; like Taylor's Steven saves the male fantasy. Although a few scenes seem a bit short, the sex sizzles and Byron's tale of the history of Boobtown is classic","torrent":{"xt":"urn:btih:e00ca18598d68935420ae1852dc954244ca0225b","amp;dn":"Boobtown+%281995%29+%28US%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e00ca18598d68935420ae1852dc954244ca0225b","infoHashBuffer":{"type":"Buffer","data":[224,12,161,133,152,214,137,53,66,10,225,133,45,201,84,36,76,160,34,91]},"announce":[],"urlList":[]}}