{"title":"Polymer Nanocomposite Foams - Vikas Mittal","uid":13926500,"size":15040542,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e25443011e92e2b1dc389961df167e1a8770c870&amp;dn=Polymer+Nanocomposite+Foams+-+Vikas+Mittal&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1458384718,"description":"ISBN 9781466558137\r\n\r\nAdvancements in polymer nanocomposite foams have led to their application in a variety of fields, such as automotive, packaging, and insulation. Employing nanocomposites in foam formation enhances their property profiles, enabling a broader range of uses, from conventional to advanced applications. Since many factors affect the generation of nanostructured foams, a thorough understanding of structure–property relationships in foams is important. Polymer Nanocomposite Foams presents developments in various aspects of nanocomposite foams, providing information on using composite nanotechnology for making functional foams to serve a variety of applications.\r\n\r\nFeaturing contributions from experts in the field, this book reviews synthesis and processing techniques for preparing poly(methyl methacrylate) nanocomposite foams and discusses strategies for toughening polymer foams. It summarizes the effects of adding nanoclay on polypropylene foaming behavior and describes routes to starch foams for improved performance. The books also reviews progress in achieving high-performance lightweight polymer nanocomposite foams while keeping desired mechanical properties, examines hybrid polyurethane nanocomposite foams, and covers polymer–clay nanocomposite production.\r\n\r\nThe final chapters present recent advances in the field of carbon nanotube/polymer nanocomposite aerogels and related materials as well as a review of the nanocomposite foams generated from high-performance thermoplastics. Summing up the most recent research developments in the area of polymer nanocomposite foams, this book provides background information for readers new to the field and serves as a reference text for researchers","torrent":{"xt":"urn:btih:e25443011e92e2b1dc389961df167e1a8770c870","amp;dn":"Polymer+Nanocomposite+Foams+-+Vikas+Mittal","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e25443011e92e2b1dc389961df167e1a8770c870","infoHashBuffer":{"type":"Buffer","data":[226,84,67,1,30,146,226,177,220,56,153,97,223,22,126,26,135,112,200,112]},"announce":[],"urlList":[]}}