{"title":"Bekenntnisse des Hochstaplers Felix Krull (2_5) DSR.mkv","uid":13620203,"size":1657240666,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e47b38fa1457ea652b1f5dfcc2b530b4a7af87a8&amp;dn=Bekenntnisse+des+Hochstaplers+Felix+Krull+%282_5%29+DSR.mkv&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"salsasat","files":1,"time":1455964268,"description":"A German soldier sent to Paris during World War I. He casts aside his uniform and gets a job as an elevator operator. A handsome lug, pursued by virtually every female who enters his little compartment. But the lad is shy, and besides, he'd rather discuss anthropology.\r\n\r\nDeutsche Erstausstrahlung: 24.01.1982 (ZDF)\r\nSpielfilm in 5 Teilen\r\n\r\nFolge 2\r\n\r\nMit seiner Mutter und seiner Schwester Olympia lebt Felix jetzt in Frankfurt. Dort hat die Familie die Pension Loreley eröffnet. Bei einem seiner nächtlichen Streifzüge lernt Felix Rozsa kennen, eine jener Damen, die Leidenschaft und Geschäft miteinander zu verbinden wissen. Rozsa behält Felix als Hausgeliebten und Herzensfreund - Eine schlimme Liebesschule, durch die Felix da gehen muß, der er sich je- doch gelehrig hingibt. Doch als Rozsa ihn dann zum Beschützer und Gigolo ausbilden will, fühlt er sich dieser Rolle nicht gewachsen. Doch hat sich ihm, zum Glück, eine andere Karriere eröffnet: durch die Vermittlung seines Paten Schimmelpreester kann er in dem berühm- ten Hotel de Paris in Monte Carlo eine Hotel- und Kellnerlaufbahn an- treten. Doch bevor Felix an die neue Aufgabe herangehen kann, müssen seine Militärverhältnisse geklärt werden. Er macht sich denn ans Werk - streng wissenschaftlich-, um für die Verzauberung der militäri- schen Aushebungskommission aufs Gewissenhafteste vorbereitet zu sein. Als Felix schließlich ausgemustert wird, kann er bald mit gutem Gewissen in den Zug nach Monte Carlo steigen ... DarstellerInnen: John Moulder Brown (Felix), Despina Pajanou (Rozsa), Daphne Wagner (Mutter Krull), Mareike Carriere (Olympia), Nikolaus Paryla (Schimmelpreester), Kurt Raab (Sally Meerschaum), Franz Rudnick (Stabsarzt), Benno Hoffmann (Reicher Freier), Rainer Penkert (Juwelier), Wolfgang Dauscha (Kommissar), Freddy Unger (Salvatore), Michael Janisch (Portier), Peter Frick (Harry), Richard Kogel (Orloff).\r\nText: ORF III\r\n\r\nmit John Moulder-Brown (Felix), Oliver Wehe (Felix als Kind), Klaus Schwarzkopf (Vater Krull), Despina Pajanou (Rosza), Daphne Wagner (Mutter Krull), Nikolaus Paryla (Schimmelpreester), Mareike Carrière (Olympia), Kurt Raab (Sally Meerschaum), Franz Rudnick (Stabsarzt), Benno Hoffmann (Reicher Freier), Magali Noël (Mme Houpflé), Hans Heinz Moser (Herr Sturzil), Pierre Doris (Detective), Alain Flick (Monsieur Machatschek), Franziska Walser (Genoveva), Rolf Zacher (Stanko), Rita Tushingham (Mrs. Twentyman), Vera Tschechowa (Maria Pia), Georgia Slowe (Zouzou), Fernando Rey (Professor Kuckuck) Musik: Nikos Mamangakis Kamera :Dietrich Lohmann, Produzent :Peter Märthesheimer, Schnitt :Susan Berthel-Ying\r\n\r\nRegie: Bernhard Sinkel","torrent":{"xt":"urn:btih:e47b38fa1457ea652b1f5dfcc2b530b4a7af87a8","amp;dn":"Bekenntnisse+des+Hochstaplers+Felix+Krull+%282_5%29+DSR.mkv","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e47b38fa1457ea652b1f5dfcc2b530b4a7af87a8","infoHashBuffer":{"type":"Buffer","data":[228,123,56,250,20,87,234,101,43,31,93,252,194,181,48,180,167,175,135,168]},"announce":[],"urlList":[]}}