{"title":"Full House Season 1","uid":13690103,"size":6630184077,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e760f1cdbde01f323a8d3e8d3691f80ecc18802a&amp;dn=Full+House+Season+1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"house1997","files":28,"time":1456598439,"description":"Fuller House (2016)\r\n20 years has passed and the Tanner Clan are within their final days before parting their home permanently. Danny has since remarried and prepares to move. He and Rebecca has gotten a new job offer to work in LA to start a new morning show, Uncle Jesse heads to LA to be with Becky as well as start a new musical job, Nick &amp; Alex (the twins) are now in college, Uncle Joey has gotten a job as a live comedian act in Las Vegas, Stephanie now has a successful DJ career, taking her sister's name as &quot;DJ Tanner,&quot; and Michelle is out in New York focusing on her fashion career (much to the family's chagrin). With the entire family taking major directions away from their house, Danny has opted to sell their home, ending the Tanner Household. However, fate would change with D.J.\r\n\r\nD.J. became an animal vet and started a family with her husband, Tommy Fuller (a firefighter). Together, they have three boys: Jackson, Max, and Tommy Junior. Unfortunately, Tommy died in the line of duty a year earlier and D.J. has been taking refuge back at the Tanner House until she can figure things out. Too proud to admit she is struggling to find stability and balance within her life, she admitted her troubles to her baby and the family overheard her real feelings and decided to help her; the house now belongs to D.J. and the Fuller boys, making it the Fuller House.\r\n\r\nIn between, Kimmy Gibbler got married to Spanish car racer, Fernando, and the two have a daughter together, Ramona. Unfortunately, Fernando wasn't a loyal husband and Kimmy has caught him cheating on her multiple times, prompting her to divorce him. However, despite the multiple infidelities, Kimmy still have feelings for Fernando and he tries hard to win back Kimmy's feelings.\r\n\r\nWhen the entire clan heard of D.J.'s plight, the entire family suddenly volunteered to stay behind to help D.J., but D.J. herself couldn't allow the entire clan to make such a sacrifice for her. However, Stephanie had no major obligations and decided to put her DJ career on hold to help D.J. manage the house. Shortly not long, Kimmy Gibber and Ramona, also moved together with the Fuller family as additional support.\r\n\r\nLife would get interesting for D.J. when she meets Matt at the vet and her ex, Steve. Both men are interested in her and both are vying for her affection. D.J. herself has been undecided as she likes both men. Although it created a rift, the men agreed to give D.J. the time she needs to make a final decision.\r\n\r\nAs for Stephanie, despite have a party girl life style, she ultimately learned she wanted more stability and helped D.J. out with the boys. Because of Tommy's death, she never had the chance to tell D.J. and the family that she discovered she's incapable of having children. Struggling with the idea of never able to have a family of her own, Stephanie takes some comfort she's helping D.J. raise the Fuller boys as she attempts to find someone herself.\r\n\r\nThe story ends with Uncle Jesse and Aunt Becky coming back into town to renew their vows. Kimmy and Fernando recently got back together and Fernando promises to make things different; the two are doing a double-wedding with Jesse and Becky with Uncle Joey as the presider. With Kimmy back with Fernando, it would mean Ramona and Kimmy would leave to be with Fernando on his career on the racing circuit. However, in the final moments, Kimmy realizes her being with the girls the the life she has built means a lot greater than following Fernando's career; the two agreed to remain engaged, but not re-married until they can sort out the details. As for D.J., she couldn't make a final decision between Steve and Matt; D.J. realizes she's still not ready for a relationship and decided to put things off with the both of them. Kimmy, Stephanie, and D.J. celebrate as the ladies are still together.\r\n\r\nCandace Cameron Bure as D.J. Tanner\r\nAndrea Barber as Kimmy Gibbler\r\nJodie Sweetin as Stephanie Tanner\r\nSoni Nicole Bringas as Ramona Gibbler\r\nMichael Campion as Jackson Fuller\r\nElias Harger as Max Fuller\r\nDashiell and Fox Messitt as Tommy Fuller, Jr","torrent":{"xt":"urn:btih:e760f1cdbde01f323a8d3e8d3691f80ecc18802a","amp;dn":"Full+House+Season+1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e760f1cdbde01f323a8d3e8d3691f80ecc18802a","infoHashBuffer":{"type":"Buffer","data":[231,96,241,205,189,224,31,50,58,141,62,141,54,145,248,14,204,24,128,42]},"announce":[],"urlList":[]}}