{"title":"Torrns","uid":13867812,"size":351862,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:edb3b977cc0949b9b46552c2da6191cecd60750f&amp;dn=Torrns&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"amondo3","files":18,"time":1458081228,"description":"Jack är trettioåtta år och kör långtradare tvärs genom Europa. En dag får han veta att hans åkeri blivit uppköpt av ett stort utländskt företag som heter Eddie Herz. Till en början oroar han sig inte över det. Men efter en tid får han veta att man anlitar chaufförer från de forna öststaterna som knappt får någon lön. Och snart står det klart att Eddie Herz använder sig av skumma metoder på många områden. Jack börjar ana att det är ett brottssyndikat snarare än ett åkeri han jobbar för.\r\n Fast frågan är om han kan göra någonting åt det. Jack ställer sig skeptisk då klubbordföranden på åkeriet ber honom ta med ett kuvert med graverande uppgifter om företaget till en facklig funktionär i Tyskland. Men han bestämmer sig ändå för att ställa upp. Det visar sig att uppdraget är långt mer riskfyllt än han kunnat ana. Jack blir skuggad och hotad och när till och med hans familj dras in känner han att katastrofen närmar sig.\r\n\r\nTaxfree är en hyperaktuell och spännande roman om arbetsförhållanden i det nya gränslösa Europa. Det är också en stark och känsloladdad skildring av en långtradarchaufförs tunga vardag och om kollisionen mellan kärlek, vänskap och politisk övertygelse. Boken är en fristående fortsättning på David Ericssons förra roman Redlight som utkom 2001.\r\n\r\nDavid Ericsson är född 1958 och har kört långtradare inom och utom Sverige i mer än tjugo år. Han debuterade 1999 med den mycket uppmärksammade novellsamlingen Truck stop och 2001 utkom romanen Redlight.\r\n\r\n &quot;Skulle något filmbolag nappa på Taxfree så finns det fina möjligheter att utveckla manuset till en film som kan bli en svensk motsvarighet till truckfilmsklassikern Konvoj&quot;\r\n Jacques Wallner, DN motor \r\n\r\n &quot;Om vitsen ursäktas så saknar David Ericsson böcker om långtradarlivet faktiskt transportsträckor.&quot;\r\n Björn Gunnarsson, Göteborgs-Posten","torrent":{"xt":"urn:btih:edb3b977cc0949b9b46552c2da6191cecd60750f","amp;dn":"Torrns","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edb3b977cc0949b9b46552c2da6191cecd60750f","infoHashBuffer":{"type":"Buffer","data":[237,179,185,119,204,9,73,185,180,101,82,194,218,97,145,206,205,96,117,15]},"announce":[],"urlList":[]}}