{"title":"Adventures of Mana v1.0.5 mod and data","uid":13907626,"size":407286293,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:ee705c059d593894980523e4c4c3693028568c5b&amp;dn=Adventures+of+Mana+v1.0.5+mod+and+data&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":3,"time":1458280227,"description":"Relive the excitement of Final Fantasy Adventure―a timeless classic remastered for a new generation.\r\n\r\n■STORY \r\nEnshrined atop Mt. Illusia, high above the lofty clouds, stands the Tree of Mana. Drawing its life energy from the boundless celestial aether, the sentinel grows in silence. Legend holds that he who lays his hands upon its trunk will be granted power eternal―a power the Dark Lord of Glaive now seeks to further fuel his bloody quest for domination.\r\n\r\nOur unlikely hero is one of countless gladiators indentured to the Duchy of Glaive. Each day, he and his ill-fated companions are dragged from their cells and bade to fight exotic beasts for the amusement of the Dark Lord. If victorious, they are thrown back into the dungeons with just enough bread to tide them over until their next match. But a body can only take so much, and it is never long before the weary captives succumb to their cruel fates.\r\n\r\n■SYSTEM\r\nAdventures of Mana's battle system grants you the freedom to move about the playing field without restriction, allowing for thrilling combat in which you decide when to attack and how to evade.\r\n\r\n・Controls\r\nPlayer movement is achieved via a virtual joystick accessible anywhere on the screen. An auto-adjust feature has also been added so that even if your thumb strays from its original position, you will never lose control of the hero.\r\n\r\n・Weapons\r\nWeapons are divided into six unique categories, some with uses beyond merely dealing damage. Determining when and where to equip each kind will prove the key to success on your quest.\r\n\r\n・Magic\r\nFrom restoring lost HP or removing various ailments, to rendering foes incapacitated or dealing deadly blows, there are eight different spells for almost any occasion.\r\n\r\n・Obstacles\r\nBloodthirsty enemies are not the only things standing in the way of completing your quest. You will need both tools and your wits to overcome the many challenges encountered in the world of Mana, ranging from locked doors to hidden rooms to traps growing progressively more complex as the game progresses.\r\n\r\nWhat’s new:\r\n- minor bug fixes\r\n\r\nWhat's in the mod:\r\nFree Shopping\r\n\r\nInstall APK,Place data folder in SDCard/Android/Obb/ and play\r\nRequires Android OS 2.3 and up","torrent":{"xt":"urn:btih:ee705c059d593894980523e4c4c3693028568c5b","amp;dn":"Adventures+of+Mana+v1.0.5+mod+and+data","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee705c059d593894980523e4c4c3693028568c5b","infoHashBuffer":{"type":"Buffer","data":[238,112,92,5,157,89,56,148,152,5,35,228,196,195,105,48,40,86,140,91]},"announce":[],"urlList":[]}}