{"title":"Abu Bakr Assaddik the 1st Caliph (20 books)","uid":13738129,"size":63537212,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eefb074d823221651878a3e2b64f4cb625ca68de&amp;dn=Abu+Bakr+Assaddik+the+1st+Caliph+%2820+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SamirDZ2","files":21,"time":1457055274,"description":"Language: English\r\nFormat: pdf\r\n..........................\r\n\r\nAbu Bakr was always a very close Companion of the Holy Prophet, he knew him better than any other man. He knew how honest and upright the Prophet was. Such knowledge of the Prophet made Abu Bakr be the first man to follow the Message of Prophet Muhammad sallallahu 'alayhi wa sallam. He was indeed the first adult male to accept Islam.\r\n\r\nThe Holy Prophet told Abu Bakr what had happened at Mount Hira', he told him that Allah subhanahu wa ta'ala had revealed to him and made him His Messenger. When Abu Bakr heard this from the Prophet sallallahu 'alayhi wa sallam, he did not stop to think, he at once became a Muslim. He submitted to Islam with such determination that once the Holy Prophet himself remarked, &quot;I called people to Islam, everybody thought over it, at least for a while, but this was not the case with Abu Bakr, the moment I put Islam before him, he accepted it without any hesitation.&quot; He was titled as-Siddiq by the Prophet because his faith was too strong to be shaken by anything.\r\n\r\nIn fact, Abu Bakr was more than a great believer, as soon as he became a Muslim, he immediately began to preach Islam to others. Among those who accepted Abu Bakr's invitation to Islam were 'Uthman, Az-Zubayr, Talhah, 'Abdur-Rahman ibn Awf, Sa'ad ibn Waqqas and others who later became the pillars of Islam.\r\n\r\nAbu Bakr's love of the Prophet sallallahu 'alayhi wa sallam was so great that he was willing to sacrifice his life for the sake of protecting and comforting the Prophet saw. Such love and sacrifice were demonstrated when one day the Holy Prophet was saying his prayers in the Ka'bah, while some of the chiefs of Makkah were sitting in the court yard of the Ka'bah. Seeing the Prophet praying, 'Uqbah ibn Abi Mu'it took a long piece of cloth and put it around the Prophet's neck and twisted it hard in an attempt to strangle the Prophet sallallahu 'alayhi wa sallam to death. At that moment Abu Bakr happened to pass by from a distance, he saw 'Uqbah trying to strangle the Prophet to death. Immediately Abu Bakr ran to the help of the Prophet, he pushed 'Uqbah aside and took the cloth from aroundthe Prophet's neck. Thereupon the enemies of Islam came down upon Abu Bakr and beat him unmercifully, although Abu Bakr with faith like a rock did not care for his own suffering, he was glad that he was able to save the Prophet of Allah, even at the risk of his own life.\r\n\r\nAbu Bakr with the wealth he had, also had a major role in freeing some of the Muslim slaves, who were barbarically tortured by their heartless Mushrik masters to give up the faith and return to their masters' beliefs. The heartless monsters tried all kinds of torture: they made them lie all naked on the burning desert sand, putting big stones on their chest, as well as other kinds of torture. Here Abu Bakr's wealth came to the rescue, as he bought the poor helpless slaves from their inhuman masters and set them free, Bilal al-Habashi, the slave of 'Umayyah ibn Khalaf, was among those who were set free by Abu Bakr. Bilal became afterwards the mu'adhin at the Prophet's mosque","torrent":{"xt":"urn:btih:eefb074d823221651878a3e2b64f4cb625ca68de","amp;dn":"Abu+Bakr+Assaddik+the+1st+Caliph+%2820+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eefb074d823221651878a3e2b64f4cb625ca68de","infoHashBuffer":{"type":"Buffer","data":[238,251,7,77,130,50,33,101,24,120,163,226,182,79,76,182,37,202,104,222]},"announce":[],"urlList":[]}}