{"title":"Robertson Davies - The Cunning Man","uid":13744066,"size":3908157,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ef64501503c0e62446ae41b4c7b4d01b061636fb&amp;dn=Robertson+Davies+-+The+Cunning+Man&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mr_mando","files":2,"time":1457104210,"description":"Robertson Davies deftly combines metaphysics, magic, and modern medicine to tell a contemporary story with ancient roots as he introduces healer and &quot;cunning man'' Jonathan Hullah. A &quot;cunning man,'' according to Robert Burton, the noted Arabist, &quot;will help almost all infirmities of body and mind.'' Hullah, as a doctor who deals with that &quot;realm where mind and body mingle,'' is Davies's point man for the book's major theme: the links between the mind and disease, the recognition that &quot;disease is the signal that comes late in the day, that a life has become hard to bear.'' \r\n\r\nHullah, recently retired, prompted by a probing question from a young woman journalist who is writing a series of articles on old Toronto, narrates the story of his life as a modern &quot;cunning man.'' Set in that urbane part of Toronto where art, academe, and old money comfortably mingle, the novel also explores familiar Davies themes of friendship, faith, and art. The journalist wants to know the truth about Father Hobbes, the rector of St. Aidan's who died while celebrating Communion. The old man was rumored to be responsible for miraculous cures. \r\n\r\nHullah, who was present at Hobbes's death but neglected to conduct an autopsy, recalls his own boyhood in the deep Canadian woods, where he was saved from death by a local shaman; his years at prep school, where he met the two great friends of his life, Brocky Gilmartin and Charlie Iredale; his decision to become a doctor; and the war experiences that led him to practice a unique form of healing. \r\n\r\nHullah is a clever man, with many diverting friends, but it is his old friend Charlie, now a devout priest, whose confession most surprises him and best illustrates the ability of both Davies and his characters to conceal cunningly what lurks beneath the surface. Ideas, aphorisms, and wit are as evident as Davies's more teleological concerns, which all makes for a splendid intellectual romp as well as an absorbingly literate novel. Davies at his best","torrent":{"xt":"urn:btih:ef64501503c0e62446ae41b4c7b4d01b061636fb","amp;dn":"Robertson+Davies+-+The+Cunning+Man","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef64501503c0e62446ae41b4c7b4d01b061636fb","infoHashBuffer":{"type":"Buffer","data":[239,100,80,21,3,192,230,36,70,174,65,180,199,180,208,27,6,22,54,251]},"announce":[],"urlList":[]}}