{"title":"Batman v Superman Dawn of Justice 2016 HD-CAM x264 HQMic-CPG","uid":14068499,"size":1331516927,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f0676f8a0953b0c91262ad2a2c72c917e221be7b&amp;dn=Batman+v+Superman+Dawn+of+Justice+2016+HD-CAM+x264+HQMic-CPG&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"xxxlavalxxx","files":4,"time":1459142654,"description":"http://extraimago.com/image/a1xr\r\n \nhttp://www.imdb.com/title/tt2975590/\r\n\r\n\r\nFearing the actions of Superman are left unchecked, Batman takes on the man of steel, while the world wrestles with what kind of a hero it really needs. With Batman and Superman fighting each other, a new threat, Doomsday, is created by Lex Luthor. It's up to Superman and Batman to set aside their differences along with Wonder Woman to stop Lex Luthor and Doomsday from destroying Metropolis.\r\n\r\nDirector: Zack Snyder\r\nWriters: Chris Terrio, David S. Goyer\r\nStars: Ben Affleck, Henry Cavill, Amy Adams \r\nGenres: Action | Adventure | Fantasy | Sci-Fi\r\nCountry: USA\r\nLanguage: English\r\n\r\n\r\nBatman v Superman Dawn of Justice 2016 HD-CAM x264 HQMic-CPG\r\n\r\nVideo: x264 1100kbps HQ-2Pass @25fps\r\nAudio: Mp3 2.0 44khz\r\nLanguage: English\r\nSubtitles: hardcoded English when needed only\r\nSource: thx CPG Friends \r\nSample: 2 included\r\nEncoder: CPG\r\n\r\nNotes:\r\n\r\nWell HOTTEST Movie of the year and here i am with my first Encode of it.\r\ni decided not to do CAMs until line drops but this one might take sometime to show up.\r\n\r\nNow to the encode,\r\n\r\nfor last 2 days i am trying 2 different sources one was filmed in 3D, and second latino, both are unwatchable so i gave up.\r\ntoday i receieve non-3d source from friend, it was ok but as usual heavy work was needed, colors, blurryness, noise, perspective, blah blah blah....\r\n\r\ntook my almost a day but finally got nice a total watchable print. Now audio of unknown was not so good so i used JzyB audio. (thx friend for sharing, audios like yours, who need to spend $ on line lol) \r\nlip sync to my video all the way, audio had some background noise so i replace few seconds at 2 different places with Unknown audio, \r\nI also replace one missing part with 3d version just for few seconds it was important scene so i had to do it. Then i added much needed brightness, work on chroma, movie is almost in dark so i have to work smartly to get the best out of it.\r\n\r\n2 Samples included must check them both.  its more then watchable and you have my permission to have sex with it i don't care but don't post dummy comments its a CAM and very good one.\r\n\r\ni have something in my pocket for line so i will be back  BUT this would do just Fine for Now. actually more then fine if you ask me.\r\n\r\nCheers to fellow groups...\r\n\r\nMovie Review by CPG\r\n(short review by me NO SPOILERS)\r\n\r\nOk, so much hype and it turns out as expected, a good one time entertainment thats it.. some parts are kickass Specially Batman is more regid, agressive and hand to hand fight is pretty impressive But acting wise i believe Ben unable to touch Bale, it think its because Bale had full control over character he develope himself overtime. best part of entire batman appearance is his Voice   on the other hand story has some loop holes as well it might be because its not just a single movie but foundation to many more movies in coming years. Movie begins after Man of Steel events.....Start is good, then its slow, then its slower then its WTF man... and finally wonder woman saves the day.\r\nLesse Eisenberg performance as (Lex Luthor) is Top notch, batman v superman fight is entertaining but not greatest.\r\nin short its good but not enough to be called as Greatest debut of All time. you can say its better then avengers as its more dark but its not better then captain america and i think Captain American Civil War (2016) will beat This Movie.. so Enjoy. 3/5 from me..\r\n\r\n \nhttp://extraimago.com/image/a1xH \nhttp://extraimago.com/image/a1xk \nhttp://extraimago.com/image/a1xo \nhttp://extraimago.com/image/a1xt \nhttp://extraimago.com/image/a1xx \nhttp://extraimago.com/image/a1x6 \nhttp://extraimago.com/image/a1xV \nhttp://extraimago.com/image/a1xu \nhttp://extraimago.com/image/a1xv \nhttp://extraimago.com/image/a1xA","torrent":{"xt":"urn:btih:f0676f8a0953b0c91262ad2a2c72c917e221be7b","amp;dn":"Batman+v+Superman+Dawn+of+Justice+2016+HD-CAM+x264+HQMic-CPG","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0676f8a0953b0c91262ad2a2c72c917e221be7b","infoHashBuffer":{"type":"Buffer","data":[240,103,111,138,9,83,176,201,18,98,173,42,44,114,201,23,226,33,190,123]},"announce":[],"urlList":[]}}