{"title":"911 Deep Investigation","uid":13691992,"size":1192960064,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f06f51e8a39b6debcf9b8b11892ea84a1f7db95c&amp;dn=911+Deep+Investigation&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MatrixSystem","files":1080,"time":1456623877,"description":"INTRODUCTION TO THE FREE\r\n\r\n9-11 FORBIDDEN KNOWLEDGE LIBRARY\r\n\r\nI once saw a film about &quot;The Man Who Predicted 9/11.&quot;\r\n&quot;What?&quot; thought to myself, &quot;How could somebody have known about all this in advance?&quot; Wasn't\r\nit supposed to have been a complete surprise? Furthermore, if this man knew about it - and told\r\nothers so vociferously about it - why was nothing done to stop the attacks; or at the very least, to\r\nsave more lives of the innocent. How could he possibly have known?\r\nThis was to be the beginning of a journey.\r\nI soon learned that many people had known about the impending 9/11 attacks in advance. And\r\nthey knew in detail. Certain key employees at nearly every level of government agencies - that is,\r\nwithin the FBI and CIA - had definitely known about the attacks in advance. Others had\r\nanticipated these attacks for years ahead of time. &quot;The Man Who Predicted 9/11&quot; was not only\r\ncorrect - he was not alone. Why was nothing done? Were the hijackers really so crafty that they\r\nwere known, but had all evaded capture for years?\r\nAlso, looking at the list of perpetrators who were supposed to have hijacked the planes and then\r\nskillfully flown them acrobatically into buildings, I soon discovered that many or even most of\r\nthem were still alive and doing quite well... after their &quot;suicide&quot; missions were complete! Once\r\nthis fact had become undeniable, the FBI abruptly changed tack, declaring that the hijackers had\r\nreally used stolen identities (proposing that the FBI was duped all along) - but then provided no\r\nclue who the hijackers really were. In fact, the 'official list' using the &quot;stolen&quot; identities - officially\r\nacknowledged to be a fiction - remains unchanged. Why?\r\nI began to suspect, as you might also, that the whole story given to us about the events of 9/11\r\nmight be largely fictitious. The extent of the fallacies I did not know. And although I could not\r\nfathom a reason for such deception at the time, this is where the facts were really pointing.\r\nTo be convinced of something so outrageous, I had to see the evidence for myself. I discovered\r\nto my dismay that many of the resources, original news stories, and key documentation were\r\nbecoming harder and harder to get. In fact, it appears that around 2006-2007, a deliberate effort\r\nwas being made to &quot;scrub&quot; many of these documents from the internet. Thanks to just a few\r\ngenerous individuals, copies of these sources were obtained in spite of that, and are preserved\r\nfor you here. Thus, thanks to digital technology and to you, this &quot;scrubbing&quot; of the internet is now\r\nand forever circumvented.\r\n\r\n\r\nINDIVIDUAL FOLDERS AND TOPICS\r\n=============================\r\n1 - Summaries and Analysis of 9-11 Attacks in General\r\n2 - September 11 2001 - Timelines and Facts\r\n3 - Impossibilitiy of the Conventional Hijacker Story\r\n4 - FBI Military FEMA and CIA Foreknowledge of 9-11 Attacks\r\n5 - Insider Trading and Foreknowledge of 9-11 Attacks\r\n6 - Motivations for US Involvement in the 9-11 Attacks\r\n7 - World Trade Center Bombing 1993 - Prelude to 9-11\r\n8 - US Funding Assistance or Planning of the Attacks or Attackers\r\n9 - CIA and Brzezinski Creation of Taliban Mujahideen and Bin Laden\r\n10 - Deliberate Inaction of the US Government\r\n11 - Explanations of WTC Building Collapses\r\n12 - 911 Truth-Analysis Movies\r\n13 - Coverups\r\n14 - Pentagon Attack Impossibilities and Inconsistencies\r\n15 - Orchestration or Falsification of 9-11 Pentagon Attack\r\n16 - Remote Control of Passenjer Jets as Weapons\r\n17 - Unexplained Mysteries of Flight 93\r\n18 - 911 Coincidences\r\n19 - Unaccountable Foreknowledge of 9-11 Attacks\r\n20 - Anthrax Attack Following 9-11\r\n21 - Barack Obama and the 9-11 Attacks\r\n\r\nThe average person cannot take the time to view all these documents. To just get the feel of\r\nwhat is here, look over some of the summaries and timelines in folders #1 and #2. Or perhaps,\r\njust watch the movies in folder #12.\r\nThe normal response, I believe, is to remain skeptical after that. That is exactly why such a large\r\nbody of evidence is included as well. If you then have the time and interest, examine the\r\ndocuments, audio recordings, video, and images for yourself.\r\nThe one thing I urge you to do, even if you do not make much use of it, is simply to keep this\r\ndisk. If possible, share it's contents with others.\r\nThe crime of 9/11 is evidently much, much larger than that of religious bigots lashing out in their\r\nignorance and hatred. Complicity in mass murder is as much a crime as mass murder itself.\r\nIf that complicity is not exposed, those who sought to exploit mass murder for their nefarious\r\npurposes will no doubt become emboldened. And the innocent will again pay for that with their\r\nlives.\r\n\r\nThose who forget history, are doomed to repeat it","torrent":{"xt":"urn:btih:f06f51e8a39b6debcf9b8b11892ea84a1f7db95c","amp;dn":"911+Deep+Investigation","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f06f51e8a39b6debcf9b8b11892ea84a1f7db95c","infoHashBuffer":{"type":"Buffer","data":[240,111,81,232,163,155,109,235,207,155,139,17,137,46,168,74,31,125,185,92]},"announce":[],"urlList":[]}}