{"title":"[Female Agent] Mar 15, 2016 Valentino (Agents wild fuck with Ame","uid":13891578,"size":1412510887,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:f112f2a717a6c499e3f6c54102d454c3c8807898&amp;dn=%5BFemale+Agent%5D+Mar+15%2C+2016+Valentino+%28Agents+wild+fuck+with+Ame&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LucasCar","files":1,"time":1458216742,"description":"I was waiting in my office for the next casting when in walked a very tall American stud. He was wearing a beautiful mink jacket and he looked very unusual for a model, which I suppose was his advantage. There was something about his accent that really got my juices flowing and I wasnt sure if he was telling me the whole truth when he said he had done some naked pictures only in the past. He looked very familiar indeed. I told him I had some erotic work available and he said he was interested so I asked him to remove his clothing so I could see what he looked like. He was slightly reluctant but I think this was mostly an act, he said he had been naked in magazines before. As soon as he was naked he stood before me and began wanking his dick, apologizing that I was so sexy he couldn't help it. He had taken the initiative and now I was going to take his cock. I got on my knees and slid his length into my mouth. He tasted divine, but he really surprised me when he began to fuck me. This stud was crazy with unbelievable stamina and power. He fucked me hard and amazingly fast, I couldn't keep track of the orgasms that were crashing through my body like weaves on the beach. I knew he had to be a porn star, as he sure fucked like one. After I had been seriously fucked by a professional, my legs were jelly and I was unable to keep going. I wanted to see his cumshot and he didn't disappoint, almostcumming to command. What a wild fuck with an American stud, who I knew was lying and that he was clearly a porn star. It's not often you meet a man that can fuck you so amazingly well, almost too good.\r\n \nhttp://naughtyimage.com/img-56ea90fe0ad56.html\r\n \nhttp://naughtyimage.com/img-56ea9104b60bc.html","torrent":{"xt":"urn:btih:f112f2a717a6c499e3f6c54102d454c3c8807898","amp;dn":"%5BFemale+Agent%5D+Mar+15%2C+2016+Valentino+%28Agents+wild+fuck+with+Ame","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f112f2a717a6c499e3f6c54102d454c3c8807898","infoHashBuffer":{"type":"Buffer","data":[241,18,242,167,23,166,196,153,227,246,197,65,2,212,84,195,200,128,120,152]},"announce":[],"urlList":[]}}