{"title":"[NuruMassage / FantasyMassage] Kimmy Granger (Easter Egg Hunt) S","uid":14023899,"size":447471383,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f2c0c86de221499a54dd5518a4d80206861081ba&amp;dn=%5BNuruMassage+%2F+FantasyMassage%5D+Kimmy+Granger+%28Easter+Egg+Hunt%29+S&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"UniX","files":1,"time":1458885354,"description":"[NuruMassage / FantasyMassage] Kimmy Granger (Easter Egg Hunt) SD **NEW MARCH 25,2016**\r\n\r\nscreens;\r\n \nhttp://imgurx.net/share-ACCF_56F4C47A.html\r\n\r\nSince it's Easter, Tony Martinez is lucky that masseuse Kimmy Granger is available at the Nuru Massage. She tells him that she has a little surprise which makes Tony ecstatic, running around looking for hidden Easter eggs. Kimmy laughs because the secretly placed'egg' is inside her pussy! Tony is disappointed as Kimmy walks in and admits he is unable to find any hidden objects...but Kimmy reassures him the surprise will be revealed very soon! She leads Tony towards the shower, lathering up his buff body and stiffening cock, with her hands and mouth. Tony garbs hold of Kimmy's ripe ass and boobs ready to continue his massage in the bathtub. Kimmy takes charge of Tony's hard cock with both hands in the tub, as she strokes his thick shaft and balls. Her mouth pumps up and down his cock and she admits she loves how it feels and decides it's time for his Nuru Massage. She fills the back of her throat with his enormous cock , drenching it with her spit preparing it for her tight pussy. Tony thrusts his cock deep inside if her as she bounces vigorously on top of him moaning with sexual fervor. Tony can't control his orgasm any longer, exploding a spitfire explosion of warm cum over her face. Kimmy finally brings up the hidden 'egg' that Tony was unable to find...Kimmy pushes out the surprise from inside her snatch, where it's been all along! Happy Easter!","torrent":{"xt":"urn:btih:f2c0c86de221499a54dd5518a4d80206861081ba","amp;dn":"%5BNuruMassage+%2F+FantasyMassage%5D+Kimmy+Granger+%28Easter+Egg+Hunt%29+S","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2c0c86de221499a54dd5518a4d80206861081ba","infoHashBuffer":{"type":"Buffer","data":[242,192,200,109,226,33,73,154,84,221,85,24,164,216,2,6,134,16,129,186]},"announce":[],"urlList":[]}}