{"title":"Femina India - 8 April 2016 (gnv64)","uid":14106473,"size":23301849,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f2c23e4ab3c5435ff8cade1b7ebaeeaca3ee4247&amp;dn=Femina+India+-+8+April+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gnv65","files":5,"time":1459360784,"description":"Femina India - 8 April 2016\r\nEnglish | 80 pages | True PDF | 21.8 mb\r\n\r\nALL ABOUT YOU\r\n18 Love PLANNED! THE BEST DATES OF YOUR LIFE From road trips to triathlons, these dates will create memories you’ll cherish forever\r\n20 Love 7 THINGS HAPPY COUPLES SAY! There’s no substitute for good communication. Say the words that are in your heart\r\n21 Passion HOT ON THE SCENT Your nose will get you in the mood\r\n23 Passion BEST SPOTS FOR A QUICKIE Move your between-the-sheets action to a suitably private elevator or dressing room\r\n24 Relationships BYE-BYE, BESTIE Stay bonded even when miles do you part\r\n26 Celeb cheat sheet TRAVEL THE WORLD LIKE GUL PANAG We get tips from the sta to travel like a pro\r\n27 Money  PARK MONEY &lt;HERE&gt; Do you know your saving account from your checking? We guide you to the best place to keep your cash\r\n29 Career BIAS AT WORK Gender discrimination can cover everything from unequal pay to nosey questions. Here’s how you can tackle it\r\n\r\nFASHION\r\n32 Front row SUMMER ALL DAY Go from beach to party in a cinch\r\n33 Front row LESS &gt; MORE Stay cool, wear less\r\n34 Front row OLD SCHOOL Revisit the ’90s with logo tees, crop tops and tracksuits\r\n35 Front row TRIBAL MAGIC Dance to the beat in layers of fringe and metal\r\n\r\nBEAUTY\r\n56 Masterclass GET THE LOOK Wear some shimmer to work without breaking the dress code\r\n58 Makeup mantra THAT ’70S GIRL Take your cue from Deepika Padukone to work that boho charm\r\n59 Nail edit SPELLBOUND These nail colours will have you feeling like a princess\r\n62 Beauty HOT RIGHT NOW All you need on your beauty shelf\r\n64 Beauty Blast A CLOSE SHAVE WITH BEAUTY Lather up. Shaving has anti-ageing benefits. Here’s all you need to know\r\n\r\nREALITY\r\n68 Cover girl GIRL OF THE MOMENT Nargis Fakhri opens up about getting in shape and why it’s so hard to say goodbye to Bollywood\r\n74 Man we love ‘I GET 60 SELFIE REQUESTS A DAY’ Bigg Boss 9 survivor Keith Sequeira opens up\r\n\r\nTHIS JUST IN\r\n76 5 questions with… PRAKASH JHA The Jai Gangaajal director talks about working with Priyanka Chopra and his own acting debut\r\n78 Trend tracker TRAFFIC STOPPERS! These celebs are flashing red, yellow and green\r\n79 Insider WHAT’S IN A NAME? These films changed their titles to get past censors and controversies\r\n80 The buzzmakers VICKY KAUSHAL— KARMA’S CHAMELEON With a slew of new films out this year, the actor admits that he’s not good with female attention and is still trying to get used to fame\r\n\r\nIN EVERY ISSUE\r\n2 EDITOR’S LETTER\r\n3 TOMBSTONE\r\n6 INBOX\r\n61 BEAUTY MANDATE\r\n \nhttps://s9.postimg.org/vpsp4utsf/Femina+India+-+8+April+2016.jpg \nhttps://s27.postimg.org/jok8pj5n7/Femina+India+-+8+April+2016.jpg","torrent":{"xt":"urn:btih:f2c23e4ab3c5435ff8cade1b7ebaeeaca3ee4247","amp;dn":"Femina+India+-+8+April+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2c23e4ab3c5435ff8cade1b7ebaeeaca3ee4247","infoHashBuffer":{"type":"Buffer","data":[242,194,62,74,179,197,67,95,248,202,222,27,126,186,238,172,163,238,66,71]},"announce":[],"urlList":[]}}