{"title":"Big Hero 6: Baymax Blast Android Game","uid":14099779,"size":45472109,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:f5970d11e3391740ca455bb2320746c2a75bbe22&amp;dn=Big+Hero+6%3A+Baymax+Blast+Android+Game&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1459308111,"description":"This is the official android game  Big Hero 6: Baymax Blast totally free for your mobile phone just download the apk and install on your mobile phone the game is 100% tasted ... ;) \r\n\r\nExperience the thrilling story of Big Hero 6 as you soar through the streets of San Fransokyo! Collect story pages and clips from the feature film, unlock character bios and exclusive background information, and snatch back trails of stolen microbots! Upgrade your tech and explore with new characters, then hang out in the lab with your favorite heroes and their huggable healthcare companion.\r\nFEATURES:\r\n• Collect story pages and film clips, and discover exclusive story content about each of the characters!\r\n• Skirt deadly obstacles and smash through barriers as you streak through San Fransokyo in this action-packed endless runner adventure!\r\n• Retrieve microbots and collect energy to unlock and upgrade cool power-ups, like a phase shifter that lets you survive crashes, and the scorchingly-fast super ion thrusters!\r\n• Add Hiro and Go Go to your flight, or save up to earn silver and gold super suits for Baymax!\r\n• Complete challenging missions to unlock all sorts of rewards, including clips from the feature film, a fully illustrated Big Hero 6 story, and exclusive art, character files, and super-tech blueprints!","torrent":{"xt":"urn:btih:f5970d11e3391740ca455bb2320746c2a75bbe22","amp;dn":"Big+Hero+6%3A+Baymax+Blast+Android+Game","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5970d11e3391740ca455bb2320746c2a75bbe22","infoHashBuffer":{"type":"Buffer","data":[245,151,13,17,227,57,23,64,202,69,91,178,50,7,70,194,167,91,190,34]},"announce":[],"urlList":[]}}