{"title":"Fuck My Ass N Make Me Cum 3 (Digital Sin) 2004","uid":13979074,"size":1467047936,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f6cf0d6430126319b52eb7e2ad3f2f18c013ee93&amp;dn=Fuck+My+Ass+N+Make+Me+Cum+3+%28Digital+Sin%29+2004&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"distinc","files":2,"time":1458674162,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=3285935149\r\n \nhttp://imagedisco.net/?g=771854073\r\n\r\n\r\n\r\nDescription:\r\n\r\nFill her up and fuck her hard. Tyrone Shuz captures an amazing array of blisteringly hot ass sex scenes featuring some of the hottest girls in porn. Every scene delivers on the highest level of backdoor intrusion. These girls love to fuck and it shows!  Enjoy this gonzo anal themed movie shot form a variety of angles.  Enjoy\r\n\r\nExcellent camerawork, lovely lighting, eager girls, hard dicks and very very aggressive action. That's what makes Fuck My Ass N Make Me Cum 3 a scorcher A blistering threesome (Sandra /Ben/Trent) kicks things off in style. The boys put Sandra through her paces mercilessly, and she's up for the challenge. Nice. The Rozy/Zenza coupling steals the show, though. She acts as a table for a chessboard, keeping it steady while Zenza roughly stuffs her mouth. On to lots of choking, anal plungering and A2M, leaving Rozy a sweaty mess. The remaining scenes are also strong. The Tyla/Mark coupling features vigorous anal and generous gape. Another hot threesome presents Chiquita, a hot tamale that gets well violated in every way. The effort closes out with a sensual coupling (Christina/Mark). Cast: Roxy Jezel, Sandra Romain, Chiquita Lopez, Tyla Wynn, Christina, Ben English, Trent, Zenza, Mark Ashley, Marco Duato.\r\n\r\n\r\nBen English, Chiquita Lopez, Marco Duato, Mark Ashley, Roxy Jezel, Sandra Romain, Trent Soluri, Tyla Wynn, Zenza Raggi","torrent":{"xt":"urn:btih:f6cf0d6430126319b52eb7e2ad3f2f18c013ee93","amp;dn":"Fuck+My+Ass+N+Make+Me+Cum+3+%28Digital+Sin%29+2004","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6cf0d6430126319b52eb7e2ad3f2f18c013ee93","infoHashBuffer":{"type":"Buffer","data":[246,207,13,100,48,18,99,25,181,46,183,226,173,63,47,24,192,19,238,147]},"announce":[],"urlList":[]}}