{"title":"Attack On Titan","uid":13731208,"size":7268991683,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f94e7f53c55c14043903ff9f2348a7d1f782473b&amp;dn=Attack+On+Titan+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kailer24","files":24,"time":1457013399,"description":"Há décadas, a humanidade foi quase exterminada pelo súbito aparecimento de seres humanoides gigantes, conhecido como Titãs. Os Titãs são criaturas que, aparentemente, possuem pouca inteligência, mas, com uma força bruta quase insuperável, têm como principal objetivo devorar seres humanos, sem nenhum motivo aparente para isso.\r\n\r\nDurante 107 anos, as cidades fortificadas por detrás das muralhas foram testemunhas de ataques sem sucesso dos Titãs. Assim, um pequeno grupo de seres humanos sobreviveu no interior das muralhas protegidos por paredes superiores a três vezes a altura dos maiores Titãs registados até a data.\r\n\r\nNuma grande cidade localizada na parte periférica da muralha, vivia Eren Jaeger, com seus pais e sua amiga, Mikasa Ackerman, que estava sob os cuidados da família. Eren vivia uma vida pacata, porém incomodado com o conformismo das pessoas que haviam aceitado a sua condição de passar a eternidade dentro dos muros, desistindo de lutar contra os Titãs. A paz durou até o aparecimento do Titã Colossal, uma criatura de cerca de 60 metros de altura, que superava o tamanho da muralha, de 50. Este Titã destruiu o portão da cidade onde vivia Eren, que ligava a muralha ao &quot;mundo exterior&quot;.\r\n\r\nCom isso, uma grande quantidade de Titãs menores pôde entrar, ocupando grande parte do território até então pertencente aos humanos. Durante este evento, Eren e Mikasa presenciam o horror de ver sua mãe ser devorada viva. Após este trauma, Eren jurou exterminar os Titãs, e entra para a &quot;Tropa de Exploração&quot; para cumprir seu objetivo","torrent":{"xt":"urn:btih:f94e7f53c55c14043903ff9f2348a7d1f782473b","amp;dn":"Attack+On+Titan+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f94e7f53c55c14043903ff9f2348a7d1f782473b","infoHashBuffer":{"type":"Buffer","data":[249,78,127,83,197,92,20,4,57,3,255,159,35,72,167,209,247,130,71,59]},"announce":[],"urlList":[]}}