{"title":"Broke Models - Autumn (Homemade) [.jpg] [.wmv]","uid":14087851,"size":2007582332,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:fa449e53295087bc6a1e83c6ad135601bd492bd7&amp;dn=Broke+Models+-+Autumn+%28Homemade%29+%5B.jpg%5D+%5B.wmv%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LucasCar","files":27,"time":1459274787,"description":"How do you know you have met a super trashy hooker off Craig’s list? That my friends is a trick question if these girls are willing to fuck for almost nothing when you throw a decent number at them they will go above and beyond their white trash aspirations. Enter Autumn she cleans up nice till you realize she is just fucked up from the get go. She’s been beaten, molested, had her tit.... well I do not even know where to start with this one, but I did have it how I wanted it in my mind to end. I ask her a little about herself and learn enough where I just want her to shut up. I get her on the hotel bed to masturbate for me which at this point, and still pretty sure she had some bed bugs crawl out her sex toy box from the last cheap motel she was at. After watching her live though her life’s traumas playing with herself I have her go down and suck my cock. She at least gets a B for effort there. I was not really sure I wanted to fuck her but she said she was down for anal. I am pretty sure I tore her asshole apart she even threatened to hit me if I didn't stop. What happens next is priceless even though I was second guessing it worrying that this girl would snap and try to kill me. I convince her I am just going to cum on her face and to close her eyes. Unknowing to her I dumped a full bucket of ice water on her head. I think she was more in shock then anything! Never less she ran to the bathroom to clean up cussing me out. I put her in her place when I told her she was not going to get paid shit if she didn't bend over the bed so I could cum. Normally I would bust inside a girl and give her plan B, but I didn't have any on hand and this trashy whore would keep the kid to get some child support. After I pay her she stormed out and I haven’t heard anything since..... Maybe I will soon since this video was supposed to be for my private collection and all...\r\n \nhttp://naughtyimage.com/img-56faa7e1137b9.html\r\n \nhttp://naughtyimage.com/img-56faa7e874781.html\r\n \nhttp://naughtyimage.com/img-56faa7ec8d8db.html\r\n\r\n\r\n\r\n* * * For more stuff please visit * * * \nhttps://thepiratebay.se/user/LucasCar/","torrent":{"xt":"urn:btih:fa449e53295087bc6a1e83c6ad135601bd492bd7","amp;dn":"Broke+Models+-+Autumn+%28Homemade%29+%5B.jpg%5D+%5B.wmv%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa449e53295087bc6a1e83c6ad135601bd492bd7","infoHashBuffer":{"type":"Buffer","data":[250,68,158,83,41,80,135,188,106,30,131,198,173,19,86,1,189,73,43,215]},"announce":[],"urlList":[]}}