{"title":"Bekenntnisse des Hochstaplers Felix Krull (3_5) DSR.mkv","uid":13620315,"size":1896424563,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fac448b5aef220743bbeaf92f0271de9d5d30984&amp;dn=Bekenntnisse+des+Hochstaplers+Felix+Krull+%283_5%29+DSR.mkv&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"salsasat","files":1,"time":1455964429,"description":"A German soldier sent to Paris during World War I. He casts aside his uniform and gets a job as an elevator operator. A handsome lug, pursued by virtually every female who enters his little compartment. But the lad is shy, and besides, he'd rather discuss anthropology.\r\n\r\nDeutsche Erstausstrahlung: 24.01.1982 (ZDF)\r\nSpielfilm in 5 Teilen\r\n\r\n\r\nFolge 3\r\n\r\nFelix ist fest entschlossen, sein Glück zu machen. - Bei einer Zoll- kontrolle gerät auf geheimnisvolle Weise, ganz zufällig, das Schmuck- kästchen einer schönen Mitreisenden in Felix' Gepäck. - Die Realität im legendären, mondänen Monte Carlo, dem Inbegriff der reichen Welt in jener Zeit der Belle Epoche, sieht zunächst etwas anders aus, als Felix es sich vorgestellt hatte. Als Liftboy Armand des vornehmen Hotel de Paris bekommt er zu wenig Lohn, schlechtes Essen und eine dürftige Unterkunft.- Indessen kam sein Zimmergenosse Stanko hinter das Geheimnis des Schmuckkästchens und drängt sich als Ratgeber für den Verkauf der Sächelchen auf. Als Felix bei dem Hehler Jean- Pierre eine ansehnliche Summe bekommt, geht ein Anteil vom Erlös an Stanko.- Da taucht plötzlich die Besitzerin des Kästchens auf, Madame Houpfle, Gattin des Kloschüsselfabrikanten aus Straßbourg und dich- tende Dilettantin unter dem Künstlernamen Diane Philibert, die sich für ihre mediokre Ehe mit exzentrischen Liebesaffairen entschädigt, um diese dann für ihre Schriftstellerei auszuplündern. Aus dem Fahr- stuhl heraus verführt sie Felix hinein in ihre Suite, und als dieser ihr auch noch gesteht, wie er in den Besitz des Schmuckkästchens kam, ist die Freude der Madame grenzenlos. Nicht nur ein kleiner Lifttreiber, sondern auch noch ein ganz gewöhnlicher Dieb ist jetzt ihr Liebhaber - wie köstlich das den Geist erniedrigt! Dafür will Madame Houpfle Felix aufs reichlichste belohnen. Er soll all ihren Schmuck, ihre Wertsachen, ihr Geld stehlen - unter ihren Augen - wie Hermes, der göttliche Dieb. Felix tut dies gewissenhaft und kann anderntags feststellen, daß er ein kleines Vermögen erworben hat ... DarstellerInnen: John Moulder-Brown (Felix), Magalie Noel (Madame Houpfle), Hans-Heinz Moser (Direktor Stürzli), Pierre Doris (Hoteldetektiv), Alain Flick (Monsieur Machatschek), Rolf Zacher (Stanko), Bernhard Musson (Portier), Louis Navarre (Receptionist), Michael Kröcher (Wacek), Nikolas Lamski (Jean-Pierre).\r\nText: ORF III\r\n\r\nmit John Moulder-Brown (Felix), Oliver Wehe (Felix als Kind), Daphne Wagner (Mutter Krull), Klaus Schwarzkopf (Vater Krull), Mareike Carrière (Olympia), Magali Noël (Madame Houpfle), Hans Heinz Moser (Direktor Stürzli), Pierre Doris (Hoteldetektiv), Alain Flick (Monsieur Machatschek), Rolf Zacher (Stanko), Franziska Walser (Genoveva), Rita Tushingham (Mrs. Twentyman), Vera Tschechowa (Maria Pia), Georgia Slowe (Zouzou), Fernando Rey (Professor Kuckuck), Kurt Raab (Sally Meerschaum), Nikolaus Paryla (Schimmelpreester), Despina Pajanou (Rosza), James Cossins (Lord Kilmarnock), Marie Colbin (Zaza) Musik: Nicos Mamangakis Kamera :Dietrich Lohmann, Produzent :Peter Märthesheimer, Schnitt :Susan Berthel-Ying\r\n\r\nRegie: Bernhard Sinkel","torrent":{"xt":"urn:btih:fac448b5aef220743bbeaf92f0271de9d5d30984","amp;dn":"Bekenntnisse+des+Hochstaplers+Felix+Krull+%283_5%29+DSR.mkv","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fac448b5aef220743bbeaf92f0271de9d5d30984","infoHashBuffer":{"type":"Buffer","data":[250,196,72,181,174,242,32,116,59,190,175,146,240,39,29,233,213,211,9,132]},"announce":[],"urlList":[]}}