{"title":"Plague Inc Evolved","uid":13675381,"size":237830006,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fb9c6412e61e4d21298680e746ae17f3db1ce40b&amp;dn=Plague+Inc+Evolved&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bowcom","files":1,"time":1456395862,"description":"Laguage: English\r\nSize: 226.8 MB\r\n\r\nPlague Inc: Evolved is a unique mix of high strategy and terrifyingly realistic simulation. Your pathogen has just infected 'Patient Zero' - now you must bring about the end of human history by evolving a deadly, global Plague whilst adapting against everything humanity can do to defend itself. \r\n\r\nPlague Inc. is so realistic that the CDC even asked the developer to come and speak about the infection models in the game! http://blogs.cdc.gov/publichealthmatters/2013/04/plague-inc/. \r\n\r\nOver 35 million players have been infected by Plague Inc., and Plague Inc: Evolved combines the original critically acclaimed gameplay with significant, all-new features for PC: \r\n\r\nInfectious Multiplayer - cooperative and competitive gameplay modes let you team up to fight the cure with friends, or compete in a race to kill the world. \r\nContagious Content Creator - hit the lab and develop your own custom scenarios, creating new plague types and worlds. Bring your deadliest ideas to life and share them with Steam Workshop. \r\nBlinding Graphics - including full 3D disease models taking you closer to your plague than ever before, city-cams showing humanity's struggle at street level, and the body scanner highlighting the full effect of your mutations, organ by organ. \r\nDeadly Data - predict government responses with priority indicators, geek out with loads of new stats and graphs, and analyse your best strategies with end-of-game replays.\r\n\r\nPlease note that Plague Inc: Evolved is currently in Early Access (see above for more details). We are currently hard at work and will be adding / polishing features over the coming weeks. More information: http://www.ndemiccreations.com/en/31-plague-inc-evolved-early-access. \r\n\r\n\r\nFEATURES\r\n* 10 Different Disease Types – Master every pathogen; from bacteria to bio-weapons and mind control to zombies, end humanity by any means possible – different diseases will need radically different approaches. \r\n* Infectious Multiplayer – Cooperative and Competitive gameplay; team up to fight the cure with friends, or compete in a race to kill the world. \r\n* Contagious Content Creator – Hit the lab; develop your own custom scenarios - creating new plague types and worlds. Bring your deadliest ideas to life and share them with Steam Workshop. \r\n* 18 Unique Scenarios – Adapt your strategy; scenarios create further challenges for your pandemic – how will you handle a new strain of Swine Flu, or infect a world in Ice Age? \r\n* Stunning Graphical Features – Watch your disease take hold; witness your pathogen mutate in real-time disease models, see humanity's struggle at street-level on city-cams, and watch the full effect of your mutations organ-by-organ on the body scanner. \r\n* Hyper-Realistic World – Strategize in the real world; advanced AI and use of real-world data and events make Plague Inc: Evolved a highly authentic simulation of a world-ending pathogen. Even the CDC likes it! \r\n* Deadly Data - Geek out with stats and graphs; monitor infection and death levels, track government reactions and cure efforts, then review your plague's success (or failure!) with full game replays. \r\n* And much more... - Including speed runs, Mega-Brutal difficulty and genetic modification... Plus loads of new disease types and scenarios in future (free!) updates","torrent":{"xt":"urn:btih:fb9c6412e61e4d21298680e746ae17f3db1ce40b","amp;dn":"Plague+Inc+Evolved","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb9c6412e61e4d21298680e746ae17f3db1ce40b","infoHashBuffer":{"type":"Buffer","data":[251,156,100,18,230,30,77,33,41,134,128,231,70,174,23,243,219,28,228,11]},"announce":[],"urlList":[]}}